Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: When will my course re-run start?
sw_ke: Lini uendeshaji upya wa koziyangu utaanza?

source: The new course is set to start on January 1, 2030 at midnight (UTC).
sw_ke: Fanni mpya imepangwa kuanza januari 1, 2030 usiku wa manane (UTC).

source: What transfers from the original course?
sw_ke: Kipi kinahamishwa kutoka kwa kozi asili?

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
sw_ke: Fanni mpya ina miongozo sawa na yaliyomo pia kama fanni asili. Matatizo, video, matangazo, na faili nyenginezo ni pacha kwa fanni mpya.

source: What does not transfer from the original course?
sw_ke: Kipi hakihamishwi kutoka kwenye kozi asili?

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
sw_ke: Wewe ni mshiriki pekee wa kozi mpya. Hakuna wanafunzi wanaosajiliwa katika kozi, na hakuna taarifa ya mwanafunzi. Hakuna maudhui ya mada za majadiliano au wiki.

source: Learn more about Course Re-runs
sw_ke: Jifunze zaidi kuhusu Uendeshaji upya wa Kozi

source: Course Updates
sw_ke: Taarifa mpya za Kozi

source: New Update
sw_ke: Ukamilishaji Mpya

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
sw_ke: Tumia taarifa mpya za kozi kujulisha wanafunzi kuhusu tarehe muhimu au mitihani, angazia mazungumzo maalum kwenye majadiliano, tangaza mabadiliko ya ratiba, na majibu kwa maswali ya wanafunzi. Utaongeza au kuhariri taarifa katika HTML.

source: This course was created as a re-run. Some manual configuration is needed.
sw_ke: Kozi hii ilibuniwa kama uendeshaji upya. Baadhi muongozo wa mkusanyiko unaongezewa.

source: No course content is currently visible, and no learners are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
sw_ke: Hakuna maudhui ya kozi yanayoonekana kwa sasa, na hakuna usajili wa wanafunz. Hakikisha unapita upya na kupanga upya tarehe zote, ikiwemo Tarehe ya Kuanza Kozi; panga timu ya kozi; pita upya taarifa mpya na zana nyingine na tarehe zake; na fuatilia majadiliano na wiki.

source: Warning
sw_ke: Ilani

source: This course uses features that are no longer supported.
sw_ke: Kozi hii inatumia vipengele ambavyo haviendani tena.

source: You must delete or replace the following components.
sw_ke: Lazima ufute au ubadilishe vipengele vifuatavyo.

source: Unsupported Components
sw_ke: Vipengele ambavyo haviendani

source: Deprecated Component
sw_ke: Kipengele kilichopingwa

source: To avoid errors, {platform_name} strongly recommends that you remove unsupported features from the course advanced settings. To do this, go to the {link_start}Advanced Settings page{link_end}, locate the "Advanced Module List" setting, and then delete the following modules from the list.
sw_ke: Kuepuka hitilafu, {platform_name} imependekezwa uondoe vipengele visivyo wezeshwa kutoka kwa mikakati ya kozi iliyoboreshwa. Kufanya hivi, nenda kwa {link_start}Ukurasa wa Kuboresha Mikakati{link_end}, ashiria mikakati "Orodha ya Moduli Iliyoboreshwa", na kisha futa moduli zifuatazo kutoka kwenye orodha.

source: Unsupported Advance Modules
sw_ke: Moduli zilizoboreshwa zisizoendana

source: Click to add a new section
sw_ke: Bofya kuongeza kipengele kipya

source: New Section
sw_ke: Kipengele Kipya

source: Reindex current course
sw_ke: Ingiza tena kozi ya sasa hivi

source: Reindex
sw_ke: Ingiza tena kielezo

source: Collapse All Sections
sw_ke: Batiliilisha vipengele vyote

source: Expand All Sections
sw_ke: Panua Vipengele Vyote

source: Click to open the courseware in the LMS in a new tab
sw_ke: Bonyeza ufungue Maudhui ya kozi katika LMS kwenye tab mpya.

source: View Live
sw_ke: Tazama Mubashara

source: Edit Start Date
sw_ke: Hariri Tarehe ya Kuanza

source: Course Pacing:
sw_ke: Hatua ya Kozi:

source: Self-Paced
sw_ke: Mafunzo yasiyokuwa na ratiba ya mwalimu

source: Instructor-Paced
sw_ke: Mafunzo yenye ratiba ya mwalimu

source: Creating your course organization
sw_ke: Pangilia kozi zako

source: You add sections, subsections, and units directly in the outline.
sw_ke: Uongeze vifungu, vifungu toto, na vitengo moja kwa moja kwenye muongozo.

source: Create a section, then add subsections and units. Open a unit to add course components.
sw_ke: Tengeneza kifungu, kisha ongeza vifungu vidogo na vitengo. Fungua kitengo uongeze vipengele vya kozi.

source: Reorganizing your course
sw_ke: Kupanga upya kozi yako

source: Drag sections, subsections, and units to new locations in the outline.
sw_ke: Buruta vifungu, vifungu toto, na vitengo kwa maeneo mapya kwenye muongozo.

source: Learn more about the course outline
sw_ke: Jifunze mengi kuhusu muhtasari wa kozi

source: Setting release dates and grading policies
sw_ke: Kupanga tarehe za kutolea na kanuni za ubora

source: Select the Configure icon for a section or subsection to set its release date. When you configure a subsection, you can also set the grading policy and due date.
sw_ke: Chagua kigingi cha mkusanyiko wa kifungu au vifungu toto kuweka tarehe ya kutolea. Ukikusanya kifungu toto, waweza pia kupanga kanuni ya ubora na tarehe yakutarajia.

source: Learn more about grading policy settings
sw_ke: Jifunze zaidi kuhusu mitegesho ya kanunu na taratibu za utoaji madaraja

source: Changing the content learners see
sw_ke: Kubadilisha maudhui wanayoyaona wanafunzi

source: To publish draft content, select the Publish icon for a section, subsection, or unit.
sw_ke: Kuchapisha waraka wa yaliyomo, chagua kigingi cha kuchapisha kwa kifungu, kifungu toto, au kitengo.

source: To make a section, subsection, or unit unavailable to learners, select the Configure icon for that level, then select the appropriate {em_start}Hide{em_end} option. Grades for hidden sections, subsections, and units are not included in grade calculations.
sw_ke: Kufanya sehemu kuu, sehemu ndogo au sura isionekane na wanafunzi, chagua ikoni ya Configure kwa ajili ya kazi hiyo, kisha chagua kipengele husika {em_start}Ficha{em_end}. Alama/madaraja ya sehemu kuu, sehemu ndogo na sura zilizofichwa hazijumuishwi kwenye ukokotoaji wa madaraja.

source: To hide the content of a subsection from learners after the subsection due date has passed, select the Configure icon for a subsection, then select {em_start}Hide content after due date{em_end}. Grades for the subsection remain included in grade calculations.
sw_ke: KUficha maudhui ya sehemu ndogo yasionekane na wanafunzi baada ya tarehe husika kupita, chagua ikoni ya Configure kwa ajili ya sehemu ndogo, kisha chagua{em_start}Ficha maudhui baada ya tarehe husika{em_end}. Alama za sehemu ndogo bado zinajumuishwa kwenye ukokotoaji madaraja.

source: Learn more about content visibility settings
sw_ke: Jifunze zaidi kuhusu mitegesho ya muonekano wa maudhui

source: Pages
sw_ke: Kurasa

source: New Page
sw_ke: Ukurasa Mpya

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
sw_ke: Ilani: Kurasa zinazo onekana na umma. Kama watumiaji wanajua URL ya ukurasa, wanaweza kutizama hata kama hawaja jiandikisha au kuingia katika fanni.

source: Show this page
sw_ke: "Onesha" ukurasa huu

source: Show/hide page
sw_ke: Onyesha/ficha ukurasa

source: This page cannot be reordered
sw_ke: Ukurasa "huu" hauwezi kupangwa upya

source: You can add additional custom pages to your course.
sw_ke: Unaweza kuongeza kurasa za kuweza kufanya mabadiliko kwa kozi yako.

source: Add a New Page
sw_ke: Ongeza Ukurasa Mpya

source: What are pages?
sw_ke: Kurasa ni nini?

source: Pages are listed horizontally at the top of your course. Default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
sw_ke: Kurasa zinaorodheshwa usawa juu katika fanni yako. Kurasa za default (Home, Course, Discussion, Wiki, and Progress) zina fuatwa na vitabu vy kiada na kurasa za desturi unazo buni.

source: Custom pages
sw_ke: Kurasa za desturi

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
sw_ke: Unaweza kubuni na kukagua kurasa za desturi kuwapa wanafunzi nyongeza za yaliyomo katika fanni. Kwa mfano, waweza kubuni kurasa za kanuni ya ubora, mitelezo ya fanni, na kalenda ya fanni.

source: How do pages look to students in my course?
sw_ke: Kurasa zinaonekana vipi kwa wanafunzi kwenye kozi yangu?

source: Students see the default and custom pages at the top of your course and use these links to navigate.
sw_ke: Wanafunzi wanaona kurasa za desturi na default juu katika fanni yako na wanatumia viunganishi hivi kwa kumarisi.

source: See an example
sw_ke: Tazama mfano

source: Pages in Your Course
sw_ke: Kurasa katika Kozi Yako

source: Preview of Pages in your course
sw_ke: Upitiaji wa Kurasa katika kozi yako

source: Pages appear in your course's top navigation bar. The default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
sw_ke: Kurasa zinatokeza juu katika ulingo wa kumarisi wa fanni yako. Kurasa za default (Home, Course, Discussion, Wiki, and Progress) zinafuatiwa na vitabu vya kiada na kurasa za desturi.

source: close modal
sw_ke: "funga" kielelezo

source: Internal Server Error
sw_ke: Hitlafu ya Seva ya Ndani

source: The Page You Requested Page Cannot be Found
sw_ke: Ukurasa Ulioomba Haupatikani

source: We're sorry. We couldn't find the {studio_name} page you're looking for. You may want to return to the {studio_name} Dashboard and try again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
sw_ke: Tunasikitika. Hatukuweza kupata {studio_name} ukurasa unao tafuta. Ungehitaji kurudia kwa {studio_name} Dashboard na ujaribu tena. Kama bado unatatizika kufikia vitu/mambo, tafadhali jiskie huru ku {link_start}wasiliana na {studio_name} saidia{link_end} kwa usaidizi zaidi.

source: The Server Encountered an Error
sw_ke: Seva Ilipata Hitlafu

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the {studio_name} Dashboard or try this request again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
sw_ke: Tunasikitika. Kulikuwa na tatizo na sava tukijaribu kutayarisha ombi lako la mwisho. Ungehitaji kurudi kwa {studio_name} Dashboard au kujaribu ombi hili tena. Kama bado unatatizika kufikia mambo, tafadhali kuwa huru ku {link_start}wasiliana na{studio_name}msaada{link_end}kwa usaidizi zaidi.

source: Back to dashboard
sw_ke: Rudi kwenye "ubao""

source: Library Export
sw_ke: Upelekaji "Maktaba"

source: Course Export
sw_ke: Upelekaji wa Kozi

source: Tools
sw_ke: Zana

source: About Exporting Libraries
sw_ke: Kuhusu Uhamishaji wa "Maktaba"

source: You can export libraries and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the library structure and content. You can also re-import libraries that you've exported.
sw_ke: Unaweza kupeleka nje maktaba na uzikague nje ya {studio_name}. Faili iliyo pelekwa nje ni .tar.gz faili (that is, a .tar file compressed with GNU Zip) ambayo ina mjengo na yaliyomo ya maktaba. Waweza pia ku pokea upya maktaba ulizo peleka nje.

source: About Exporting Courses
sw_ke: Kuhusu Upelekaji wa Kozi

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
sw_ke: Unaweza kupeleka nje fanni na uzikague nje ya {studio_name}. Faili iliyo pelekwa nje ni faili ya .tar.gz (that is, a .tar file compressed with GNU Zip) ambayo ina mjengo na yaliyomo kwenye fanni. Unaweza pia kupokea upya fanni ulizotuma nje.

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
sw_ke: {em_start}Tahadhari:{em_end} Unapotuma nje fanni, taarifa kama MATLAB API funguo, LTI vyeti vya kusafiri nje, dokezo za masharti ya siri, na dokezo za uhifadhi URLs zikiwemo katika habari za upelekaji nje. Ukizishirisha faili zako za kupeleka nje, waweza pia kishirikisha taarifa nyeti au liseni maalum.

source: Export My Library Content
sw_ke: Tuma Maudhui ya Maktaba Yangu

source: Export My Course Content
sw_ke: Tuma "Maudhui" ya Kozi Yangu

source: Export Library Content
sw_ke: Tuma "Maudhui" ya Maktaba

source: Export Course Content
sw_ke: Tuma "Maudhui" ya Kozi

source: Library Export Status
sw_ke: Hali ya Maktaba ya Taarifa

source: Course Export Status
sw_ke: Hali ya Uhifadhi wa taarifa za Kozi

source: Preparing
sw_ke: Inajiandaa

source: Preparing to start the export
sw_ke: Inajiandaa kuanza kunakili taarifa

source: Exporting
sw_ke: Inanakili taarifa

source: Creating the export data files (You can now leave this page safely, but avoid making drastic changes to content until this export is complete)
sw_ke: Kutengeneza mafaili ya kuhifadhi taarifa (Sasa unaweza kutoka kwenye ukurasa huu, lakini epuka kufanya mabadiliko ya makubwa kwenye maudhui mpaka zoezi la kunakili na kuhifadhi taarifa likamilike)

source: Compressing
sw_ke: Kuandaa nafasi kwenye mafaili

source: Compressing the exported data and preparing it for download
sw_ke: Kuandaa nafasi kwenye mafaili kwa ajili kuhifadhi taarifa na kuziandaa kwa ajili ya upakuaji

source: Success
sw_ke: Mafanikio

source: Your exported library can now be downloaded
sw_ke: Maktaba yako iliyohifadhiwa inaweza kupakuliwa sasa

source: Your exported course can now be downloaded
sw_ke: Kozi zako zilizohofadhiwa zinaweza kupakuliwa sasa

source: Download Exported Library
sw_ke: Pakua Maktaba Iliyohifadhiwa

source: Download Exported Course
sw_ke: Pakua Kozi Zilizohifadhiwa

source: Data {em_start}exported with{em_end} your course:
sw_ke: Tarehe {em_start}pelekwa nje na{em_end} fanni yako:

source: Values from Advanced Settings, including MATLAB API keys and LTI passports
sw_ke: Tathmini kutoka kwa Mikakati ya Ubora, zikiwemo funguo za MATLAB API na vyeti vya usafiri nje vya LTI

source: Course Content (all Sections, Sub-sections, and Units)
sw_ke: Yaliyomo ya Fanni (all Sections, Subsections, and Units)

source: Course Structure
sw_ke: Muundo wa Fanni

source: Individual Problems
sw_ke: Matatizo ya Kibinafsi

source: Course Assets
sw_ke: Rasili mali za Fanni

source: Course Settings
sw_ke: Mitegesho ya Kozi

source: Data {em_start}not exported{em_end} with your course:
sw_ke: Taarifa {em_start}haijatumwa nje{em_end} na fanni yako:

source: User Data
sw_ke: Habari za Mtumiaji

source: Course Team Data
sw_ke: Habari za Kikosi cha Fanni

source: Forum/discussion Data
sw_ke: Taarifa za Jukwaa/majadiliano

source: Why export a library?
sw_ke: Kwanini utume nje maktaba?

source: You may want to edit the XML in your library directly, outside of {studio_name}. You may want to create a backup copy of your library. Or, you may want to create a copy of your library that you can later import into another library instance and customize.
sw_ke: Ungependa kukagua XML katika maktaba yako moja kwa moja, nje ya {studio_name}. Ungependa kubuni kiigizo cha usaidizi wa maktaba yako. Au, ungehitaji kubuni kiigizo cha maktaba yako ambayo waweza kuipokea kwenye mfano wa maktaba nyingine na uipe desturi.

source: Opening the downloaded file
sw_ke: Ufunguzi wa faili iliyoshukishwa/iliyoshushwa

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the library.xml file, as well as subfolders that contain library content.
sw_ke: Tumia ratiba ya maktaba kutoa habari kutoka kwa faili ya .tar.gz. Taarifa iliyotolewa maktaba ikiwemo faili ya .xml, pamoja na mikunjo midogo iliyo na yaliyomo ya maktaba.

source: Learn more about exporting a library
sw_ke: Jifunze mengi kuhusu upelekaji nje wa maktaba

source: Why export a course?
sw_ke: Kwanini utume nje fanni?

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
sw_ke: Ungependa kukagua XML kwenye fanni yako moja kwa moja, nje ya {studio_name}. Ungependa kubuni kiigizo cha usaidizi wa fanni yako. Au, ungehitaji kubuni kiigizo cha fanni yako ambayo unaweza kuippokea katika mfano wa fanni nyingine na uipe desturi.

source: What content is exported?
sw_ke: Ni yapi yaliyomo yanayo tumwa nje?

source: The course content and structure (including sections, subsections, and units) are exported. Values from Advanced Settings, including MATLAB API keys and LTI passports, are also exported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, is not exported.
sw_ke: Muundo na yaliyomo ya fanni (including, sections, subsections, and units) yametumwa nje. Tathmini ya Mikakati iliyo Boreshwa, zikiwemo funguo za MATLAB API na vyeti vya usafiri vya LTI, pia vimetumwa nje. Habari nyingine, zikiwemo za wanafunzi, uboreshaji, mazungumzo ya kongamano, mikakati ya fanni, za kikosi cha fanni, hazikutumwa nje.

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
sw_ke: Tumia mpango wa hifadhi za nyaraka kung'oa habari kutoka kwa faili ya .tar.gz. Habari zilizong'olewa ni pamoja na faili ya fanni ya .xml, mikunjo midogo ambayo ina yaliyomo ya fanni.

source: Learn more about exporting a course
sw_ke: Jifunze mengi kuhusu kutuma nje fanni

source: Export Course to Git
sw_ke: Tuma Fanni nje kwa Git

source: Export to Git
sw_ke: Tuma nje kwa Git

source: About Export to Git
sw_ke: Kuhusu Kutuma Nje kwa Git

source: Use this to export your course to its git repository.
sw_ke: Tumia hii kutuma nje fanni yako kwa umiliki wake wa git.

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
sw_ke: Hii kisha itafyatua ukamilishaji wakiwenyewe wa tovuti ya LMS hasa na ikamilishe yaliyomo ya fanni yako yaonekanayo kwa wanafunzi kama mapokezi yakiwenyewe ya git yatapangwa.

source: Export Course to Git:
sw_ke: Tuma Nje Fanni kwa Git:

source: giturl must be defined in your course settings before you can export to git.
sw_ke: lazima giturl ibainishwe katika mikakati ya fanni yako kabla uweze kutuma nje kwa git.

source: Export Failed
sw_ke: Utumaji nje Haukufaulu

source: Export Succeeded
sw_ke: Utumaji nje Umefaulu

source: Your course:
sw_ke: Kozi yako:

source: Course git url:
sw_ke: Fanni ya git url:

source: Experiment Group Configurations
sw_ke: Jaribu Mikusanyiko ya Kundi

source: This module is disabled at the moment.
sw_ke: Moduli hii imenyimwa uwezo kwa sasa hivi.

source: Enrollment track groups allow you to offer different course content to learners in each enrollment track. Learners enrolled in each enrollment track in your course are automatically included in the corresponding enrollment track group.
sw_ke: Makundi rika ya usajili yanakuwezesha kutoa maudhui mahususi kwa wanafunzi katika kila kundi la usajili. Wanafunzi waliondikishwa kwenye kila kundi rika la usajili katika kozi yako watajumuishwa moja kwa moja kwenye kundi rika husika la usajili.

source: On unit pages in the course outline, you can restrict access to components to learners based on their enrollment track.
sw_ke: Katika kurasa za mwanzo za muhtasari wa kozi, unaweza kuzuia wanafunzi wasipate baadhi ya vipengele kulingana na makundi rika yao ya usajili.

source: You cannot edit enrollment track groups, but you can expand each group to view details of the course content that is designated for learners in the group.
sw_ke: Huwezi kuhariri makundi rika ya usajili, lakini kuongeza kipengele kuruhusu kila kundi kuona utondoti/ maelezo ya maudhui ya kozi mahususi kwa kila kundi la wanafunzi.

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
sw_ke: Kama kuna muungano uliofungamana katika kozi yako, unaweza kutumia vikundi vya yaliyomo kubuni mafungamano maalum ya courseware. Kwa lugha nyingine, kuyapa desturi yaliyomo kuwa waliofungamana maalum waone katika kozi yako.

source: Each content group that you create can be associated with one or more cohorts. In addition to making course content available to all learners, you can restrict access to some content to learners in specific content groups. Only learners in the cohorts that are associated with the specified content groups see the additional content.
sw_ke: Kila fungu la maudhui unalotengeneza linaweza kuhusishwa na kundi moja au zaidi la wanafunzi. Mbali ya kuweza kuweka maudhui yapatikane na kila mwanfunzi, unaweza pia kuzuia maudhui fulani yasipatikane na wanafunzi walio kwenye makundi maalum. Wanafunzi walio kwenye kundi fulani pekee ambao wanahusiana na maudhui fulani ya kozi watayaona maudhui ya ziada.

source: Click {em_start}New content group{em_end} to add a new content group. To edit the name of a content group, hover over its box and click {em_start}Edit{em_end}. You can delete a content group only if it is not in use by a unit. To delete a content group, hover over its box and click the delete icon.
sw_ke: Bonyeza {em_start}Kundi jipya la yaliyomo{em_end} kuongeza kwa kundi la yaliyomo jipya. Kuhariri jina la kundi la yaliyomo, vinjari kwenye kisanduku chake na ubonyeze {em_start}Hariri{em_end}. Waweza kufuta kundi la yaliyomo pindi tu iwapo halitumiki kwa kitengo. Kufuta kundi la yaliyomo, vinjari kwenye kisanduku chake na bonyeza taswira ya kufuta.

source: Use experiment group configurations if you are conducting content experiments, also known as A/B testing, in your course. Experiment group configurations define how many groups of learners are in a content experiment. When you create a content experiment for a course, you select the group configuration to use.
sw_ke: Tumia usabidi wa kundi la majaribio kama unafanya majaribio ya maudhui, pia inajulikana kama jaribio la A/B, kwenye kozi yako. Usabidi wa kundi la majaribio unatoa maelezo juu idadi ya wanafunzi wapo kwenye maudhui ya majaribio. Unapo tengeneza maudhui ya majaribio kwa ajili ya kozi, unachagua kundi la usabidi utakalotumia.
