Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Enter the number of components to display to each student.
sw_ke: Ingiza idadi ya vipengele kuonyesha kwa kila mwanafinzi.

source: Problem Type
sw_ke: Andika Tatizo

source: Choose a problem type to fetch from the library. If "Any Type" is selected no filtering is applied.
sw_ke: Chagua aina ya tatizo kuchota kutoka kwa maktaba. Kama "Aina Yoyote" ndio imechaguliwa hakuna uchujaji utafanyika.

source: This component is out of date. The library has new content.
sw_ke: Kipengele hiki kimemaliza muda. Maktaba ina yaliyomo mapya.

source: {refresh_icon} Update now.
sw_ke: {refresh_icon} Kamilisha sasa.

source: Library is invalid, corrupt, or has been deleted.
sw_ke: Maktaba ni batili, fisadi, au imefutwa.

source: Edit Library List.
sw_ke: Hariri Orodha ya Maktaba.

source: This course does not support content libraries. Contact your system administrator for more information.
sw_ke: Kozi hii haisaidii yaliyomo ya maktaba. Wasiliana na mtawala wa mpango wako kwa habari zaidi.

source: A library has not yet been selected.
sw_ke: Maktaba bado haija chaguliwa.

source: Select a Library.
sw_ke: Chagua Maktaba.

source: There are no matching problem types in the specified libraries.
sw_ke: Hakuna aina za matatizo ya uwiyano katika maktaba hizi hasa.

source: Select another problem type.
sw_ke: Chagua aina ya tatizo jingine.

source: The specified library is configured to fetch {count} problem,
sw_ke: Maktaba iliyotajwa imepangwa kuchota tatizo {count},

source: but there is only {actual} matching problem.
sw_ke: lakini kuna {actual} pekee ilinganayo na tatizo.

source: Edit the library configuration.
sw_ke: Hariri mpangilio wa maktaba.

source: Invalid Library
sw_ke: Maktaba Batili

source: No Library Selected
sw_ke: Hakuna Maktaba 'Iliyochaguliwa'

source: Library Display Name
sw_ke: Jina la Umma la Maktaba

source: Enter the names of the advanced components to use in your library.
sw_ke: Ingiza jina la vipengele vilivyo boreshwa kutumika katika maktaba.

source: The display name for this component. Analytics reports may also use the display name to identify this component.
sw_ke: Jina litakaloonekana kwenye kipengele hiki. Taarifa za uchunguzi zinaweza kutumia jina litakaloonekana kutambua kipengele hiki.

source: LTI ID
sw_ke: Kitambulisho cha LTI

source: LTI URL
sw_ke: URL ya LTI

source: Custom Parameters
sw_ke: Dori ya Desturi

source: Open in New Page
sw_ke: Fungua Ukurasa Mpya

source: Scored
sw_ke: Kupata alama / Kushinda

source: Select True if this component will receive a numerical score from the external LTI system.
sw_ke: Chagua kweli kama kipengele hiki kitapokea alama ya nambari kutoka kwa mpangilio wa nje wa LTI.

source: Weight
sw_ke: Uzani / Uzito

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
sw_ke: Ingiza idadi ya alama ziwezekanazo kwa kipengele hiki. Tathmini ya kosa ni 1.0. Mkakati huu unatumika pekee ikiwa alama imewekwa kwa Kweli.

source: Comment as returned from grader, LTI2.0 spec
sw_ke: Changia maoni kama yalivyo rudishwa kutoka kwa, LTI2.0 spec

source: Hide External Tool
sw_ke: Ficha Kifaa cha Nje

source: Request user's username
sw_ke: Omba jinatumishi la mtumiaji

source: Select True to request the user's username.
sw_ke: Chagua kweli kuomba jinatumishi la mtumiaji.

source: Request user's email
sw_ke: Omba Anwani ya barua pepe ya mtumiaji

source: Select True to request the user's email address.
sw_ke: Chagua Kweli Kuomba anwani ya barua pepe ya mtumiaji.

source: LTI Application Information
sw_ke: Taarifa ya Uombaji wa LTI

source: Button Text
sw_ke: Ujumbe wa Kifungo

source: Enter the text on the button used to launch the third party application.
sw_ke: Ingiza ujumbe kwenye kifungo kitumikacho kuzindua utumizi wa mtu wa tatu.

source: Accept grades past deadline
sw_ke: Kubali daraja baada ya wakati wa mwisho

source: Select True to allow third party systems to post grades past the deadline.
sw_ke: Chagua Kweli kuruhusu mpango wa mtumiaji wa tatu kuweka makala ya daraja baada ya wakati wa mwisho.

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
sw_ke: Haikuweza kuchanganua dori ya desturi: {custom_parameter}. Inastahili iwe mstari wa "x=y".

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
sw_ke: Haikuweza kuchanganua pasipoti ya LTI: {lti_passport}. Ina stahili iwe mstari wa "id:key:secret".

source: Due Date
sw_ke: Tarehe inayoTarajiwa

source: Enter the default date by which problems are due.
sw_ke: Ingiza tarehe ya ukombo kwa matatizo yapi yaliyo kamilisha wakati wake.

source: If true, can be seen only by course staff, regardless of start date.
sw_ke: Kama ni kweli, inaweza kuonekana kwa wafanyi kazi wa kozi, licha ya tarehe ya kuanza.

source: GIT URL
sw_ke: URL ya GIT

source: Enter the URL for the course data GIT repository.
sw_ke: Ingiza URL kwa takwimu ya kozi ya umiliki upya wa GIT.

source: XQA Key
sw_ke: Funguo ya XQA

source: This setting is not currently supported.
sw_ke: Mkakati huu hauna usaidizi kwa sasa.

source: URL for Annotation Storage
sw_ke: Uhifadhi wa Fafanuzi za URL

source: Enter the ids for the content groups this problem belongs to.
sw_ke: Ingiza vitambulisho vya makundi ya yaliyomo kwa asili ya tatizo hili.

source: Specify when to show answer correctness and score to learners. Valid values are "always", "never", and "past_due".
sw_ke: Bainisha muda wa kuonesha usahihi wa swali na alama kwa wanafunzi. Thamani halali ni "always", "never", na "past_due".

source: Days Early for Beta Users
sw_ke: Siku za Mwanzo kwa Watumiaji wa Beta

source: Enter the number of days before the start date that beta users can access the course.
sw_ke: Ingiza idadi ya siku kabla tarehe ya kuanza ambazo Watumiaji wa Beta waweza kufikia kozi.

source: Static Asset Path
sw_ke: Njia Rasili mali iliyo Tulizana

source: Enter the path to use for files on the Files & Uploads page. This value overrides the Studio default, c4x://.
sw_ke: Ingiza njia ya kutumia kwa faili katika ukurasa wa Faili & Upakiaji. Tathmini hii inapita kosa la Studio, c4x://.

source: Enable LaTeX Compiler
sw_ke: Wezesha Mkusanyaji wa LaTeX

source: Enter true or false. If true, you can use the LaTeX templates for HTML components and advanced Problem components.
sw_ke: Ingiza kweli au uwongo. Kama kweli, unaweza kutumia LaTeX vigezo kwa vipengele vya HTML na vipengele vya matatizo yalioboreshwa.

source: Group Configurations
sw_ke: Mikakati ilio Boreshwa

source: Enter the configurations that govern how students are grouped together.
sw_ke: Ingiza mipangilio ambayo inasimamia vipi wanafunzi wanawekwa pamoja.

source: Enable video caching system
sw_ke: Wezesha ufichaji wa mpango wa video

source: Enter true or false. If true, video caching will be used for HTML5 videos.
sw_ke: Ingiza kweli au uwongo. Kama ni kweli, ufichaji wa video utatumika kwa video za HTML5.

source: Video Pre-Roll
sw_ke: Jukumu Kabla la Video

source: Show Reset Button for Problems
sw_ke: Onyesha Kifungo cha Uekaji upya wa Matatizo

source: Enable Student Notes
sw_ke: Wezesha Nukuu za Wanafunzi

source: Enter true or false. If true, students can use the Student Notes feature.
sw_ke: Ingiza kweli au uwongo. Kama ni kweli, wanafunzi waweza kutumia Sehemu za Nukuu za Mwanafunzi.

source: Indicates whether Student Notes are visible in the course. Students can also show or hide their notes in the courseware.
sw_ke: Inaonyesha kuwa wanafunzi wanaonekana katika kozi. Wanafunzi pia wanaonyeshwa au kuficha nukuu zao katika koziwea.

source: Tag this module as part of an Entrance Exam section
sw_ke: Tag kipimo hiki kama baadhi ya kifungu cha Kiingilio Mtihani

source: Enter true or false. If true, answer submissions for problem modules will be considered in the Entrance Exam scoring/gating algorithm.
sw_ke: Ingiza kweli au uwongo. Kama kweli, ufikishaji wa jibu kwa moduli ya tatizo itatiliwa maanani katika Kiingilio Mtihani kueke alama algorithm.

source: Enrollment Track Groups
sw_ke: Makundi ya Uandikishwaji

source: Partition for segmenting users by enrollment track
sw_ke: Ugawaji watumiaji kwenye makundi kwa kutumia njia ya uandikishaji

source: Whether this student has voted on the poll
sw_ke: Iwapo mwanafunzi huyu amepiga kura

source: Student answer
sw_ke: Jibu la mwanafunzi

source: Poll answers from all students
sw_ke: Majibu ya utafiti kutoka kwa wanafunzi wote

source: Poll answers from xml
sw_ke: Majibu ya utafiti kutoka kwa xml

source: Poll question
sw_ke: Swali la utafiti

source: Enter the date by which problems are due.
sw_ke: Ingiza tarehe ambayo matatizo yapi ya wadia wakati.

source: Hide sequence content After Due Date
sw_ke: Ficha mpangilio wa maudhui Baada ya Tarehe ya Mwisho

source: If set, the sequence content is hidden for non-staff users after the due date has passed.
sw_ke: Kama imewekwa, mpangilio wa maudhui unafichwa usionekane na watumiaji wasio wafanyakazi baada ya tarehe ya mwisho kupita.

source: Is Entrance Exam
sw_ke: Ni Kiingilio Mtihani

source: Tag this course module as an Entrance Exam. Note, you must enable Entrance Exams for this course setting to take effect.
sw_ke: Tag moduli ya kozi hii kama Kiingilio Mtihani. Tambua kwamba, lazima uwezeshe Kiingilio Mtihani kwa mkakati wa kozi hii kuwa na athari.

source: Is Time Limited
sw_ke: Ni Wakati Uliofupishwa

source: This setting indicates whether students have a limited time to view or interact with this courseware component.
sw_ke: Mikakati hii inaonyesha kama wanafunzi wana muda maalum kuona au kuingiliana na kipengele cha koziwea.

source: Time Limit in Minutes
sw_ke: Ufupisho wa Wakati kwa Madakika

source: The number of minutes available to students for viewing or interacting with this courseware component.
sw_ke: Idadi ya dakika zinazopatikana kwa wanafunzi kwa kutizama au kuingiliana na kipengele cha koziwea.

source: Is Proctoring Enabled
sw_ke: Ulezi Umewezeshwa

source: This setting indicates whether this exam is a proctored exam.
sw_ke: Mkakati huu unaonyesha ikiwa mtihani ni mtihani mlezi.

source: Software Secure Review Rules
sw_ke: Softiwea Inayolinda Mapitio mapya ya Kanuni

source: This setting indicates what rules the proctoring team should follow when viewing the videos.
sw_ke: Mkakati huu unaonyesha ni kanuni zipi kikosi cha ulezi kinastahili kufuata wakati wa kuangalia video.

source: Is Practice Exam
sw_ke: Ni Mtihani wa Majaribio

source: This setting indicates whether this exam is for testing purposes only. Practice exams are not verified.
sw_ke: Mkakati huu unaonyesha ikiwa mtihani ni kwa sababu ya majaribio pekee. Mitihani ya majaribio hathibitishwi.

source: This exam is hidden from the learner.
sw_ke: Mtihani huu umefichwa usionekane na mwanafunzi.

source: Because the course has ended, this assignment is hidden from the learner.
sw_ke: Kwasababu kozi imeisha, zoezi hili limefichwa lisionekane na mwanafunzi.

source: Because the due date has passed, this assignment is hidden from the learner.
sw_ke: Kwasababu tarehe ya mwisho imepita, zoezi hili limefichwa lisionekane na mwanafunzi.

source: This subsection is unlocked for learners when they meet the prerequisite requirements.
sw_ke: Kifungu kidogo hiki kimefunguliwa ili wanafunzi wakione wakati wanapokamilisha mahitaji muhimu.

source: Group ID {group_id}
sw_ke: KItambulisho cha Kundi {group_id}

source: Not Selected
sw_ke: Haija chaguliwa

source: The display name for this component. (Not shown to learners)
sw_ke: Jina linaloonekana kwa kipegele hiki. (Halioneshwi kwa wanafunzi)

source: Content Experiment
sw_ke: Jaribio la Yaliyomo

source: The list of group configurations for partitioning students in content experiments.
sw_ke: Orodha ya mipangilio ya kundi kwa kutenganisha wanafunzi kwenye majaribio ya yaliyomo.

source: The configuration defines how users are grouped for this content experiment. Caution: Changing the group configuration of a student-visible experiment will impact the experiment data.
sw_ke: Mpangilio unabaini vipi watumiaji wana kusanywa pamoja kwa jaribio hili. Tahadhari: Kubadilisha mpangilio wa jaribio la uonaji-wanafunzi litaathiri takwimu ya jaribio.

source: Group Configuration
sw_ke: Mpangilio wa Kundi

source: Which child module students in a particular group_id should see
sw_ke: Kipi kipimo cha mtoto mwanafunzi katika umaalumu wa kundi_id wanastahili kuona

source: The experiment is not associated with a group configuration.
sw_ke: Jaribio halihusiani na mpangilio wa kundi.

source: Select a Group Configuration
sw_ke: Chagua Mpangilio wa Kundi

source: The experiment uses a deleted group configuration. Select a valid group configuration or delete this experiment.
sw_ke: Jaribio linatumia mpangilio wa kundi lililofutwa. Chagua kundi la mpangilio halali au futa jaribio hili.

source: The experiment uses a group configuration that is not supported for experiments. Select a valid group configuration or delete this experiment.
sw_ke: Jaribio linatumia kundi la mpangilio ambalo haiungwi mkono kwa majaribio. Chagua kundi halali la mpangilio au futa jaribio hili.

source: The experiment does not contain all of the groups in the configuration.
sw_ke: Jaribio halina makundi yote katika mpangilio.

source: Add Missing Groups
sw_ke: Ongeza Makundi Yanayokosekana

source: The experiment has an inactive group. Move content into active groups, then delete the inactive group.
sw_ke: Jaribio lina kundi lisilo hai. Peleka yaliyomo kwa makundi hai, kisha futa kundi lililo lemaa.

source: This content experiment has issues that affect content visibility.
sw_ke: Jaribio la yaliyomo lina mambo ambayo yana athiri kuonekana kwa yaliyomo.

source: External Discussion
sw_ke: Majadiliano ya Nje

source: Home
sw_ke: Nyumbani

source: Text Annotation
sw_ke: Fafanuzi za Ujumbe

source: Source/Citation
sw_ke: Chanzo/Dondoo

source: Optional for citing source of any material used. Automatic citation can be done using <a href="http://easybib.com">EasyBib</a>
sw_ke: Hiari ya kudondoa chanzo cha kifaa chochote kilicho tumika. Dondoo yakiwenyewe inaweza kufanywa kwa kutumia <a href="http://easybib.com">EasyBib</a>

source: Diacritic Marks
sw_ke: Alama za Kutafautisha matamshi ya herufi

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
sw_ke: Haipokei nyaraka kutoka kwa YouTube kwa {youtube_id}.Hali ya kificho: {status_code}.

source: We support only SubRip (*.srt) transcripts format.
sw_ke: Tunaunga mkono SubRip pekee (*.srt) mfumo wa nyaraka.

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
sw_ke: Kuna kitu makosa na faili za nyaraka za SubRip wakati wa uchanganuzi. Ujumbe wa ndani ni {error_message}

source: Something wrong with SubRip transcripts file during parsing.
sw_ke: KUna kitu makosa na faili za nyaraka za SubRip katika uchanganuzi.

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
sw_ke: {exeption_message}: Haiwezi kupata nyaraka zilizopakiwa: {user_filename}

source: Invalid encoding type, transcripts should be UTF-8 encoded.
sw_ke: Uandishi batili wa kuweka kificho, nyaraka zinastahili kuwa na kificho cha UTF-8.

source: Basic
sw_ke: Msingi

source: There is no transcript file associated with the {lang} language.
sw_ke: Hakuna nakala ya faili linalohusiana na lugha ya {lang}.

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
sw_ke: URL ya video yako. Hii inaweza kuwa URL ya YouTube au uunganishi kwa .mp4, .ogg, au .faili ya video ya webm iliyo weka mahali pengine kwenye mtandao.

source: Default Video URL
sw_ke: URL kombo ya Video

source: Component Display Name
sw_ke: Jina la Umma la Kipengele

source: Current position in the video.
sw_ke: Mahali pa sasa katika video.

source: Optional, for older browsers: the YouTube ID for the normal speed video.
sw_ke: Kihiari, kwa wavinjari wa zamani: Kitambulisho cha YouTube kwa kasi ya video ya kawaida.

source: YouTube ID
sw_ke: Kitambulisho cha YouTube

source: Optional, for older browsers: the YouTube ID for the .75x speed video.
sw_ke: Kwa hiari, kwa wavinjari wa kitambo: KItambulisho cha YouTube kwa .75x kasi ya video.

source: YouTube ID for .75x speed
sw_ke: Kitambulisho cha YouTube kwa kasi ya .75x

source: Optional, for older browsers: the YouTube ID for the 1.25x speed video.
sw_ke: Kwa hiari, kwa wavinjari wa kitambo: Kitambulisho cha YouTube kwa kasi ya video 1.25x

source: YouTube ID for 1.25x speed
sw_ke: Kitambulisho cha YouTube kwa kasi ya 1.25x

source: Optional, for older browsers: the YouTube ID for the 1.5x speed video.
sw_ke: Kwa hiari, kwa wavinjari wa kitambo: Kitambulisho cha YouTube kwa kasi ya video 1.5x

source: YouTube ID for 1.5x speed
sw_ke: Kitambulisho cha YouTube kwa kasi ya 1.5x

source: Time you want the video to start if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
sw_ke: Wakati unao taka video kuonyesha ikiwa huhitaji kuchezesha video yote. Haiungwi mkono katika uwenyeji wa apaa ya rununu: faili nzima ya video itacheza. ikiwa na mfumo wa HH:MM:SS, Tathmini ya juu zaidi ni 23:59:59.

source: Video Start Time
sw_ke: Wakati wa Kuanza Video

source: Time you want the video to stop if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
sw_ke: Wakati unaotaka video kusangaa kama huhitaji kuchezesha video yote. Haiungwi mkono na uwenyeji wa app ya rununu: faili nzima ya video itacheza. ikiwa kwa mfumo wa HH:MM:SS. Tathmini ya juu zaidi ni 23:59:59.

source: Video Stop Time
sw_ke: Wakati wa Kusimamisha Video

source: The external URL to download the video.
sw_ke: URL ya nje kushukisha video.

source: Download Video
sw_ke: Shukisha Video

source: Allow students to download versions of this video in different formats if they cannot use the edX video player or do not have access to YouTube. You must add at least one non-YouTube URL in the Video File URLs field.
sw_ke: Ruhusu wanafunzi kushukisha tafsiri za video hii katika mifumo tafauti tafauti kama hawawezi kutumia video ya edX au hawana ufikiaji kwa YouTube. Lazima uongeze japo moja URL isio ya YouTube kwenye kiwanja cha URLs ya Faili ya Video.

source: Video Download Allowed
sw_ke: Ushukishaji wa Video Umeruhusiwa

source: Video File URLs
sw_ke: Faili za video za URLs

source: Downloadable Transcript URL
sw_ke: Nyaraka za URL Ziwezekanazo Kushukishwa

source: Download Transcript Allowed
sw_ke: Ushukishaji wa Nyaraka Umeruhusiwa

source: Default Timed Transcript
sw_ke: Nakala za hitlafu ya muda

source: Specify whether the transcripts appear with the video by default.
sw_ke: Taja kama nyaraka zinatokeza na hitlafu ya video.

source: Show Transcript
sw_ke: Onyesha Nyaraka

source: Add transcripts in different languages. Click below to specify a language and upload an .srt transcript file for that language.
sw_ke: Ongeza nyaraka kwa lugha tafauti tafauti. Bonyeza chini utaje lugha na upakie faili ya waraka .str kwa lugha hiyo.

source: Transcript Languages
sw_ke: Lugha za Nyaraka

source: Preferred language for transcript.
sw_ke: Lugha ipendekezwayo ya nyaraka.

source: Preferred language for transcript
sw_ke: Lugha ipendekezwayo ya nyaraka

source: Transcript file format to download by user.
sw_ke: Mfumo wa faili za nyaraka kushukisha kwa mtumiaji.

source: SubRip (.srt) file
sw_ke: SubRip faili (.srt)

source: Text (.txt) file
sw_ke: Faili ya ujumbe (.txt)

source: The last speed that the user specified for the video.
sw_ke: Kasi ya mwisho ambayo mtumiaji ametaja ya video.

source: The default speed for the video.
sw_ke: Kasi kombo ya video.

source: Specify whether YouTube is available for the user.
sw_ke: Taja kama YouTube inapatikana kwa mtumiaji.

source: Upload a handout to accompany this video. Students can download the handout by clicking Download Handout under the video.
sw_ke: Pakia nakala za kutowa kwa mkono zikifuatanishwa na video. Wanafunzi waweza kushukisha nakala ya kutolewa kwa mkono kwa kubonyeza ushukishaji wa nakala za kutolewa kwa mkono chini ya video.

source: Upload Handout
sw_ke: Pakia nakala za kutolewa kwa mkono

source: Specify whether access to this video is limited to browsers only, or if it can be accessed from other applications including mobile apps.
sw_ke: Taja kama ufikiaji kwa video hii imepewa vikwazo kwa wavinjari pekee, au kama inawezekana kufikia kutoka kwa utumiaji mwengine pamoja na mobile apps.

source: Video Available on Web Only
sw_ke: Video ipatikanayo kwa Mtandao Pekee

source: If you were assigned a Video ID by edX for the video to play in this component, enter the ID here. In this case, do not enter values in the Default Video URL, the Video File URLs, and the YouTube ID fields. If you were not assigned a Video ID, enter values in those other fields and ignore this field.
sw_ke: Kama umepewa Kitambulisho cha Video na edX kwa video utakayo chezakatika kipengele hiki, ingiza Kitambulisho hapa. Katika hali hii, usiingize tathmini katika kosa ya URL ya Video, faili za URLs za Video, na viwanja vya Vitambulisho vya YouTube.Kama hukupewa Kitambulisho cha Video, ingiza tathmini kwenye viwanja hivyo vingine na puuza kiwanja hiki.

source: Date of the last view of the bumper
sw_ke: Tarehe ya mwisho kuangalia bumper

source: Do not show bumper again
sw_ke: Usionyeshe tena bumper

source: Video Annotation
sw_ke: Fafanuzi za Video

source: The external source URL for the video.
sw_ke: Chanzo cha nje cha URL kwa video.

source: Source URL
sw_ke: URL Chanzo

source: Poster Image URL
sw_ke: Taswira ya Bandiko la URL

source: Poster URL
sw_ke: Bandiko la URL

source: Instructions
sw_ke: Maagizo

source: Add instructions to help learners understand how to use the word cloud. Clear instructions are important, especially for learners who have accessibility requirements.
sw_ke: Ongeza maelekezo yatakayowasaidia wanafunzi kuelewa jinsi ya kutumia neno cloud. Malekezo yaliyo wazi ni muhimu, hasa kwa wanafunzi wenye kuhitaji kukidhi masharti ya kupata mtandao.

source: Inputs
sw_ke: Maingizaji

source: The number of text boxes available for learners to add words and sentences.
sw_ke: Idadi ya visanduku vilivyo wazi vitakavyotumiwa na wanafunzi kujaza maneno na sentinsi.

source: Maximum Words
sw_ke: Kiwango cha Juu cha Maneno

source: The maximum number of words displayed in the generated word cloud.
sw_ke: Idadi ya juu ya maneno yanayooneshwa kwenye neno jipya la cloud.

source: Show Percents
sw_ke: 'Onyesha' Asilimia

source: Statistics are shown for entered words near that word.
sw_ke: Tarakimu zinaonyeshwa kwa kungiza maneno karibu na neno hilo.

source: Whether this learner has posted words to the cloud.
sw_ke: Iwapo mwanafunzi huyu amebandika maneno kwenye cloud.

source: Student answer.
sw_ke: Jibu la mwanafunzi.

source: All possible words from all learners.
sw_ke: Maneno yote yanayowezekana kutoka kwa wanafunzi wote.

source: Top num_top_words words for word cloud.
sw_ke: Maneno ya juu nambari_juu_maneno ya wingu la neno.

source: Completed the course "{course_name}" ({course_mode}, {start_date} - {end_date})
sw_ke: Umekamilisha kozi "{course_name}" ({course_mode}, {start_date} - {end_date})

source: Completed the course "{course_name}" ({course_mode})
sw_ke: Umekamilisha kozi "{course_name}" ({course_mode})

source: The badge image must be square.
sw_ke: Taswira ya beji lazima iwe skwea

source: The badge image file size must be less than 250KB.
sw_ke: Kiwango cha faili ya taswira ya beji lazima iwe chini ya KB250.

source: This value must be all lowercase.
sw_ke: Tathmini hii lazima iwe yote kwa herufi ndogo.
