Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Email actions run in the background. The status for any active tasks - including email tasks - appears in a table below.
sw_ke: Matendo ya Barua pepe yanaendelea katika usuli. Hali ya majukumu yoyote hai - ni pamoja na majukumu ya barua pepe - yanayotokeza kwenye meza hapo chini.

source: Email Task History
sw_ke: Kumbukumbu ya kazi za Barua pepe

source: To see the content of previously sent emails, click this button:
sw_ke: Kuona yaliyomo kwenye barua zilizotumwa, bofya kibonye hiki:

source: Show Sent Email History
sw_ke: Onesha Historia ya Barua Zilizotumwa

source: To read a sent email message, click its subject.
sw_ke: Kusoma barua pepe iliyotumwa, bofya kichwa chake cha habari.

source: To see the status for all email tasks submitted for this course, click this button:
sw_ke: Kuona hali ya shughuli za barua pepe zote zilizowasilishwa kwa kozi hii, bofya kibonye hiki:

source: Show Email Task History
sw_ke: Onyesha Kumbukumbu ya Kazi za Barua pepe

source: Set Course Mode Price
sw_ke: Weka Bei ya Mtindo wa Kozi

source: Please enter Course Mode detail below
sw_ke: Tafadhali ingiza utondoti wa Mtindo wa Kozi hapo chini

source: Set Price
sw_ke: Weka Bei

source: Allowance Section
sw_ke: Kifungu cha Kukubali

source: Student Special Exam Attempts
sw_ke: Majaribio Maalum ya Mtihani wa Wanafunzi

source: View gradebook for enrolled learners
sw_ke: Angalia kitabu cha alama kwa wanafunzi walioandikishwa

source: Note: This feature is available only to courses with a small number of enrolled learners.
sw_ke: Zingatia: Kipengele hiki kinapatikana pekee kwa kozi zenye idadi ndogo ya wanafunzi walioandikishwa.

source: View Gradebook
sw_ke: Tizama Kitabu cha Alama

source: View a specific learner's grades and progress
sw_ke: Angalia alama na maendeleo ya mwanafunzi maalum

source: Learner email address or username
sw_ke: Anwuni ya barua pepe au jina la mtumiaji la mwanafunzi

source: View Progress Page
sw_ke: Angalia Ukurasa wa Maendeleo

source: Adjust a learner's grade for a specific problem
sw_ke: Rekebisha alama ya mwanafunzi kwa tatizo maalum

source: Example
sw_ke: Mfano

source: Problem location
sw_ke: Eneo la Tatizo

source: Attempts
sw_ke: Majaribio

source: Allow a learner who has used up all attempts to work on the problem again.
sw_ke: Mruhusu mwanafunzi aliyekwisha maliza majaribio yake yote kutatua tatizo tena.

source: Reset Attempts to Zero
sw_ke: Tegeshaupya Majaribio kwenda Sifuri

source: Rescore
sw_ke: Pata upya alama

source: For the specified problem, rescore the learner's responses. The 'Rescore Only If Score Improves' option updates the learner's score only if it improves in the learner's favor.
sw_ke: Kwa tatizo maalum, andika tena alama za majibu ya wanafunzi. Sehemu ya 'Andika tena Kama Alama Imepanda' husasisha alama za mwanafunzi endapo tu alama za mwanfunzi hupanda.

source: Problem History
sw_ke: Historia ya Tatizo

source: For the specified problem, permanently and completely delete the learner's answers and scores from the database.
sw_ke: Kwa tatizo maalum, ondoa majibu na alama zote za mwanafunzi moja kwa moja kwenye hazinadata.

source: Task Status
sw_ke: Jukumu Lilivyo

source: Show the status for the rescoring tasks that you submitted for this learner and problem.
sw_ke: Onesha hali ya upangaji upya alama uliyowasilisha kwa mwanafunzi huyu na tatizo.

source: Show Task Status
sw_ke: Onesha Hali ya Jukumu

source: Adjust a learner's entrance exam results
sw_ke: Rekebisha matokeo ya mwanafunzi kwenye mtihani wa kuingilia shule

source: Allow the learner to take the exam again.
sw_ke: Ruhusu mwanafunzi arudie kufanya mtihani.

source: Allow Skip
sw_ke: Ruhusu Kuruka

source: Waive the requirement for the learner to take the exam.
sw_ke: Ondoa masharti ili mwanafunzi afanye mtihani.

source: Let Learner Skip Entrance Exam
sw_ke: Ruhusu Mwanafunzi Kuruka Mtihani wa Kuingilia shule

source: Rescore any responses that have been submitted. The 'Rescore All Problems Only If Score Improves' option updates the learner's scores only if it improves in the learner's favor.
sw_ke: Toa upya alama kwa kila majibu uliyokwisha wasilisha. Kipengele cha 'Toa upya Alama kwa Maswali yote Kama Alama Zinapanda' sasisha alama za mwanafunzi ikiwa tu alama zitapanda.

source: Rescore All Problems
sw_ke: Sahihisha upya Maswali Yote

source: Rescore All Problems Only If Score Improves
sw_ke: Toa upya Alama kwa Maswali yote Ikiwa tu Alama Zinapanda

source: Entrance Exam History
sw_ke: Historia ya Mtihani wa Kuingia

source: For the entire entrance exam, permanently and completely delete the learner's answers and scores from the database.
sw_ke: Kwa mtihani wote wa kuingia, futa moja kwa moja majibu na alama za mwanafunzi kwenye hazinadata.

source: Show the status for the rescoring tasks that you submitted for this learner and entrance exam.
sw_ke: Onesha hali ya shughuli ya uwekaji upya alama za mwanafunzi ulizowasilisha kwa mtihani wa kuingia.

source: Adjust all enrolled learners' grades for a specific problem
sw_ke: Rekebisha madaraja yote ya wanafunzi wa waliondikishwa kwa tatizo maalum

source: Allows all learners to work on the problem again.
sw_ke: Inaruhusu wanafunzi wote kufanyia kazi tena tatizo.

source: Rescore submitted responses. The 'Rescore Only If Scores Improve' option updates a learner's score only if it improves in the learner's favor.
sw_ke: Weka upya alama kwa majibu yaliyowasilishwa. Kipengele cha 'Weka upaya alama kama zimeongezeka' kinasasisha alama za mwanafunzi kama alama hizo zimeongezeka kwa upande wake.

source: Rescore All Learners' Submissions
sw_ke: Weka upaya alama zote za wanafunzi zilizowasilishwa

source: Rescore Only If Scores Improve
sw_ke: Weka upya Alama Endapo tu Alama Zimeongezeka

source: Show the status for the tasks that you submitted for this problem.
sw_ke: Onesha hali ya shughuli ulizowasilisha kwa tatizo hili.

source: My Courses
sw_ke: Kozi Zangu

source: Program Details
sw_ke: Utondoti wa Mpangilio

source: Programs
sw_ke: Programu

source: Change Preferred Language
sw_ke: Badili Lugha Iliopendekezwa

source: Please choose your preferred language
sw_ke: Tafadhali chagua lugha unayopendelea

source: Save Language Settings
sw_ke: Hifadhi Mitegesho ya Lugha

source: Don't see your preferred language? {link_start}Volunteer to become a translator!{link_end}
sw_ke: Huoni lugha uliyopendekeza? {link_start}Jitolee kuwa mkalimani/mfasiri!{link_end}

source: Sysadmin
sw_ke: Msimamizi wa mfumo

source: Shopping Cart
sw_ke: Gari la kufanyia Ununuzi

source: {platform_name} Home Page
sw_ke: Ukurasa wa mwanzo {platform_name}

source: How it Works
sw_ke: Inavyo fanya Kazi

source: Schools
sw_ke: Shule

source: Explore Courses
sw_ke: Tafuta Kozi

source: Global
sw_ke: Kiujumla

source: {begin_strong}Warning:{end_strong} Your browser is not fully supported. We strongly recommend using {chrome_link} or {ff_link}.
sw_ke: {begin_strong}Onyo:{end_strong} Uvinjari wako haujasaidiwa kikamilifu. Tunashauri utumie {chrome_link} au {ff_link}.

source: {p_tag}You currently do not have any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The course team needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
sw_ke: {p_tag}Huna wataalamu wenza wa kufanya kazi hii. Ili kufanya kazi ya kupanga madaraja kwa kutumia wataalamu wenza: {ul_tag} {li_tag}Unalazimika kuwasilisha jibu kwenye kazi ya utoaji daraja wa pamoja kwenye tatizo hili.{end_li_tag} {li_tag}Walimu wa kozi wanahitaji kutoa matokeo ya insha ambazo zinatumika kupanga na kutoa madaraja criteria.{end_li_tag} {li_tag}Lazima pawepo na mawasilisho amabayo yanasubiri kupewa madaraja.{end_li_tag} {end_ul_tag} {end_p_tag}

source: Peer Grading
sw_ke: Kupeana alama

source: Here is a list of problems that need to be peer graded for this course.
sw_ke: Hii ni orodha ya maswali yanayotakiwa kutolewa alama na wanafunzi wenzao kwa hii kozi.

source: Problem Name
sw_ke: Jina la Swali

source: Due date
sw_ke: Tarehe halisi

source: Graded
sw_ke: Zilizopewa alama

source: Available
sw_ke: Inapatikana

source: Required
sw_ke: Inahitajika

source: No due date
sw_ke: Hakuna tarehe maalum ya kumalizia

source: The due date has passed, and peer grading for this problem is closed at this time.
sw_ke: Tarehe iliokuwa mwisho imepita, na utoaji daraja kirika kwa tatizo hili umefungwa kwa wakati huu.

source: The due date has passed, and peer grading is closed at this time.
sw_ke: Tarehe sahihi imepita, na utoaji daraja umefungwa kwa sasa.

source: Learning to Grade
sw_ke: Jifunze kutoa Alama

source: Hide Question
sw_ke: Ficha Masuali

source: Student Response
sw_ke: Majibu ya Wanafunzi

source: Written Feedback
sw_ke: Mrejesho kwa Maandishi

source: Please include some written feedback as well.
sw_ke: Tafadhali ambatanisha na mrejesho kwa maandishi pia.

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
sw_ke: Uwasilishaji huu uko wazi, inachukiza au (ninadhani) ina kazi ya mtu mwingine.

source: How did I do?
sw_ke: Nilifanya vipi?

source: Ready to grade!
sw_ke: Tayari kutoa daraja!

source: You have finished learning to grade, which means that you are now ready to start grading.
sw_ke: Umemaliza kujifunza kutoa alama, ikimaanisha sasa unaweza kuanza kutoa alama.

source: Start Grading!
sw_ke: Anza Kutoa Daraja!

source: Learning to grade
sw_ke: Jifunze kutoa alama

source: You have not yet finished learning to grade this problem.
sw_ke: Bado haujamaliza kujifunza kutoa alama za hili swali.

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
sw_ke: Sasa utaonyeshwa alama mbalimbali za mwalimu, na utatakiwa uzipate mwenyewe.

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
sw_ke: Utakapoweza kupata alama za jaribio sawa na mwalimu, utakuwa tayari kutoa daraja kwa wenzako.

source: Start learning to grade
sw_ke: Anza kujifunza kutoa daraja

source: Are you sure that you want to flag this submission?
sw_ke: Unahakika unataka kuweka alama kwenye huu uwasilishaji?

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
sw_ke: Unakaribia kuweka alama uwasilishaji. Weka alama kwenye uwasilishaji ambao uko wazi, unaochukiza, au (kuzaniwa) unakazi ya mtu mwingine. Kama uwasilishaji haujaelekezwa kwenye maudhui au sio sahihi, utaupa alama ya sufuri na kutoa mrejesho badala ya kuweka alama.

source: Remove Flag
sw_ke: Ondoa Alama

source: Keep Flag
sw_ke: Weka Alama

source: Go Back
sw_ke: Rudi Nyuma

source: {start_strong}{application_name}{end_strong} would like to access your data with the following permissions:
sw_ke: {start_strong}{application_name}{end_strong} ingependa kupata taarifa zako kwa kuruhusu yafuatayo:

source: Read your user ID
sw_ke: Soma namba ya Kitambulisho chako cha utumiaji

source: Read your user profile
sw_ke: Soma wasifu wako wa mtumiaji

source: Read your email address
sw_ke: Soma anwani yako ya barua pepe

source: Read the list of courses in which you are a staff member.
sw_ke: Soma orodha yako ya kozi ambazo wewe ni mfanyakazi.

source: Read the list of courses in which you are an instructor.
sw_ke: Soma orodha ya kozi ambayo wewe ni mkufunzi.

source: To see if you are a global staff user
sw_ke: Kuona kama wewe ni mtumiaji wa kimataifa

source: Manage your data: {permission}
sw_ke: Mudu habari zako:{permission}

source: Account Activation Info
sw_ke: Taarifa za Kuamsha Akaunti

source: Activate your account!
sw_ke: Amsha akaunti yako!

source: Check your {email_start}{email}{email_end} inbox for an account activation link from {platform_name}. If you need help, contact {link_start}{platform_name} Support{link_end}.
sw_ke: Angalia {email_start}{email}{email_end} sehemu yako ya ujumbe wa barua pepe kupata kiunganishi cha kuzindua akaunti kutoka {platform_name}. Kama unahitaji msaada, wasiliana {link_start}{platform_name} Msaada{link_end}.

source: You're almost there!
sw_ke: Unakaribia kukamilisha!

source: There's just one more step: Before you enroll in a course, you need to activate your account. We've sent an email message to {email_start}{email}{email_end} with instructions for activating your account. If you don't receive this message, check your spam folder.
sw_ke: Umebakisha hatua moja zaidi: Unahitaji kuamsha akaunti yako kabla ya kujiandikisha kwenye kozi. Tumetuma ujumbe wa barua pepe kwenda {email_start}{email}{email_end} wenye maelekozo ya kuamsha akaunti. Kama hupati ujumbe huu,tafadhali angalia folda lako la barua taka.

source: Your Password Reset is Complete
sw_ke: Ubadilishaji wa Nywila yako Umekamilika

source: Password Reset Complete
sw_ke: Ubadilishaji wa Nywila Umekamilika

source: Your password has been reset. {start_link}Sign-in to your account.{end_link}
sw_ke: Nywila yako imebadilishwa. {start_link}Ingia mtandaoni kwa akaunti yako.{end_link}

source: Reset Your {platform_name} Password
sw_ke: Badili {platform_name} Nywila Yako

source: Error Resetting Password
sw_ke: Hitlafu Kuweka upya Nywila

source: You must enter and confirm your new password.
sw_ke: Lazima uingie na uthibitishe nywila yako mpya.

source: The text in both password fields must match.
sw_ke: Jumbe kwa viwanja vyote vya nywila lazima ziwiane.

source: Reset Your Password
sw_ke: Weka upya Nywila Yako

source: Enter and confirm your new password.
sw_ke: Ingiza na thibitisha nywila yako mpya.

source: New Password
sw_ke: Nywila Mpya

source: Confirm Password
sw_ke: Thibitisha Nywila

source: Invalid Password Reset Link
sw_ke: Kiunganishi cha kubadili Nywila sio sahihi

source: Password reset successful
sw_ke: Umefanikiwa kubadili Nywila

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
sw_ke: Tumekutumia barua pepe ya maagizo ya kuweka nywila yako kwenye anwani uliotupatia. Utaipokea punde.

source: Billing Details
sw_ke: Utondoti wa Gharama

source: You can proceed to payment at any point in time. Any additional information you provide will be included in your receipt.
sw_ke: Unaweza kuendelea na utaratibu wa malipo wakati wowote. Taarifa yeyote ya nyongeza utakayoitoa itajumuishwa kwenye risiti yako.

source: Purchasing Organizational Details
sw_ke: Taarifa ya jumla ya mjumuiko wa manunuzi yote

source: Purchasing organization
sw_ke: Mjumuiko wa manunuzi

source: Purchase order number (if any)
sw_ke: Nambari ya manunuzii (kama ipo)

source: email@example.com
sw_ke: barua pepe@mfano.com

source: Additional Receipt Recipient
sw_ke: Mpokezi Waziada wa Risiti

source: If no additional billing details are populated the payment confirmation will be sent to the user making the purchase.
sw_ke: Kama hakuna taarifa za nyongeza za ankara zimeongeza uhakiki wa malipo utatumwa kwa mtumiaji anaefanya manunuzi.

source: Payment processing occurs on a separate secure site.
sw_ke: Taratibu za malipo yanafanyika kwenye wavuti nyingine salama.

source: Your Shopping cart is currently empty.
sw_ke: Gari lako la kufanyia ununzi kwa sasa ni tupu.

source: View Courses
sw_ke: Angalia Kozi

source: Payment
sw_ke: Malipo

source: Download CSV Reports
sw_ke: 'Pakua' Taarifa za CSV

source: Download CSV Data
sw_ke: Pakua Data za 'CSV'

source: There was an error in your date input. It should be formatted as YYYY-MM-DD
sw_ke: Kuna hitilafu katika uwekaji wako wa tarehe. Inastahili kuwa katika mfumo wa 'MWAKA-MWEZI-SIKU'

source: These reports are delimited by start and end dates.
sw_ke: Hizi taarifa zimewekewa mipaka tarehe ya mwanzo na ya mwisho.

source: Start Date:
sw_ke: Tarehe ya Kuanza:

source: End Date:
sw_ke: Tarehe ya Kumalizia:

source: These reports are delimited alphabetically by university name. i.e., generating a report with 'Start Letter' A and 'End Letter' C will generate reports for all universities starting with A, B, and C.
sw_ke: Taarifa imepangwa kwa herufi kulingana na majina ya vyuo vikuu. Kwa ujumla taarifa 'Itaanza na Herufi' A na 'Herufi ya Mwisho' C itatoa taarifa za vyuo vikuu vyote vianavyoanza na A, B, na C.

source: Start Letter:
sw_ke: Anza Barua:

source: End Letter:
sw_ke: Maliza Barua:

source: Payment Error
sw_ke: Hitlafu ya Malipo

source: There was an error processing your order!
sw_ke: Kulikuwa na hitilafu wakati wa kukamilisha ulichoagiza!

source: Thank you for your purchase!
sw_ke: Asante kwa ununuzi 'wako'!

source: View Dashboard
sw_ke: Angalia Dashibodi yako

source: You have successfully been enrolled for {course_names}. The following receipt has been emailed to {receipient_emails}
sw_ke: Umefaulu kusajiliwa kwa ajili ya {course_names}. Risiti ifuatayo imetumwa kwa barua pepe kwenda kwa {receipient_emails}

source: You have successfully purchased <b>{number} course registration code</b> for {course_names}.
sw_ke: Umefaulu kununua <b>{number} kificho cha uandikishaji wa kozi</b> kwa {course_names}.

source: The following receipt has been emailed to {receipient_emails}
sw_ke: Risiti ifuatayo imetumwa kwenda {receipient_emails}

source: Please send each professional one of these unique registration codes to enroll into the course. The confirmation/receipt email you will receive has an example email template with directions for the individuals enrolling.
sw_ke: Tafadhali tuma kwa kila mmoja katika vificho hivi vya kujiandikisha kwa kusajili katika kozi. Uthibitisho/upokeaji wa barua pepe utakayopokea una mfano wa kigezo cha barua pepe na miongozo kwa wanaosajili.

source: Enrollment Link
sw_ke: Kiunganishi cha Usajili

source: Used
sw_ke: Kutumika

source: Invalid
sw_ke: Batili

source: Date of purchase
sw_ke: Tarehe ya ununuzi

source: Print Receipt
sw_ke: Chapisha Risiti

source: Billed To Details
sw_ke: Orodhesha gharama kwa Tondoti

source: N/A
sw_ke: Haiambatani

source: Purchase Order Number
sw_ke: Namba Ya 'Manunuzi'

source: Company Contact Name
sw_ke: 'Jina' la Mawasiliano ya Kampuni

source: Company Contact Email
sw_ke: 'Barua pepe' ya Kampuni

source: Recipient Name
sw_ke: Jina la Mpokeaji

source: Recipient Email
sw_ke: Anwani ya barua pepe ya Mpokeaji

source: Card Type
sw_ke: Aina ya Kadi

source: Credit Card Number
sw_ke: Nambari ya Kadi ya Malipo

source: Address 1
sw_ke: Anwani 1

source: Address 2
sw_ke: Anwani 2

source: State
sw_ke: Elezea

source: Registration for:
sw_ke: Usajili wa:

source: Price per student:
sw_ke: Bei kwa kila mwanafunzi:

source: Discount Applied:
sw_ke: Punguzo Limetolewa:

source: Students
sw_ke: Wanafunzi

source: Note: items with strikethough like <del>this</del> have been refunded.
sw_ke: Ilani: bidhaa zilizo na mkwaju kama<del>hii</del>malipo yamerudishwa.

source: Confirm Enrollment
sw_ke: Thibitisha Usajili

source: {site_name} - Confirm Enrollment
sw_ke: {site_name} - Thibitisha Usajili

source: {course_number} {course_title} Cover Image
sw_ke: {course_number} {course_title} Picha ya Juu

source: Confirm your enrollment for: {span_start}course dates{span_end}
sw_ke: Thibitisha usajili wako wa: {span_start}tarehe za kozi{span_end}

source: You've clicked a link for an enrollment code that has already been used. Check your {link_start}course dashboard{link_end} to see if you're enrolled in the course, or contact your company's administrator.
sw_ke: Umebonyeza kwa kiungo cha usajili ambacho tayari kimetumika. Angalia {link_start}kozi yako kwenye dashibodi{link_end} kuona kama umesajili katika kozi, au wasiliana na msimamizi wa kampuni yako.

source: You have successfully enrolled in {course_name}. This course has now been added to your dashboard.
sw_ke: Umefaulu kusajili katika {course_name}. Kozi hii sasa imeongezwa kwenye dashibodi yako.

source: You're already enrolled for this course. Visit your {link_start}dashboard{link_end} to see the course.
sw_ke: Tayari umesajiliwa kwenye kozi hii. Tembelea dashibodi{link_start}yako{link_end} kuona kozi yako.

source: The course you are enrolling for is full.
sw_ke: Kozi unaojisajili imejaa.

source: The course you are enrolling for is closed.
sw_ke: Kozi unayojisajili imefungwa.

source: There was an error processing your redeem code.
sw_ke: Kulikuwa na tatzo wakati wa kuomba namba.

source: You're about to activate an enrollment code for {course_name} by {site_name}. This code can only be used one time, so you should only activate this code if you're its intended recipient.
sw_ke: Uko karibu na kuamsha kificho cha usajili wa {course_name} kwa {site_name}. Kificho hiki kinaweza kutumika mara moja, kwa hivyo unastahili kuamsha kificho hiki ikiwa wewe ndiyo mpokeaji aliedhamiriwa.

source: Activate Course Enrollment
sw_ke: Amsha Usajili wa Kozi

source: {course_names} has been removed because the enrollment period has closed.
sw_ke: {course-name} imeondolewa kwa sababu muda wa kusajili umefungwa.

source: Cover Image
sw_ke: Jalada la Picha

source: Students:
sw_ke: Wanafunzi:

source: Input quantity and press enter.
sw_ke: Ingiza idadi na bonyeza ingiza.

source: Increase
sw_ke: Ongeza

source: Decrease
sw_ke: Punguza

source: Remove
sw_ke: Ondoa

source: Discount or activation code
sw_ke: 'Punguzo' au namba ya kuwezesha

source: discount or activation code
sw_ke: 'punguzo' au namba ya kuwezesha

source: Apply
sw_ke: Tumia

source: code has been applied
sw_ke: namba imetumika

source: TOTAL:
sw_ke: JUMLA:

source: After this purchase is complete, a receipt is generated with relative billing details and registration codes for students.
sw_ke: Baada ya manunuzi kukamilika, risiti inatolewa ikiwa na taarifa zote za garama na namba ya kujisajili kwa wanafunzi.

source: After this purchase is complete, {username} will be enrolled in this course.
sw_ke: Baada ya ununuzi huu kukamilika, {username} utasajiliwa katika kozi hii.

source: Empty Cart
sw_ke: 'Sehemu' ya kufanya Manunuzi haijajazwa

source: Shopping cart
sw_ke: Fanya 'Manunuzi'

source: {platform_name} - Shopping Cart
sw_ke: {platform_name} - Fanya 'Manunuzi'

source: Confirmation
sw_ke: Uthibitisho

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} or let us know about any pages that may have been moved at {email}.
sw_ke: Ukurasa uliokuwa unautafuta haukupatikana. Rudi kwenye {link_start} ukurasa wa mwanzo {link_end} au tujulishe kuhusu kurasa zozote ambazo zinaweza kuwa zimehamishiwa kwenye {email}.

source: This page left intentionally blank. Feel free to add your own content.
sw_ke: Ukurasa 'huu' haukujazwa kwa makusudi. Jisikie huru kuongeza maudhui yako.

source: Our system indicates that you are trying to access this {platform_name} course from a country or region currently subject to U.S. economic and trade sanctions.Unfortunately, because {platform_name} is required to comply with export controls,we cannot allow you to access this course at this time.
sw_ke: Mfumo wetu wa kompyuta unaonesha kuwa unajaribu kufungua kozi {platform_name} kutoka kwenye nchi iliyowekewa vikwazo vya uchumi na biashara na Marekani.Kwa bahati mbaya, kwasababu {platform_name} inalazimika kukubaliana na kanuni za biashara ya nje, hatuwezi kukuruhusu kufungua kozi hii kwasasa.

source: Jobs
sw_ke: Kazi

source: In the Press
sw_ke: Ndani ya Vyombo vya habari

source: Currently the {platform_name} servers are down
sw_ke: Kwa sasa seva za {platform_name} ziko chini
