Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Self-paced courses do not have release dates for course content or due dates for assignments. Learners can complete course material at any time before the course end date.
sw_ke: Kozi zilizo na nyendo zao wenyewe hazina tarehe ya kuachiliwa kwa yaliyomo ya kozi au tarehe za kumaliza za mazoezi. Wanagenzi waweza kukamilisha vifaa vya kozi wakati wowote kabla ya tarehe ya kumaliza.

source: Course Content License
sw_ke: 'Leseni' ya Maudhui ya Kozi

source: Select the default license for course content
sw_ke: Chagua leseni ilio na kombo kwa yaliyomo katika kozi

source: How are these settings used?
sw_ke: Mikakati hii ina tumika vipi?

source: Your course's schedule determines when students can enroll in and begin a course.
sw_ke: Ratiba ya kozi yako itategea wanafunzi wakiweza kujisajili na waanze kozi.

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
sw_ke: Taarifa nyengine katika ukurasa huu inatokea kwenye ukurasa unaohusu mambo ya kozi yako. Habari hii ni pamoja na mtazamo wote wa kozi, taswira ya kozi, uanzilishi wa video, na makisio ya wakati unaohitaji. Wanafunzi wanatumia kurasa zihusianazo kuchagua kozi mpya ya kuchukua/kusomea.

source: Your policy changes have been saved.
sw_ke: Mabadiliko yako ya kanuni yamedhibitiwa.

source: There was an error saving your information. Please see below.
sw_ke: Kulikuwa na hitlafu kudhibiti taarifa yako. Tafadhali ona/angalia hapo chini.

source: Manual Policy Definition
sw_ke: Muongozo unao Fafanua Kanuni

source: {strong_start}Warning{strong_end}: Do not modify these policies unless you are familiar with their purpose.
sw_ke: {strong_start}Onyo{strong_end}: Usibadilishe kanuni hizi isipokuwa utakapofahamu malengo yake.

source: Show Deprecated Settings
sw_ke: Onyesha Mikakati Lalamishi

source: What do advanced settings do?
sw_ke: Mikakati iliyoboreshwa hufanya nini?

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
sw_ke: Mikakati iliyoboreshwa inapeleka / inamiliki kazi maalum ya kozi. Katika ukurasa huu, unaweza kuhariri kanuni za mkono, ambazo ni funguo msingi kwa JSON na inathamini jozi ambazo zinamiliki mikakati ya kazi maalum ya kozi.

source: Any policies you modify here override all other information you've defined elsewhere in {studio_name}. Do not edit policies unless you are familiar with both their purpose and syntax.
sw_ke: Kanuni zozote unazo boresha hapa inafuta habari zote ulizo elezea kwengine katika{studio_name}. Usihariri kanuni labda unauzofu na zote mbili sababu na syntaksi.

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (") around the string. Do not use single quotation marks (').
sw_ke: {em_start}Zingatia:{em_end} Wakati unapoweka sentensi zinazoeleza taratibu za sera, hakikisha unatumia alama mbili za funga na fungua semi (") kwa kila sentensi. Usitumie alama moja kama (').

source: Grading Settings
sw_ke: Mikakati Iliyo na Daraja

source: Overall Grade Range
sw_ke: Masafa ya Daraja kwa Jumla

source: Your overall grading scale for student final grades
sw_ke: Mizani ya utoaji daraja ya jumla kwa daraja ya mwisho wa kozi ya mwanafunzi

source: Add grade
sw_ke: Weka daraja

source: Credit Eligibility
sw_ke: Ustahilifu wa Mkopo

source: Settings for course credit eligibility
sw_ke: Mikakati ustahilifu wa mikopo ya kozi

source: Minimum Credit-Eligible Grade:
sw_ke: Kiwango cha chini Daraja cha Ustahilifu wa Mkopo:

source: Must be greater than or equal to the course passing grade
sw_ke: Lazima iwe zaidi ya au sawiya na kiwango cha daraja ya kupita kozi

source: Grading Rules &amp; Policies
sw_ke: Sharia ya Utoaji Daraja &amp; Kanuni

source: Deadlines, requirements, and logistics around grading student work
sw_ke: Tarehe za mwisho, yanayohitajika/wa, na mpangilio wa ugavi na upelekaji wa daraja ya kazi ya mwanafunzi.

source: Grace Period on Deadline:
sw_ke: Wakati mzuri/muaffak wa Kumalizia:

source: Leeway on due dates
sw_ke: Leeway ya tarehe ya kumalizia

source: Assignment Types
sw_ke: Aina za Mazoezi

source: Categories and labels for any exercises that are gradable
sw_ke: Tabaka na vibandiko kwa mazoezi yoyote ambayo yanapewa daraja

source: New Assignment Type
sw_ke: Aina Mpya ya Utoaji wa Mazoezi

source: What can I do on this page?
sw_ke: Naweza kufanya nini katika ukurasa huu?

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
sw_ke: Unaweza kutumia kitelezo chini ya Masafa ya Jumla ya Daraja kutaja kama kozi yako ni ya faulu/anguka au kwa kupewa daraja kwa barua, na kufafanua vizingiti kwa kila daraja.

source: You can specify whether your course offers students a grace period for late assignments.
sw_ke: Unaweza kutaja kama kozi ya inatoa kwa wanafunzi muda waheri kwa mazoezi ya kuchelewa.

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
sw_ke: Unaweza pia kubuni aina za mazoezi, kama kazi ya kufanya nyumbani, maabara,chemsha bongo, na mitihani, na taja mwanafunzi astahili kupata daraja ngapi kwa kila aina ya mazoezi inayo faa.

source: Expand or Collapse
sw_ke: Panua au Katiza

source: Access Settings
sw_ke: Mitegesho ya Kuyafikia maudhui

source: Set Access
sw_ke: Tegesha Upatikaji maudhui

source: This block contains multiple components.
sw_ke: Pande hili lina vipengele mchanganyiko.

source: New Textbook
sw_ke: Vitabu vipya vya Kiada

source: Why should I break my textbook into chapters?
sw_ke: Kwanini nikigawanye kitabu changu cha kiada kwa sura?

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
sw_ke: Kuvunja kitabu chako cha kiada kuwa sura mchanganyiko kuna punguza wakati wa kupakia kwa mwanafunzi, hasa wale walio na uunganishi wa mtandao ulitaratibu sana. Uvunjaji wa vitabu vya kiada kuwa sura inaweza pia kusaidia wanafunzi kwa urahisi zaidi kutafuta habari zilizo kwa misingi ya mada.

source: What if my book isn't divided into chapters?
sw_ke: Je kama kitabu changu cha kiada hakigawanyiki kwa sura?

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
sw_ke: Kama kitabu chako cha kiada hakina sura binafsi, unaweza kupakia kitabu chote kama sura moja na ingiza jina uhitajialo kwenye kiwanja cha Jina la Sura.

source: Learn more about textbooks
sw_ke: Jifunze mengi kuhusu vitabu vya kiada

source: Video Uploads
sw_ke: Mapakizi ya Video

source: Access is not restricted
sw_ke: Upataji maudhui haukuzuiwa

source: Access to this component is not restricted, but visibility might be affected by inherited settings.
sw_ke: Ufikiaji kipengele hiki haukuzuiwa , lakini uonekanji unaweza kuathiriwa na mitegesho ya zamani.

source: You can restrict access to this component to learners in specific enrollment tracks or content groups.
sw_ke: Unaweza kuzuia upatikanaji wa kipengele hiki kwa wanafunzi katika makundi rika maalum ya usajilia au makundi ya maudhui.

source: You can restrict access to this component to learners in specific content groups.
sw_ke: Unaweza kuzuia upatikanaji wa wa kipengele hiki kwa wanafunzi kwenye makundi maalum ya mudhui.

source: Manage content groups
sw_ke: Mudu Makundi ya yaliyomo

source: {screen_reader_start}Warning:{screen_reader_end} The unit that contains this component is hidden from learners. The unit setting overrides the component access settings defined here.
sw_ke: {screen_reader_start}Onyo:{screen_reader_end} Sura yenye kipengle hiki imefichwa isionekane na wanafunzi. Mitegesho ya sura hii inafuta kipengele cha mitegesho iliyotolewa hapa.

source: Access is restricted to:
sw_ke: Ufikiaji maudhui umezuiwa kwa:

source: Restrict access to:
sw_ke: Zuia ufikiaji maudhui kwa:

source: Select a group type
sw_ke: 'Chagua' aina ya kundi

source: All Learners and Staff
sw_ke: Wanafunzi Wote na Walimu

source: Select one or more groups:
sw_ke: Chagua kundi moja au zaidi:

source: Thank you for signing up for {studio_name}! To activate your account, please copy and paste this address into your web browser's address bar:
sw_ke: Asante kwa kujiunga na {studio_name}! Kuamsha akaunti yako, tafadhali iga na ubandike anwani hii kwenye ukanda wa anwani katika tovuti ya uvinjari wako:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {studio_name} web site.
sw_ke: Kama hukuomba hii, huhitaji kufanya lolote; hutapokea barua pepe zozote tena kutoka kwetu. Tafadhali usijibishe barua pepe hii; kama unahitaji usadizi, tizama kifungu cha usaidizi cha {studio_name} katika mtandao.

source: Your account for {studio_name}
sw_ke: Akaunti yako kwa {studio_name}

source: {email} has requested {studio_name} course creator privileges on edge
sw_ke: {email} imeoba {studio_name} m'buni wa kozi mpaka wa faida

source: User '{user}' with e-mail {email} has requested {studio_name} course creator privileges on edge.
sw_ke: Mtumiaji '{user}' kwa anwani ya barua pepe hii {email} ameomba {studio_name} faida za m'buni wa kozi kwenye ukingo.

source: To grant or deny this request, use the course creator admin table.
sw_ke: Kuidhinisha au kunyima ombi hili, tumia ratiba ya utawala wa m'buni wa kozi.

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
sw_ke: Omba lako la haki za ubuni wa kozi kwa {studio_name} limekataliwa. Kama unaamini hii ilikuwa hitlafu, tafadhali wasiliana na {email}

source: Your request for course creation rights to {studio_name} have been granted. To create your first course, visit {url}
sw_ke: Ombi lako la haki za ubuni wa kozi kwa {studio_name} limekubaliwa. Kubuni kozi yako ya kwanza, tembelea {url}

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
sw_ke: Haki zako za kubuni kozi kwa {studio_name} zimefutiliwa mbali. Kama unaamini hii ni hitlafu, tafadhali wasiliana na {email}

source: Your course creator status for {studio_name}
sw_ke: Hali ya m'buni wa kozi yako kwa {studio_name}

source: Your {task_name} task has completed with the status '{task_status}'. Use this URL to view task details or download any files created: {detail_url}
sw_ke: Kazi yako ya {task_name} imekamilika na hali halisi yake '{task_status}'. Tumia URL hii kuangalia maelezo ya kazi iliyofanika au pakua mafaili yaliyotengenezwa: {detail_url}

source: Your {task_name} task has completed with the status '{task_status}'. Sign in to view the details of your task or download any files created.
sw_ke: Kazi yako ya {task_name} imekamilika na hali halisi yake '{task_status}'. Ingia mtandaoni kuangalia maelezo ya kazi yako iliyofanyika au pakua mafaili yoyote yaliyotengenezwa.

source: {platform_name} {studio_name}: Task Status Update
sw_ke: {platform_name} {studio_name}: Uboreshaji wa Hali ya Kazi

source: Required data to force publish course.
sw_ke: Taarifa zinazohitajika kulazimisha ushapishaji kozi.

source: course-v1:edX+DemoX+Demo_Course
sw_ke: kozi-v1:edX+DemoX+Demo_Kozi

source: Reset values
sw_ke: Weka upya namba

source: Maintenance Dashboard
sw_ke: Dashibodi ya Ukarabati

source: Thanks for activating your account.
sw_ke: Asante kwa kuamsha akaunti yako.

source: This account has already been activated.
sw_ke: Akaunti hii tayari imeamshwa.

source: Visit your {link_start}dashboard{link_end} to see your courses.
sw_ke: Tembelea {link_start}dashbodi yako{link_end} uone kozi zako.

source: You can now {link_start}sign in{link_end}.
sw_ke: Sasa unaweza {link_start} kuingia {link_end}.

source: Activation Invalid
sw_ke: Uamshaji Umebatilishwa

source: Something went wrong. Email programs sometimes split URLs into two lines, so make sure the URL you're using is formatted correctly. If you still have issues, send us an email message at {email_start}{email}{email_end}.
sw_ke: Kuna tatizo. Programu ya Barua pepe wakati mwingine huigawa URLs kwenye mistari miwili, hakikisha URL unayotumia ina fomati iliyo sahihi. Kama bado kuna matatizo, tutumie ujumbe wa barua pepe kwenye {email_start}{email}{email_end}.

source: Return to the {link_start}home page{link_end}.
sw_ke: Rudi kwenye {link_start}ukurusa wa nyumbani{link_end}.

source: We've sent an email message to {email} with instructions for activating your account.
sw_ke: Tumetuma ujumbe wa barua pepe kwenye {email} wenye maelezo ya kuamsha akaunti yako.

source: EdX, Open edX, Studio, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
sw_ke: Nembo za EdX, Open edX, Studio, na edX na Open edX ni alama za biashara zilizo andikishwa au alama za biashara za {link_start}edX Inc.{link_end}

source: Current Course:
sw_ke: Kozi ya Sasa:

source: Course Navigation
sw_ke: Umarisi wa Kozi

source: Outline
sw_ke: Muongozo

source: Import
sw_ke: Upokeaji kutoka nje

source: Export
sw_ke: Upelekaji nje

source: Current Library:
sw_ke: Maktaba ya Sasa:

source: Language preference
sw_ke: Uchaguzi wa lugha

source: Account Navigation
sw_ke: Umarisi wa Akaunti

source: Contextual Online Help
sw_ke: Msaada ya Mtindo wamtandaoni

source: Launch Latex Source Compiler
sw_ke: Zindua Ukusanyaji Asili wa Latex

source: Heading
sw_ke: Kichwa

source: Insert a heading
sw_ke: Ingiza kichwa cha taarifa

source: Add a multiple choice question
sw_ke: Ongeza suali lenye chaguo mchanganyiko/nyingi

source: Add a question with checkboxes
sw_ke: Ongeza suali lenye visanduku vya uangaliaji

source: Insert a text response
sw_ke: Ingiza nakala ya jibu

source: Insert a numerical response
sw_ke: Ingiza jibu kwa nambari

source: Insert a dropdown response
sw_ke: Ingiza jibu kwa kuangushia chini

source: Explanation
sw_ke: Maelezo

source: Add an explanation for this question
sw_ke: Ongeza maelezo kwa suali hili

source: Advanced Editor
sw_ke: Mhariri alie Boreshwa

source: Toggle Cheatsheet
sw_ke: Kibanio cha Karatasi ya ulaghai

source: Label
sw_ke: Kibandiko/Kitambulisho

source: Access the Open edX Portal
sw_ke: Fikia Lango la edX Wazi

source: Open edX Portal
sw_ke: Lango la edX Wazi

source: name
sw_ke: jina

source: Currently signed in as:
sw_ke: Umejiunga kwa sasa hivi kama:

source: Maintenance
sw_ke: Ufundi

source: Only localhost... muahahaha
sw_ke: Mwenyeji pekee... muahahaha

source: Initial title of the article. May be overridden with revision titles.
sw_ke: Kichwa cha mwanzo cha makala. Kinaweza kufutwa na vichwa vya makala ya marudio.

source: Type in some contents
sw_ke: Andika maudhui kiasi

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
sw_ke: Hii ni orodha ya mwanzoni ya yaliyomo kwenye makala yako. Baada ya kuitengeneza,unaweza kutumia maneno yenye mchanganyiko wa maana kama kuongezea plugin, meta data na nyinginezo zinazohusiana na makala....

source: Contents
sw_ke: Yaliomo

source: Summary
sw_ke: Muhtasari

source: Give a short reason for your edit, which will be stated in the revision log.
sw_ke: Toa sababu fupi ya uhariri wako,ambayo itaelezewa katika orodha ya marudio.

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
sw_ke: Ulipokuwa unahariri,mtu mwengine alibadilisha marudio. Orodha yako ya yaliyomo imeambatanishwa na orodha mpya. Tafadhali pitia upya ujumbe uliopo chini.

source: No changes made. Nothing to save.
sw_ke: Hakuna mabadiliko yoyote yaliofanywa. Hakuna cha kuhifadhi.

source: Slug
sw_ke: Anwani maalum ya taarifa

source: This will be the address where your article can be found. Use only alphanumeric characters and - or _. Note that you cannot change the slug after creating the article.
sw_ke: Hii itakuwa anwani ambapo utaweza kupata makala yako. Tumia mchanganyiko wa herufi na nambari na - au _. Hivyo basi hutaweza kubadilisha anwani maalum baada ya kutengeneza makala.

source: Write a brief message for the article's history log.
sw_ke: Andika ujumbe mfupi wa historia ya makala yako.

source: A slug may not begin with an underscore.
sw_ke: Anwani maalum inaweza isianze na mstari chini.

source: A deleted article with slug "%s" already exists.
sw_ke: Makala iliyofutwa yenye anwani maalum \"%s\" tayari inatumika.

source: A slug named "%s" already exists.
sw_ke: Anwani maalum iitwayo \"%s\" tayari inatumika.

source: Yes, I am sure
sw_ke: Ndio, Nina hakika

source: Purge
sw_ke: Futa moja kwa moja

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
sw_ke: Futa makala moja kwa moja: Iondoe kabisa (pamoja na kilichomo ndani) bila ya kurudia. Kufuta moja kwa moja ni jambo zuri kama unataka kuondoa kila kitu kwenye tovuti ili watumiaji wengine waweze kuweka makala mpya.

source: You are not sure enough!
sw_ke: Huna hakika!

source: While you tried to delete this article, it was modified. TAKE CARE!
sw_ke: Wakati ulipokuwa unajaribu kufuta makala hii, ilikuwa imeboreshwa. CHUKUA TAHADHARI!

source: Lock article
sw_ke: Funga makala

source: Deny all users access to edit this article.
sw_ke: Nyima watumiaji wote fursa ya kuhariri makala hii.

source: Permissions
sw_ke: Ruhusa/Idhini

source: Owner
sw_ke: Mmiliki

source: Enter the username of the owner.
sw_ke: Ingiza jina analotumia mmiliki.

source: Inherit permissions
sw_ke: Rithi ruhusa

source: Check here to apply the above permissions recursively to articles under this one.
sw_ke: Tizama hapa uombe ruhusa za kupata makala zinaohusianazo na hii.

source: Permission settings for the article were updated.
sw_ke: Mipangilio ya ruhusa ya kupata makala hii imesasishwa.

source: Your permission settings were unchanged, so nothing saved.
sw_ke: Mipangilio yako ya ruhusa haikubadilishwa, kwahiyo hakuna kilichohifadhiwa.

source: No user with that username
sw_ke: Hakuna mtumiaji mwenye jina hilo

source: Article locked for editing
sw_ke: Makala imefungwa ili ihaririwe

source: Article unlocked for editing
sw_ke: Makala imefunguliwa ili ihaririwe

source: Filter
sw_ke: Chuja

source: Settings for plugin
sw_ke: Mitegesho ya ongezeo

source: current revision
sw_ke: marudio yaliyopo sasa

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
sw_ke: Marudio yanayoneshwa kwa ajili ya makala haya. Kama unahitaji kuipata tena, " "badilisha thamani ya sehemu hii.

source: modified
sw_ke: umerekebishwa

source: Article properties last modified
sw_ke: Muda wa mwisho kubadilisha makala

source: owner
sw_ke: mmiliki

source: The owner of the article, usually the creator. The owner always has both read and write access.
sw_ke: Mmiliki wa makala, kawaida mtengenezaji. Mmiliki ana fursa zote za kusoma na kuandika muda wote.

source: group
sw_ke: kundi

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
sw_ke: Kama kwenye mpangilio wa faili wa UNIX, ruhusa zinaweza kutolewa kwa mtumiaji kulingana na uanachama wa kundi. Makundi yana shughulikiwa kupitia mfumo wa Django auth.

source: group read access
sw_ke: fursa ya kundi kusoma

source: group write access
sw_ke: fursa ya kundi kuandika

source: others read access
sw_ke: fursa ya wengine kusoma

source: others write access
sw_ke: fursa ya wengine kuandika

source: Article without content (%(id)d)
sw_ke: Makala isiyo na maudhui (%(id)d)

source: content type
sw_ke: aina ya maudhui

source: object ID
sw_ke: Kitambulisho cha kitu

source: Article for object
sw_ke: Nakala ya kitu

source: Articles for object
sw_ke: Nakala za kitu

source: revision number
sw_ke: nambari ya marudio

source: IP address
sw_ke: Anwani ya IP

source: user
sw_ke: mtumiaji

source: locked
sw_ke: imefungwa

source: article
sw_ke: makala

source: article contents
sw_ke: yaliomo kwenye makala

source: article title
sw_ke: kichwa cha makala

source: Each revision contains a title field that must be filled out, even if the title has not changed
sw_ke: Kila marudio yana nafasi ya kichwa cha makala ambacho lazima ijazwe, hata kama kichwa cha makala hakijabadilika

source: original article
sw_ke: makala asili

source: Permissions are inherited from this article
sw_ke: Idhini zinarithiwa kutoka kwenye makala hii

source: A plugin was changed
sw_ke: Kipengele kimebadilishwa

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
sw_ke: Marudio yanaoneshwa kwenye kipengele hiki. Kama unataka kurudi sehemu ya mwanzo, badilisha thamani iliyo kwenye nafasi hii.

source: Cache lookup value for articles
sw_ke: Thamani ya kumbukumbu ya muda mfupi kwa ajili ya makala

source: slug
sw_ke: anwani maalum ya taarifa

source: URL path
sw_ke: njia ya URL

source: URL paths
sw_ke: njia za URL

source: Sorry but you cannot have a root article with a slug.
sw_ke: Samahani huwezi kupata makala asili iliyo na anwani yake maalum.

source: A non-root note must always have a slug.
sw_ke: Taarifa ya mtumiaji wa kawaida lazima iwe na anwani maalum ya kipengele.

source: There is already a root node on %s
sw_ke: Tayari kuna maelezo ya asili ya kifaa %s

source: Articles who lost their parents =============================== The children of this article have had their parents deleted. You should probably find a new home for them.
sw_ke: Makala ndogo zilizopotea kwenye makala kuu ================================= Makala kuu zinazobeba makala ndogo hizi yamefutwa. Yakupasa uyatafutie makazi mapya.

source: Lost and found
sw_ke: Kilipotea na kupatikana

source: A short summary of what the file contains
sw_ke: Muhtasari mfupi wa yaliomo kwenye faili

source: Yes I am sure...
sw_ke: Ndiyo nina uhakika...

source: Click to download file
sw_ke: Bofya upakue faili

source: The revision of this attachment currently in use (on all articles using the attachment)
sw_ke: Marudio ya kiambatisho hiki yanatumika kwa sasa (kwenye makala yote yanayotumia kiambatisho)

source: original filename
sw_ke: jina asili la faili

source: attachment
sw_ke: kiambatisho

source: attachments
sw_ke: viambatisho

source: file
sw_ke: faili

source: attachment revision
sw_ke: masahihisho ya viambatisho

source: attachment revisions
sw_ke: masahihisho ya viambatisho

source: %s was successfully added.
sw_ke: %s limefanikiwa kuongezwa.

source: Your file could not be saved: %s
sw_ke: Faili lako halikuweza kuhifadhiwa: %s

source: Your file could not be saved, probably because of a permission error on the web server.
sw_ke: Faili lako halikuweza kuhifadhiwa, labda kwa sababu ya hitlafu ya idhini kwenye seva.

source: %s uploaded and replaces old attachment.
sw_ke: %s imepakiwa na inabadilisha kiambatisho cha zamani.
