Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: No endpoint was provided for EdxNotes.
sw_ke: Hakuna alama ya mwisho iliyo tolewa kwa EdxNotes.

source: Notes
sw_ke: Arafa

source: API key for accessing Sailthru.
sw_ke: Neno siri la API la kukufikisha kwenye Sailthru.

source: API secret for accessing Sailthru.
sw_ke: Siri ya API ya kukufikisha kwenye Sailthru.

source: Sailthru list name to add new users to.
sw_ke: Orodha ya majina ya Sailthru ya kuongeza watumiaji.

source: Sailthru connection retry interval (secs).
sw_ke: Muda baina ya kuunganisha upya Sailthru (sek).

source: Sailthru maximum retries.
sw_ke: Idadi ya juu ya kuingiza upya Sailthru.

source: Sailthru template to use on abandoned cart reminder. Deprecated.
sw_ke: Ukurasa wa Sailthru ulioacha kutumika kuonesha kumbukumbu. Hautumiki tena.

source: Sailthru minutes to wait before sending abandoned cart message. Deprecated.
sw_ke: Dakika za kusubiri kwenye Sailthru kabla ya kutuma ujumbe uliosahaulika. Hazitumiki tena.

source: Sailthru send template to use on enrolling for audit.
sw_ke: Sailthru inatuma ukurasa wa kutumiwa kufanya ukaguzi wa uandikishaji.

source: Sailthru send template to use on upgrading a course. Deprecated
sw_ke: Sailthru inatuma ukurasa unaotumika kuboresha kozi. Hautumiki tena

source: Sailthru send template to use on purchasing a course seat. Deprecated
sw_ke: Sailthru inatuma ukurasa utakaotumika kulipia mahitaji ya kozi. Hautumika tena

source: Use the Sailthru content API to fetch course tags.
sw_ke: Tumia API maudhui ya Sailthru kufichua majina ya kozi.

source: Number of seconds to cache course content retrieved from Sailthru.
sw_ke: Idadi ya sekunde zinazotumika kuficha maudhui ya kozi yaliyofichuliwa kutoka kwenye Sailthru.

source: Cost in cents to report to Sailthru for enrolls.
sw_ke: Gharama za utoaji ripoti ya walioandikwisha kwenye Sailthru.

source: Optional lms url scheme + host used to construct urls for content library, e.g. https://courses.edx.org.
sw_ke: Mpangilio hiari wa lms url + mmiliki wa akaunti aliyetengeneza anwani za kuifikia maktaba yenye maudhui, mfano. https://courses.edx.org.

source: {platform_name} Staff
sw_ke: Mfanyi kazi {platform_name}

source: Course Staff
sw_ke: Walimu wa Kozi

source: Staff
sw_ke: Mfanyi kazi/Muajiriwa

source: Used Registration Code
sw_ke: Kificho cha Kujiandikisha kilichoTumika

source: Credit Card - Individual
sw_ke: Kadi ya Kukopea - ya Binafsi

source: manually enrolled by username: {username}
sw_ke: kusajiliwa kwa mkono na mtumiaji: {username}

source: Manually Enrolled
sw_ke: Kusajiliwa kwa Mkono

source: Data Integrity Error
sw_ke: Hitlafu ya Takwimu ya Kuaminika

source: Proctored Exam Review: {review_status}
sw_ke: Kupitia upya Mitihani Inayosimamiwa: {review_status}

source: A proctored exam attempt for {exam_name} in {course_name} by username: {student_username} was reviewed as {review_status} by the proctored exam review provider.
sw_ke: Kuandaa mtihani wa kusimamiwa wa {exam_name} kwenye {course_name} kwa jina la mtumiaji: {student_username} alikaguliwa kuwa {review_status} na afisa msimamizi wa mitihani.

source: User does not exist.
sw_ke: Mtumiaji hayupo.

source: Make sure that the file you upload is in CSV format with no extraneous characters or rows.
sw_ke: Hakikisha kuwa failil ulipakia ni ya mfumo wa CSV bila ya herufi au sehemu zozote za ziada.

source: Could not read uploaded file.
sw_ke: Haikuweza kusoma faili iliopakiwa.

source: Invalid email {email_address}.
sw_ke: Anwani ya barua pepe batili {email_address}.

source: An account with email {email} exists but the provided username {username} is different. Enrolling anyway with {email}.
sw_ke: Akaunti na barua pepe {email} zipo lakini jinatumishi lililotolewa {username} ni tafauti. Kusajili kwa vyovyote na {email}.

source: File is not attached.
sw_ke: Faili haijashikanishwa

source: Username {user} already exists.
sw_ke: Jinatumishi {user} tayari yupo.

source: Could not find problem with this location.
sw_ke: Haikuweza kupata tatizo kwa eneo hili.

source: Invoice number '{num}' does not exist.
sw_ke: Nambari ya ankara '{num}' haipo.

source: The sale associated with this invoice has already been invalidated.
sw_ke: Mauzo yanayohusiana na ankara hii imebatilishwa tayari.

source: Invoice number {0} has been invalidated.
sw_ke: Nambari ya ankara {0} imebatilishwa.

source: This invoice is already active.
sw_ke: Ankara hii tayari inatumika.

source: The registration codes for invoice {0} have been re-activated.
sw_ke: Vificho vya uandikishaji wa ankara {0} vime amshwa upya.

source: CourseID
sw_ke: Kitambulisho cha Kozi

source: Certificate Type
sw_ke: Aina ya Cheti

source: Total Certificates Issued
sw_ke: Jumla ya Vyeti Vilivyotolewa

source: Date Report Run
sw_ke: Tarehe ya Kuendesha Takwimu

source: User ID
sw_ke: KItambulisho cha Mtumiaji

source: Email
sw_ke: Barua pepe

source: Language
sw_ke: Lugha

source: Location
sw_ke: Eneo

source: Birth Year
sw_ke: Mwaka wa Kuzaliwa

source: Gender
sw_ke: Jinsia

source: Level of Education
sw_ke: Kiwango cha Elimu

source: Mailing Address
sw_ke: Anwani ya Kutuma Barua

source: Goals
sw_ke: Malengo

source: Enrollment Mode
sw_ke: Mtindo wa Usajili

source: Verification Status
sw_ke: Hali ya Uhakiki

source: Cohort
sw_ke: Ufungamano wa kundi

source: Team
sw_ke: Kikosi

source: City
sw_ke: Mji Mkuu

source: Country
sw_ke: Nchi / Taifa

source: The file must contain a 'cohort' column containing cohort names.
sw_ke: Lazima faili iwe na nguzo ya 'ufungamano' iliyo na majin ya walio katika mafungamano.

source: The file must contain a 'username' column, an 'email' column, or both.
sw_ke: Faili lazima ziwe na nguzo mya 'jinatumishi', nguzo ya 'barua pepe' au zote mbili.

source: Coupon Code
sw_ke: Kificho cha Kuponi

source: Course Id
sw_ke: Kitambulisho cha Kozi

source: % Discount
sw_ke: % Asilimia ya Upunguzaji kwa maridhiano

source: Description
sw_ke: Fafanuzi

source: Expiration Date
sw_ke: Tarehe ya Kumalizika/Kutofaa

source: Is Active
sw_ke: Ina Tumika / Iko Hai

source: Code Redeemed Count
sw_ke: Idadi ya Vificho vilivyokombolewa

source: Total Discounted Seats
sw_ke: Jumla ya Vikao Vilivyo Punguziwa bei kwa maridhiano

source: Total Discounted Amount
sw_ke: Jumla ya Kima Kilichopunguzwa kwa maridhiano

source: Could not parse amount as a decimal
sw_ke: Haikuweza kuchanganua kima kama sehemu ya kumi

source: Unable to generate redeem codes because of course misconfiguration.
sw_ke: Haiwezi kuzalisha vificho vya kukomboa kwa sababu ya mpangilio kombo wa kozi.

source: pdf download unavailable right now, please contact support.
sw_ke: ushukishaji wa pdf haupatikani kwa sasa, tafadhali wasiliana na usaidizi.

source: Module does not exist.
sw_ke: Moduli haipo.

source: An error occurred while deleting the score.
sw_ke: Hitlafu ilitokea tukifuta alama.

source: Course has no entrance exam section.
sw_ke: Kozi haina kifungu cha mtihani wa kuingia kwenye kozi.

source: all_students and unique_student_identifier are mutually exclusive.
sw_ke: wanafunzi_wote na utambuzi_wanafunzi_wakipakee wametengwa kwa utimilifu.

source: all_students and delete_module are mutually exclusive.
sw_ke: wanafunzi_wote na moduli_futa zimetengwa kwa utimilifu.

source: Requires instructor access.
sw_ke: Inahitaji ufikiaji wa mwalimu.

source: Course has no valid entrance exam section.
sw_ke: Kozi haina kifungu halali cha mtihani wa kuingia kwenye kozi.

source: All Students
sw_ke: Wanafunzi wote

source: Cannot rescore with all_students and unique_student_identifier.
sw_ke: Haiwezi kupata alama upya na wanafunzi_wote na utambuzi_wanafunzi_pekee.

source: Successfully changed due date for student {0} for {1} to {2}
sw_ke: Tarehe ya kuwadia ilifaulu kubadilishwa kwa mwanafunzi {0} wa {1} mpaka {2}

source: Successfully removed invalid due date extension (unit has no due date).
sw_ke: Tarehe ya kuwadia kwa mwisho wa maongezi ilifaulu kuondolewa(unit has no due date).

source: Successfully reset due date for student {0} for {1} to {2}
sw_ke: Tarehe ya kuwadia kwa uwekaji upya kwa mwanafunzi {0} kwa {1} mpaka {2}

source: This student (%s) will skip the entrance exam.
sw_ke: Mwanafunzi huyu (%s) atarukiza kiingilio mtihani.

source: This student (%s) is already allowed to skip the entrance exam.
sw_ke: Mwanafunzi huyu (%s) tayari ameruhusiwa kurukiza kiingilio mtihani.

source: Certificate generation task for all students of this course has been started. You can view the status of the generation task in the "Pending Tasks" section.
sw_ke: Kazi ya uzalishaji wa Vheti kwa wanafunzi wote katika kozi hii imeanza. Unaweza kutizama hali ya kazi ya uzalishaji kwenye kifungu cha "Mambo yanayosubiri maamuzi".

source: Please select one or more certificate statuses that require certificate regeneration.
sw_ke: Tafadhali chagua hali za vyeti moja au zaidi ambazo zinahitaji uzalishaji upya wa vyeti.

source: Please select certificate statuses from the list only.
sw_ke: Tafadhali chagua hali za cheti kutoka kwa orodha pekee.

source: Certificate regeneration task has been started. You can view the status of the generation task in the "Pending Tasks" section.
sw_ke: JUkumu la uzalishaji upya wa Vyeti umeanza. Unaweza kuona hali jukumu la uzalishaji kwenye kifungu cha "Majukumu yanayosubiri maamuzi".

source: Student (username/email={user}) already in certificate exception list.
sw_ke: Mwanafunzi (username/email={user}) tayari katika orodha ya vyeti vilivyo kubalika kinyume cha kanuni.

source: Certificate exception (user={user}) does not exist in certificate white list. Please refresh the page and try again.
sw_ke: Vyeti vilivyokubalika kinyume cha kanuni (user={user}) havipo katika orodha nyeupe. Tafadhali anza upya ukurasa na ujaribu tena.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
sw_ke: Kiwanja cha mwanafunzi usernsme/email kinahitajika na hakiwezi kachwa kitupu. Tunakunasihi ujaze usernsme/email na kisha bonyeza kifungo cha "Add to Exception List".

source: The record is not in the correct format. Please add a valid username or email address.
sw_ke: Taarifa haipo katika mfumo sahihi. Tafadhali ongeza jinatumishi au anwani ya barua pepe halali·

source: {user} does not exist in the LMS. Please check your spelling and retry.
sw_ke: {user} hayupo kwenye LMS. Tfadhali angalia herufi zako na jaribu upya.

source: {user} is not enrolled in this course. Please check your spelling and retry.
sw_ke: {user} hakusajiliwa katika kozi hii. Tafadhali angalia herufi zako na ujaribu upya.

source: Invalid data, generate_for must be "new" or "all".
sw_ke: Tarehe batili, zalisha_kwa lazima iwe "mpya" au "zote".

source: Certificate generation started for white listed students.
sw_ke: Uzalishaji wa Cheti ulianza kwa wanafunzi wa orodha nyeupe.

source: user "{user}" in row# {row}
sw_ke: mtumiaji "{user}" kwenye mstari# {row}

source: user "{username}" in row# {row}
sw_ke: mtumiaji "{username}" kwenye mstari# {row}

source: Certificate of {user} has already been invalidated. Please check your spelling and retry.
sw_ke: Cheti cha {user} tayari kimebatilishwa. Tafadhali tizama herufi zako na ujaribu upya.

source: Certificate for student {user} is already invalid, kindly verify that certificate was generated for this student and then proceed.
sw_ke: Cheti kwa mwanafunzi {user} tayari kimebatilishwa, kwa nasaha sawazisha kuwa cheti kizalishwa kwa mwanafunzi huyu na kikashughulikiwa.

source: Certificate Invalidation does not exist, Please refresh the page and try again.
sw_ke: Ubatilishaji wa vyeti haupo, Tafadhali anza upya ukurasa na ujaribun tena.

source: The student {student} does not have certificate for the course {course}. Kindly verify student username/email and the selected course are correct and try again.
sw_ke: Mwanafunzi {student} hana cheti kwa ajili ya kozi {course}. Tafadhali hakiki jina analotumia mwanfunzi/barua pepe na kozi iliyochaguliwa kama viko sahihi na jaribu tena.

source: coupon id is None
sw_ke: Kitambulisho cha kuponi ni Hakuna

source: coupon with the coupon id ({coupon_id}) DoesNotExist
sw_ke: kuponi iliyo kitambulisho cha kuponi ({coupon_id}) Haipo

source: coupon with the coupon id ({coupon_id}) is already inactive
sw_ke: kuponi ilio na kitambulisho cha kuponi ({coupon_id}) tayari inatumika

source: coupon with the coupon id ({coupon_id}) updated successfully
sw_ke: kuponi iliyo na kitambulisho cha kuponi ({coupon_id}) imefaulu kukamilishwa

source: The code ({code}) that you have tried to define is already in use as a registration code
sw_ke: Kificho ({code}) ulicho jaribu kueleza tayari kina tumika kama kificho cha uandikishaji

source: Please Enter the Integer Value for Coupon Discount
sw_ke: Tafadhali ingiza Tathmini ya Nambari kamili kwa Upunguzaji wa bei ya kuponi kwa maridhiano

source: Please Enter the Coupon Discount Value Less than or Equal to 100
sw_ke: Tafadhali ingiza Tathmini ya Upunguzaji wa bei ya Kuponi kwa maridhiano iwe Chini ya au Sawa na 100

source: Please enter the date in this format i-e month/day/year
sw_ke: Tafadhali ingiza tarehe katika mfumo huu ikiwa mwezi/siku/mwaka

source: coupon with the coupon code ({code}) added successfully
sw_ke: kuponi ikiwa na kificho cha kuponi ({code}) ilifaulu kuongezwa

source: coupon with the coupon code ({code}) already exists for this course
sw_ke: kuponi ikiwa na kificho cha kuponi ({code}) tayari ipo katika kozi

source: coupon id not found
sw_ke: kitambulisho cha kuponi hakipatikani

source: coupon with the coupon id ({coupon_id}) updated Successfully
sw_ke: kuponi iliyo na kitambulisho cha kuponi ({coupon_id}) imefaulu kukamilishwa

source: Instructor
sw_ke: Mwalimu

source: To gain insights into student enrollment and participation {link_start}visit {analytics_dashboard_name}, our new course analytics product{link_end}.
sw_ke: Kupata taarifa za usajilia na ushiriki wa mwanafunzi {link_start}visit {analytics_dashboard_name}, bidhaa yetu mpya ya kozi ipo kwenye {link_end}.

source: Special Exams
sw_ke: Mitihani Maalum

source: Certificates
sw_ke: Vyeti

source: Please Enter the numeric value for the course price
sw_ke: Tafadhali ingiza tathmini ya namba ya bei ya kozi

source: CourseMode with the mode slug({mode_slug}) DoesNotExist
sw_ke: Mtindo wa Kozi wenye slug modi({mode_slug}) Haipo

source: CourseMode price updated successfully
sw_ke: Bei ya Mtindo wa Kozi ilifaulu kukamilishwa

source: Course Info
sw_ke: Taarifa ya Kozi

source: Enrollment data is now available in {dashboard_link}.
sw_ke: Takwimu ya usajili sasa inapatikana katika {dashboard_link}.

source: Membership
sw_ke: Uanachama

source: Cohorts
sw_ke: 'Makundi'

source: Discussions
sw_ke: Majadiliano

source: Student Admin
sw_ke: 'Msimamizi' wa mwanafunzi

source: Extensions
sw_ke: Maongezi

source: Data Download
sw_ke: 'Pakua Data'

source: Analytics
sw_ke: Analytiki

source: Metrics
sw_ke: Metriki

source: Open Responses
sw_ke: Majibu ya Wazi

source: 0 sent
sw_ke: 0 kutumwa

source: {num_emails} sent
sw_ke: {num_emails} iliotumwa

source: {num_emails} failed
sw_ke: {num_emails} haikufaulu kutumwa

source: Complete
sw_ke: Kamili

source: Incomplete
sw_ke: Haijakamilika

source: The enrollment code ({code}) was not found for the {course_name} course.
sw_ke: Kificho cha usajili ({code}) hakikupatikana kwa kozi hii {course_name} .

source: This enrollment code has been canceled. It can no longer be used.
sw_ke: KIficho hiki cha usajili kimefutwa. Hakiwezi kutumika tena.

source: This enrollment code has been marked as unused.
sw_ke: Kificho cha usajili kimewekwa alama kama hakijatumika.

source: The enrollment code has been restored.
sw_ke: Kificho cha usajili kime rudishwa kama kilivyo kuwa awli.

source: The redemption does not exist against enrollment code ({code}).
sw_ke: Ukombozi haupo kwa kificho cha usajili ({code}).

source: Could not find student matching identifier: {student_identifier}
sw_ke: Haikuweza kupata ulinganishi wa mwanafunzi na utambuzi: {student_identifier}

source: Unable to parse date:
sw_ke: Haiwezi kuchanganua tarehe:

source: Couldn't find module for url: {0}
sw_ke: Haikuweza kupata moduli kwa url:{0}

source: Unit {0} has no due date to extend.
sw_ke: Kitengo {0} hakina tarehe ya kuwadia kuongezewa.

source: An extended due date must be later than the original due date.
sw_ke: Tarehe ya kuwadia iliyo ongezwa lazima iwe baada ya tarehe ya kuwadia ya asili.

source: No due date extension is set for that student and unit.
sw_ke: Hakuna uongezaji wa tareha ya kuwadia iliyowekwa kwa mwanafunzi yule na kitengo.

source: Full Name
sw_ke: Jina Kamili

source: Extended Due Date
sw_ke: Tarehe ya Kuwadia Iliyoongezwa

source: Users with due date extensions for {0}
sw_ke: Watumiaji walio na maongezi ya tarehe ya kuwadia kwa {0}

source: Due date extensions for {0} {1} ({2})
sw_ke: Maongezi ya tarehe ya kuwadia kwa {0} {1} ({2})

source: Not all problems in entrance exam support re-scoring.
sw_ke: Sio matatizo yote katika kiingilio cha mtihani yanaunga mkono utoaji alama.

source: rescored
sw_ke: kupata alama upya

source: reset
sw_ke: kuweka upya

source: deleted
sw_ke: imefutwa

source: emailed
sw_ke: kutumwa kwa barua pepe

source: graded
sw_ke: kupewa daraja

source: problem distribution graded
sw_ke: usambazaji wa tatizo kupewa daraja

source: generating_enrollment_report
sw_ke: kuzalisha_usajili_takwimu

source: certificates generated
sw_ke: vyeti vilivyo zalishwa

source: cohorted
sw_ke: fungamana

source: First Name
sw_ke: Jina la Kwanza

source: Last Name
sw_ke: Jina la Mwisho

source: Company Name
sw_ke: Taja Kampuni

source: Title
sw_ke: Kichwa cha muktadha

source: Year of Birth
sw_ke: Mwaka wa Kuzaliwa

source: Enrollment Date
sw_ke: Tarehe ya Usajili

source: Currently Enrolled
sw_ke: Kusajili kwa Sasa hivi

source: Enrollment Source
sw_ke: Chanzo cha Usajili

source: Manual (Un)Enrollment Reason
sw_ke: Sababu ya Usajili kwa Mkono (Un)

source: Enrollment Role
sw_ke: Jukumu Usajili

source: List Price
sw_ke: Orodha ya Bei

source: Payment Amount
sw_ke: Kima cha Kulipa

source: Coupon Codes Used
sw_ke: Vificho vya Kuponi Vilivyotumika

source: Registration Code Used
sw_ke: Vificho vya Usajili Vilivyotumika

source: Payment Status
sw_ke: Hali ya Malipo

source: Transaction Reference Number
sw_ke: Nambari ya Kumbukumbu ya Maendeshaji Shughuli

source: No status information available
sw_ke: Hakuna habari za hali ilivyo ziliopo

source: No task_output information found for instructor_task {0}
sw_ke: Hakuna habari za utoaji_jukumu zilizopatikana kwa jukumu_mwalimu {0}

source: No parsable task_output information found for instructor_task {0}: {1}
sw_ke: Hakuna habari za uchanganuzi utoaji_jukumu iliopatikana kwa jukumu_mwalimu {0}: {1}

source: No parsable status information available
sw_ke: Hakuna habari za hali ya uchanganuzi ziliopo

source: No message provided
sw_ke: Hakuna ujumbe uliotolewa

source: Invalid task_output information found for instructor_task {0}: {1}
sw_ke: Taarifa za utowaji_jukumu batili hazijapatikana kwa jukumu_mwalimu {0}: {1}

source: No progress status information available
sw_ke: Hakuna taarifa ya hali ya maendeleo ziliopo

source: No parsable task_input information found for instructor_task {0}: {1}
sw_ke: Hakuna jukumu_uingizaji wa taarifa ya changanuzi zilizopatikana kwa jukumu_mwalimu {0}: {1}

source: Progress: {action} {succeeded} of {attempted} so far
sw_ke: Maendeleo: {action} {succeeded} ya { attempted} mpaka sasa

source: Unable to find submission to be {action} for student '{student}'
sw_ke: Haikuweza kupata ufikishaji kuwa {action} kwa mwanafunzi '{student}'

source: Problem failed to be {action} for student '{student}'
sw_ke: Tatizo halikufaulu kuwa {action} kwa mwanafunzi '{student}'

source: Problem successfully {action} for student '{student}'
sw_ke: Tatizo lilifaulu {action} kwa mwanafunzi '{student}'

source: Unable to find entrance exam submission to be {action} for student '{student}'
sw_ke: Haiwezi kupata ufikishaji wa kiingilio mtihani kuwa {action} kwa mwanafunzi '{student}'

source: Entrance exam successfully {action} for student '{student}'
sw_ke: Kiingilio mtihani kimefaulu {action} kwa mwanafunzi '{student}'

source: Unable to find any students with submissions to be {action}
sw_ke: Haikuweza kupata mwanafunzi yoyote na ufikishaji kuwa {action}

source: Problem failed to be {action} for any of {attempted} students
sw_ke: Tatizo halikufaulu kuwa {action} kwa {attempted} lolote la wanafunzi

source: Problem successfully {action} for {attempted} students
sw_ke: Tatizo limefaulu {action} kwa {attempted} wanafunzi

source: Problem {action} for {succeeded} of {attempted} students
sw_ke: Tatizo {action} kwa {succeeded} ya {attempted} wanafunzi

source: Unable to find any recipients to be {action}
sw_ke: Haiwezi kupata wapokeaji yoyote kuwa {action}

source: Message failed to be {action} for any of {attempted} recipients
sw_ke: UJumbe haukufaulu kuwa {action} kwa wapokeaji {attempted} yoyote

source: Message successfully {action} for {attempted} recipients
sw_ke: Ujumbe umefaulu {action} kwa {attempted} wapokeaji

source: Message {action} for {succeeded} of {attempted} recipients
sw_ke: Ujumbe {action} kwa {succeeded} wa {attempted} wapokeaji

source: Status: {action} {succeeded} of {attempted}
sw_ke: Hali: {action} {succeeded} ya {attempted}

source: Whether to display this module in the table of contents
sw_ke: Ikiwa utaonyesha moduli hii katika meza ya yaliyomo

source: Course Chrome
sw_ke: Chromi ya Kozi

source: Default Tab
sw_ke: Tab Kosa

source: Enter the tab that is selected in the XBlock. If not set, the Course tab is selected.
sw_ke: Ingiza tab ambayo imechaguliwa katika XBlock. Kama haijawekwa, Tab ya kozi inachaguliwa.

source: LaTeX Source File Name
sw_ke: Jina la Faili ya Chanzo cha LaTeX

source: Enter the source file name for LaTeX.
sw_ke: Ingiza jina la faili ya chanzo cha LaTeX.

source: My Notes
sw_ke: Maandishi yangu/Nukuu zangu

source: Order Payment Confirmation
sw_ke: Uhakikishaji wa Malipo ya uagizaji

source: Confirmation and Registration Codes for the following courses: {course_name_list}
sw_ke: Uhakiki na Vificho vya usajili kwa kozi zifuatazo: {course_name_list}

source: Trying to add a different currency into the cart
sw_ke: KUjaribu kuongeza sarafu tafauti kwenye gari

source: Internal reference code for this invoice.
sw_ke: Kumbukumbu za Kificho cha Ndani kwa ankara hii.

source: Customer's reference code for this invoice.
sw_ke: Kumbukumbu za kificho cha mteja kwa ankara hii

source: Lower-case ISO currency codes
sw_ke: Herufi ndogo ISO sarafu vificho

source: Optional: provide additional information for this transaction
sw_ke: Hiari: toa habari zaidi kuhusu maendeshji haya

source: The number of items sold.
sw_ke: Idadi ya bidhaa zilizo uzwa.

source: The price per item sold, including discounts.
sw_ke: Bei ya kila bidhaa iliyo uzwa, pamoja na aheri.

source: Registration for Course: {course_name}
sw_ke: Usajili kwa ajili ya Kozi: {course_name}

source: Please visit your {link_start}dashboard{link_end} to see your new course.
sw_ke: Tafadhali tembelea {link_start}dashibodi yako{link_end} uone kozi yako mpya.

source: Enrollment codes for Course: {course_name}
sw_ke: Vificho vya usajili kwa Kozi: {course_name}

source: Mode {mode} does not exist for {course_id}
sw_ke: Mtindo {mode} haupo kwa {course_id}

source: {mode_name} for course {course}
sw_ke: {mode_name} ya kozi {course}

source: You can unenroll in the course and receive a full refund for 14 days after the course start date.
sw_ke: Unaweza kutengua usajili wako katika kozi na upokee malipo kamili kwa siku 14 baada ya tarehe ya kuanza kozi.
