Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: sw_ke

source: This may be happening because of an error with our server or your internet connection. Try refreshing the page or making sure you are online.
sw_ke: Hii inaweza kutokea sababu ya hitlafu na sava yetu au maunganishi ya mtandao wako. Jaribu kuburudisha tena au hakikisha kama bado uko mtandaoni.

source: Studio's having trouble saving your work
sw_ke: Studio's ina shida kudhibiti kazi yako

source: Delete Page Confirmation
sw_ke: Futa ukurasa wa uhakikisho

source: Are you sure you want to delete this page? This action cannot be undone.
sw_ke: Una hakika wataka kufuta ukurasa huu? Hili halitoweza kurudiwa.

source: Deleting
sw_ke: Kufuta

source: OpenAssessment Save Error
sw_ke: Hitlafu ya kudhibiti OpenAssessment

source: This link will open in a new browser window/tab
sw_ke: Kiunganishi hiki kitafungua dirisha la kisakuzi kipya au tab

source: This link will open in a modal window
sw_ke: Kiunganishi hiki kitafungua katika dirisha la modali

source: Could not parse certificate JSON. %(message)s
sw_ke: Haikuweza kuchanganua vyeti vya JSON. %(message)s

source: Certificate name is required.
sw_ke: Jina la cheti lahitajika.

source: Signatory field(s) has invalid data.
sw_ke: Kiwanja cha msahihishi(s) kina ujumbe usio stahili.

source: Edit this certificate?
sw_ke: Kagua cheti hiki?

source: This certificate has already been activated and is live. Are you sure you want to continue editing?
sw_ke: Cheti hiki kiko tayari na hai. Una hakika wahitaji kuendelea " "na ukaguzi?

source: Yes, allow edits to the active Certificate
sw_ke: Ndio, ruhusu ukaguzi wa cheti tayari

source: certificate
sw_ke: cheti

source: Set up your certificate
sw_ke: Tengeneza cheti chako

source: You have not created any certificates yet.
sw_ke: Bado hauja tengeneza cheti chochote.

source: Delete "<%= signatoryName %>" from the list of signatories?
sw_ke: Futa \"<%= signatoryName %>\" kutoka kwa orodha ya wasahihishi?

source: This action cannot be undone.
sw_ke: Tendo hili haliwezi kufanyika.

source: Upload signature image.
sw_ke: Pakia taswira ya sahihi.

source: Image must be in PNG format.
sw_ke: Taswira lazima iwe katika mfumo wa PNG.

source: Group %s
sw_ke: Kundi %s

source: There has been an error while exporting.
sw_ke: Kulikuwepo hitlafu kupeleka ujumbe kwengine.

source: There has been a failure to export to XML at least one component. It is recommended that you go to the edit page and repair the error before attempting another export. Please check that all components on the page are valid and do not display any error messages.
sw_ke: Usafirishaji nje wa XML haukufaulu kwa japo sehemu moja. Inapendekezwa uende kwa ukurasa wa ukaguzi na urekebishe hitlafu kabla kujaribu usafirishaji nje mwengine. Tafadhali tizama kuwa sehemu zote katika ukurasa bado ni halali na usionyeshe jumbe za hitlafu yoyote.

source: Correct failed component
sw_ke: Rekebisha sehemu ambayo haikufaulu

source: Return to Export
sw_ke: Rudi kwa Usafirishaji Nje

source: Your library could not be exported to XML. There is not enough information to identify the failed component. Inspect your library to identify any problematic components and try again.
sw_ke: Maktaba yako haikuweza kusafirishwa kwenda kwa XML. Hakuna habari za kutosha kutambua sehemu ambayo haikufaulu. Kagua maktaba yako utambue sehemu zozote zilizo na shida na ujaribu tena.

source: Take me to the main library page
sw_ke: Nipeleke kwa ukurasa wa maktaba kuu

source: Your course could not be exported to XML. There is not enough information to identify the failed component. Inspect your course to identify any problematic components and try again.
sw_ke: Fanni yako haikuweza kusafirisha nje kwenda kwa XML. Hakuna habari za kutosha kutambua sehemu ambayo haikufaulu. Kagua fanni yako utambue sehemu zozote zilizo na shida na ujaribu tena

source: Take me to the main course page
sw_ke: Nipeleke kwa ukurasa wa fanni yenyewe

source: The raw error message is:
sw_ke: Ujumbe wa hitlafu yenyewe ni:

source: There has been an error with your export.
sw_ke: Kumekuwa na hitlafu na utumaji wako.

source: There was an error while importing the new library to our database.
sw_ke: Kulikuwa na hitlafu kupokea maktaba mpya kwa hazina yetu ya ujumbe.

source: There was an error while importing the new course to our database.
sw_ke: Kulikuwa na hitlafu kupokea fanni mpya kwa hazina yetu ya ujumbe.

source: There was an error during the upload process.
sw_ke: Kulikuwa na hitlafu wakati wa shughuli za upakiaji.

source: There was an error while unpacking the file.
sw_ke: Kulikuwa na hitlafu kupangua faili.

source: There was an error while verifying the file you submitted.
sw_ke: Kulikuwa na hitlafu kuhakikisha faili uliofikisha.

source: Choose new file
sw_ke: Chagua faili mpya

source: Your import has failed.
sw_ke: Upokeaji wako haukufaulu.

source: File format not supported. Please upload a file with a {file_extension} extension.
sw_ke: Mfumo wa faili hausaidiki. Tafadhali pakia faili yenye {file_extension} kuongezeka.

source: Already a course team member
sw_ke: Tayari ni mwanakikosi cha fanni

source: Are you sure you want to delete {email} from the course team for “{container}”?
sw_ke: Una hakika wahitaji kufuta {email} kutoka kwa kikosi cha fanni "{container}"?

source: Staff
sw_ke: Mfanyi kazi/Muajiriwa

source: Admin
sw_ke: Kiranja

source: Already a library team member
sw_ke: Tayari ni mwanakikosi cha maktaba

source: Are you sure you want to delete {email} from the library “{container}”?
sw_ke: Una hakika wahitaji kufuta {email} kutoka kwa maktaba "{container}"?

source: Library User
sw_ke: Mtumiaji wa maktaba

source: Hide Deprecated Settings
sw_ke: Ficha Mikakati ilio na ulalamishi

source: Show Deprecated Settings
sw_ke: Onyesha Mikakati Lalamishi

source: You have unsaved changes. Do you really want to leave this page?
sw_ke: Una mabadiliko hayaja dhibitiwa. Kweli wahitaji kuondoka kwa ukurasa huu?

source: Queued
sw_ke: Lolongana

source: Upload completed
sw_ke: Upakiaji umekamilika

source: Upload failed
sw_ke: Upakiaji haukufaulu

source: Chapter name and asset_path are both required
sw_ke: Jina la sura na mali_njia zote zahitajika

source: Chapter name is required
sw_ke: Jina la sura la hitajika

source: asset_path is required
sw_ke: Mali_njia ina hitajika

source: You must specify a name
sw_ke: Lazima ubainishe jina lako

source: Action required: Enter a valid date.
sw_ke: Kitendo cha hitajika: Ingiza tarehe halali

source: Group name is required
sw_ke: Jina la kundi lahitajika

source: Group A
sw_ke: Kundi A

source: Group B
sw_ke: Kundi B

source: Group Configuration name is required.
sw_ke: Jina la mchanganyiko wa kundi la hitajika

source: There must be at least one group.
sw_ke: Lazima liwepo japo kundi moja.

source: All groups must have a name.
sw_ke: Makundi yote lazima yawe na jina.

source: All groups must have a unique name.
sw_ke: Makundi yote lazima yawe jina la kipekee.

source: The course must have an assigned start date.
sw_ke: Fanni lazima ipate tarehe maalum wa kuanzia.

source: The course end date must be later than the course start date.
sw_ke: Tarehe ya kumalizia fanni lazima iwe baada ya tarehe ya kuanzia fanni.

source: The course start date must be later than the enrollment start date.
sw_ke: Tarehe ya kuanzia fanni lazima iwe baada ya tarehe ya kuanza usajili.

source: The enrollment start date cannot be after the enrollment end date.
sw_ke: Tarehe ya kuanza kusajili haiwezi kuwa baada ya tarehe ya mwisho wa usajili.

source: The enrollment end date cannot be after the course end date.
sw_ke: Tarehe ya mwisho wa kusajili haiwezi kuwa baada ya tarehe ya kumaliza fanni.

source: Key should only contain letters, numbers, _, or -
sw_ke: Ufunguo wastahili uwe na herufi,nambari, _, au -

source: Please enter an integer between %(min)s and %(max)s.
sw_ke: Tafadhali ingiza inteja baina %(min)s na %(max)s.

source: There's already another assignment type with this name.
sw_ke: Tayari kulikuwepo jaribio jingine kwa jina hili.

source: Please enter an integer between 0 and 100.
sw_ke: Tafadhali ingiza inteja baina 0 na 100.

source: Please enter an integer greater than 0.
sw_ke: Tafadhali ingiza inteja kubwa zaidi ya 0.

source: Please enter non-negative integer.
sw_ke: Tafadhali ingiza inteja isio hasi

source: Cannot drop more <%= types %> assignments than are assigned.
sw_ke: Haiwezi kuangusha zaidi <%=types%> majaribio kiliko yaliyo kabidhiwa.

source: Grace period must be specified in HH:MM format.
sw_ke: Kipindi cha neema lazima kifahamike kwa mfumo wa HH:MM

source: Not able to set passing grade to less than %(minimum_grade_cutoff)s%.
sw_ke: Haiwezi kuweka mikakati ya daraja ya kufaulu kwa chini ya %(minimum_grade_cutoff)s%.

source: Textbook name is required
sw_ke: Jina la kitabu lahitajika

source: Please add at least one chapter
sw_ke: Tafadhali ongeza japo kichwa kimoja

source: All chapters must have a name and asset
sw_ke: Sura zote lazima ziwe na jina na mali

source: Only <%= fileTypes %> files can be uploaded. Please select a file ending in <%= fileExtensions %> to upload.
sw_ke: Tu <%=fileTypes%> faili zaweza kupakiwa. Tafadhali chagua faili imalizikiyayo na <%=fileExtensions %> kupakia.

source: or
sw_ke: au

source: This component has validation issues.
sw_ke: Sehemu ina mambo yakuhalalishwa.

source: Your video uploads are not complete.
sw_ke: Mapakiaji yako ya video hayaja kamilika.

source: Delete File Confirmation
sw_ke: Futa uhakikishaji wa faili

source: Are you sure you wish to delete this item. It cannot be reversed! Also any content that links/refers to this item will no longer work (e.g. broken images and/or links)
sw_ke: Una hakika wahitaji kufuta bidhaa hii. Hatowezekana kuirudisha! Pia yaliyomo yoyote ambayo yaunganisha/kuashiria kwa bidhaa hii hazifanyi kazi tena (e.g broken images and/or links)

source: Your file has been deleted.
sw_ke: Faili yako imefutwa.

source: Date Added
sw_ke: Tarehe Imeongezewa

source: Type
sw_ke: Aina/Andika

source: File {filename} exceeds maximum size of {maxFileSizeInMBs} MB
sw_ke: Faili {filename} inapita kiwango chake cha {maxFileSizeInMBs} MB

source: Please follow the instructions here to upload a file elsewhere and link to it: {maxFileSizeRedirectUrl}
sw_ke: Tafadhali fuata maagizo hapa kupakia faili kwengine na uiunganishe kwa: {maxFileSizeRedirectUrl}

source: Your file could not be uploaded
sw_ke: Faili yako haikuweza kupakiwa

source: Max file size exceeded
sw_ke: Kiwango cha faili kimepita zaidi inavyo stahili

source: Upload New File
sw_ke: Pakia faili mpya

source: Load Another File
sw_ke: Pakia faili nyingine

source: Adding
sw_ke: Ongezea/Jumlisha

source: Not in Use
sw_ke: Haitumiki

source: Used in {count} unit
sw_ke: Inatumika kwa kitengo {count}

source: content group
sw_ke: Kundi la yaliyomo

source: Add your first content group
sw_ke: Ongeza kundi lako la kwanza la yaliyomo

source: You have not created any content groups yet.
sw_ke: Bado haujabuni kundi lolote la yaliyomo.

source: Are you sure you want to delete this update?
sw_ke: Una hakika wahitaji kufuta ukamilifu huu?

source: Create Re-run
sw_ke: Buni Urudiaji tena

source: Processing Re-run Request
sw_ke: Kushughulikia Ombi la Urudiaji tena

source: Upload a new PDF to “<%= name %>”
sw_ke: Pakia PDF mpya kwa "<%=name %>"

source: Please select a PDF file to upload.
sw_ke: Tafadhali chagua faili ya PDF upakie.

source: Contains {count} group
sw_ke: Ina kundi {count}

source: group configuration
sw_ke: mkusanyiko wa kundi

source: Add your first group configuration
sw_ke: Ongeza mkusanyiko wako wa kwanza wa kundi

source: You have not created any group configurations yet.
sw_ke: Bado hauja buni mikusanyiko wa yoyote ya kundi.

source: Your import is in progress; navigating away will abort it.
sw_ke: Upokeaji wako kutoka nje unaendelea; ukumarisia mbali itaupoteza.

source: Error importing course
sw_ke: Hitlafu katika kupokea fanni

source: There was an error with the upload
sw_ke: Kulikuwa na hitlafu na upakiaji

source: Upload instructor image.
sw_ke: Pakia taswira ya mwalimu.

source: Files must be in JPEG or PNG format.
sw_ke: Faili lazima iwe katika mfumo wa JPEG au PNG.

source: All Rights Reserved
sw_ke: Haki zote zimemilikiwa

source: You reserve all rights for your work
sw_ke: Una miliki haki zote za kazi yako

source: You waive some rights for your work, such that others can use it too
sw_ke: Ondoa baadhi ya haki za kazi yako, ili wengine waweze kutumia pia

source: Version
sw_ke: Mtindo

source: Attribution
sw_ke: Sifa / Changio

source: Allow others to copy, distribute, display and perform your copyrighted work but only if they give credit the way you request. Currently, this option is required.
sw_ke: Ruhusu wengine waige, waisambaze, waionyeshe na waifanye kazi yako lakini tu wakiwa wataadhimisha kama utakavyoomba. kwa sasa hivi chaguo hili lahitajika.

source: Noncommercial
sw_ke: Sio cha biashara

source: Allow others to copy, distribute, display and perform your work - and derivative works based upon it - but for noncommercial purposes only.
sw_ke: Ruhusu wengine waige, waisambaze, waionyeshe na waifanye kazi yako - na kazi inayotokana na hiyo - lakini kwa malengo yasio kibiashara pekee.

source: No Derivatives
sw_ke: Hakuna Kigezo / Hakuna Kinachotokana nacho

source: Allow others to copy, distribute, display and perform only verbatim copies of your work, not derivative works based upon it. This option is incompatible with "Share Alike".
sw_ke: Ruhusu kuiga, sambaza, onyesha na tekeleza vigezo vya verbatim vya kazi yako, sio kwa kazi ya msingi wakutokana nyingine.Hiari hii hailinganishwi na "Shirikiana na".

source: Share Alike
sw_ke: Shirikianeni pamoja

source: Allow others to distribute derivative works only under a license identical to the license that governs your work. This option is incompatible with "No Derivatives".
sw_ke: Ruhusu wengine kusambaza kazi za kutokana na chanzo kingine pekee chini ya leseni pacha na leseni inayo simamia kazi yako. Hiari hii halinganishiki na "Isiyo Tokana na".

source: Delete this %(item_display_name)s?
sw_ke: Futa hii %(item_display_name)s?

source: Deleting this %(item_display_name)s is permanent and cannot be undone.
sw_ke: Ufutaji wa hii %(item_display_name)s ni wakudumu na waiwezekani kurudishwa.

source: There was an error changing the user's role
sw_ke: Kulikuwa na hitlafu kubadilisha majukumu ya mtumiaji

source: Error adding user
sw_ke: Kuna hitlafu kuongeza mtumiaji

source: Error removing user
sw_ke: Kuna hitlafu kufuta mtumiaji

source: A valid email address is required
sw_ke: Anwani barua pepe inahitajika

source: You must enter a valid email address in order to add a new team member
sw_ke: Lazima uingize anwani barua pepe inayotumika ili uweze kuongeza mwanakikosi mpya

source: Return and add email address
sw_ke: Rudisha na ongezea anwani barua pepe

source: Already a member
sw_ke: Tayari ni mwanachama

source: {email} is already on the {container} team. Recheck the email address if you want to add a new member.
sw_ke: {email} tayari iko kwa {container} kikosi. Tizama tena anwani barua pepe ukihitaji kuongeza mwachama mpya.

source: Return to team listing
sw_ke: Rudia kwa orodha ya kikosi

source: Are you sure?
sw_ke: Una hakika?

source: Are you sure you want to restrict {email} access to “{container}”?
sw_ke: Unahakika unahitaji kukazia {email} upatikanaji wa “{container}”?

source: %(display_name)s Settings
sw_ke: %(display_name)s Mikakati

source: Change the settings for %(display_name)s
sw_ke: Badilisha mikakati kwa %(display_name)s

source: Publish %(display_name)s
sw_ke: Chapisha %(display_name)s

source: Publish all unpublished changes for this %(item)s?
sw_ke: Chapisha mabadiliko yote hayajachapishwa ya hii %(item)s?

source: Publish
sw_ke: Chapisha

source: Basic
sw_ke: Msingi

source: Access
sw_ke: Ruhusa ya utumizi

source: Editing: %(title)s
sw_ke: Sawazisha: %(title)s

source: Component
sw_ke: Sehemu

source: Validation Error While Saving
sw_ke: Hitlafu ya uhalalishaji tukiwa tunadhibiti

source: Undo Changes
sw_ke: Badilisha mabadiliko kama yalivyokuwa mwanzo

source: Change Manually
sw_ke: Badilisha kwa mkono

source: Not Graded
sw_ke: Haina daraja

source: Date added
sw_ke: Tarehe imeongezewa

source: Editing visibility for: %(title)s
sw_ke: Kukagua onyeshaji wa: %(title)s

source: Duplicating
sw_ke: Fanya pacha

source: Publishing
sw_ke: Kuchapisha

source: Discard Changes
sw_ke: Puuza Mabadiliko

source: Are you sure you want to revert to the last published version of the unit? You cannot undo this action.
sw_ke: Unahakika unahitaji kuregelea kwa chapisho la mwisho kwa kitengo hiki? Huwezi kurudia tendo hili.

source: Discarding Changes
sw_ke: Kupuuza mageuzi

source: Hiding from Students
sw_ke: Ficha kutoka kwa wanafunzi

source: Explicitly Hiding from Students
sw_ke: Ficha kutoka kwa wanafunzi hadharani

source: Inheriting Student Visibility
sw_ke: Kurithi nadhari ya wanafunzi

source: Make Visible to Students
sw_ke: Dhihirisha kwa wanafunzi

source: If the unit was previously published and released to students, any changes you made to the unit when it was hidden will now be visible to students. Do you want to proceed?
sw_ke: Kama kitengo kilichapishwa mbeleni na kutolewa kwa wanafunzi, mageuzi yoyote uliofanya kwenye kitengo kilipofichwa sasa yatonekana na wanafunzi. Je wahitaji kuendelea?

source: Making Visible to Students
sw_ke: Onyesha kwa wanafunzi

source: Course Index
sw_ke: Nambari ya Fanni

source: There were errors reindexing course.
sw_ke: Kulikuwa na hitlafu kupeana tena nambari ya fanni.

source: Hide Previews
sw_ke: Ficha Mitazamo kabla

source: Show Previews
sw_ke: Onyesha Mitazamo kabla

source: Showing %(current_item_range)s out of %(total_items_count)s, filtered by %(asset_type)s, sorted by %(sort_name)s ascending
sw_ke: Kuonyesha %(current_item_range)s kati ya %(total_items_count)s, imechujwa na %(asset_type)s, chaguliwa na %(sort_name)s kufikia uwingi

source: Showing %(current_item_range)s out of %(total_items_count)s, filtered by %(asset_type)s, sorted by %(sort_name)s descending
sw_ke: Kuonyesha %(current_item_range)s kati ya %(total_items_count)s, imechujwa na %(asset_type)s, chagulliwa na %(sort_name)s kufikia uchache

source: Showing %(current_item_range)s out of %(total_items_count)s, sorted by %(sort_name)s ascending
sw_ke: Kuonyesha %(current_item_range)s kati ya %(total_items_count)s, chaguliwa na %(sort_name)s kufikia uwingi

source: Showing %(current_item_range)s out of %(total_items_count)s, sorted by %(sort_name)s descending
sw_ke: Kuonyesha %(current_items_range)s kati ya %(total_items_count)s, chaguliwa na %(sort_name)s kufikia uchache

source: %(total_items)s total
sw_ke: %(total_items)s jumla

source: Pending
sw_ke: Inasubiri huduma

source: Your changes will not take effect until you save your progress. Take care with key and value formatting, as validation is not implemented.
sw_ke: Mageuzi yako hayataathiri mpaka udhibiti maendeleo yako. Chukua tahadhari na mfumo wa funguo na tathmini, ikiwa uhalalishaji hautatekelezeka.

source: Your policy changes have been saved.
sw_ke: Mabadiliko yako ya kanuni yamedhibitiwa.

source: No validation is performed on policy keys or value pairs. If you are having difficulties, check your formatting.
sw_ke: Hakuna uhalalishaji umefanyika kwa kanuni funguo au tathimini ya uwili. Kama una tashwishi angalia mfumo wako.

source: For grading to work, you must change all {oldName} subsections to {newName}.
sw_ke: Kwa utoaji daraja kufanya kazi, lazima ubadilishe {oldName} vifungu vidogo vyote kwa {newName}.

source: Course Credit Requirements
sw_ke: Mahitaji ya mkopo katika fanni

source: The minimum grade for course credit is not set.
sw_ke: Mkakati wa daraja ya chini ya mkopo katika fanni haujawekwa.

source: Course pacing cannot be changed once a course has started.
sw_ke: Kasi ya fanni haiwezi kubadilishwa iwapo fanni imeanza.

source: Upload your course image.
sw_ke: Pakia taswira yako ya fanni.

source: Upload your banner image.
sw_ke: Pakia taswira ya bango lako.

source: Upload your video thumbnail image.
sw_ke: Pakia taswira ya video ya kucha ya kidole gumba yako.

source: Delete “<%= name %>”?
sw_ke: Futa “<%= name %>”?

source: Deleting a textbook cannot be undone and once deleted any reference to it in your courseware's navigation will also be removed.
sw_ke: Kufuta kitabu cha kiada hakuwezi kurudiwa na itakapo futwa lolote liambatanalo na kitabu litaondolewa pia kwenye marisi ya courseware.

source: Upload
sw_ke: Pakia

source: We're sorry, there was an error
sw_ke: Twaomba samahani / radhi, kulikuwa na hitlafu

source: The combined length of the organization, course number, and course run fields cannot be more than <%=limit%> characters.
sw_ke: Urefu uliounganishwa wa shirika, nambari ya fanni, na viwanja vya uendeshaji wa fanni hauwezi kuwa zaidi ya <%=limit%> idadi.

source: The combined length of the organization and library code fields cannot be more than <%=limit%> characters.
sw_ke: Urefu uliounganishwa wa shirika na viwanja vy kificho maktaba hauwezi kuwa zaidi ya <%=limit%> idadi.

source: Deleting this %(xblock_type)s is permanent and cannot be undone.
sw_ke: Ufutaji wa hii %(xblock_type)s ni wakudumu na huwezi kurudiliwa.

source: Any content that has listed this content as a prerequisite will also have access limitations removed.
sw_ke: Yaliyomo yoyote yalio orodhesha yaliyomo haya kama sharti pia yataondolewa mikazo ya ruhusa ya upatikanaji.

source: Delete this %(xblock_type)s (and prerequisite)?
sw_ke: Futa hii %(xblock_type)s (and prerequisite)?

source: Yes, delete this %(xblock_type)s
sw_ke: Ndio, futa hii %(xblock_type)s

source: Delete this %(xblock_type)s?
sw_ke: Futa hili %(xblock_type)s?

source: section
sw_ke: kifungu

source: subsection
sw_ke: kifungu kidogo au kifungu toto

source: unit
sw_ke: kitengo

source: You've made some changes
sw_ke: Umefanya mabadiliko

source: Your changes will not take effect until you save your progress.
sw_ke: Mabadiliko yako hayata kuwa na athari mpaka udhibiti maendeleo yako.

source: You've made some changes, but there are some errors
sw_ke: Umefanya mageuzi, lakini kuna hitlafu

source: Please address the errors on this page first, and then save your progress.
sw_ke: Tafadhali elezea hitlafu katika ukurasa huu wa kwanza, na udhibiti maendeleo yako.

source: Save Changes
sw_ke: Dhibiti Mabadiliko

source: Please select a file in .srt format.
sw_ke: Tafadhali chagua faili katika mfumo wa .srt

source: Error: Uploading failed.
sw_ke: Hitlafu: Upakiaji huakufaulu.

source: Error: Import failed.
sw_ke: Hitlafu: Upokeaji kutoka nje haukufaulu.

source: Error: Replacing failed.
sw_ke: Hitlafu: Ubadilishaji haukufaulu.

source: Error: Choosing failed.
sw_ke: Hitlafu: Uchagaji haukufaulu.

source: Error: Connection with server failed.
sw_ke: Hitlafu: Uunganishaji wa kwa sava haukufaulu.

source: No sources
sw_ke: Hakuna vyanzo

source: Link types should be unique.
sw_ke: Aina za viunganishi za stahili kuwa za kipekee.

source: Links should be unique.
sw_ke: Viunganishi vya stahili viwe vya kipekee.

source: Incorrect url format.
sw_ke: Mfumo kombo wa url.

source: Sorry, there was an error parsing the subtitles that you uploaded. Please check the format and try again.
sw_ke: Samahani, kulikuwa na hitlafu kuchanganua vichwa vidogo ulivyo pakia. Tafadhali tizama mfumo na ujaribu tena.

source: Upload translation
sw_ke: Upakiaji wa tafsiri

source: Editor
sw_ke: Mkaguzi / Mhariri

source: Settings
sw_ke: Mikakati

source: New %(component_type)s
sw_ke: Mpya %(component_type)s

source: Warning
sw_ke: Onyo

source: Updating Tags
sw_ke: Kukamilisha Tags

source: Actions
sw_ke: Matendo

source: Unscheduled
sw_ke: Haija pangiwa

source: Date
sw_ke: Tarehe

source: gettext(
sw_ke: Pata ujumbe(

source: Previous
sw_ke: Iliopita/Iliotangulia
