Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: The library creator must give you access to the library. Contact the library creator or administrator for the library you are helping to author.
sw_ke: M'buni wa maktaba lazima akupe ufikiaji kwa maktaba. Wasiliana na m'buni wa maktaba au mtawala wa maktaba unaemsaidia kwa utungaji.

source: Create Your First Library
sw_ke: Buni Maktaba Yako ya Kwanza

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
sw_ke: Maktaba ina dimbwi la vigezo ambavyo vyaweza kutumiwa upya/tena kwa kozi tofauti tofauti. Buni maktaba yako ya kwanza kwa kubonyeza kifungo!

source: New to {studio_name}?
sw_ke: Mpya kwa {studio_name}?

source: Click Help in the upper-right corner to get more information about the {studio_name} page you are viewing. You can also use the links at the bottom of the page to access our continually updated documentation and other {studio_name} resources.
sw_ke: Bonyeza usaidizi kwa kona ya juu kulia kupata taarifa zaidi kuhusu {studio_name} ukurasa unao angalia. Waweza pia kutumia viunganishi chini ya ukurasa kupata ukamilishaji wa nyaraka mfulululizo na asili nyingine {studio_name}.

source: Getting Started with {studio_name}
sw_ke: Anza na {studio_name}

source: Can I create courses in {studio_name}?
sw_ke: Je naweza kubuni kozi katika {studio_name}?

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
sw_ke: Ili uweze kubuni kozi katika {studio_name}, lazima {link_start}uwasiliane na {platform_name} mfanyi kazi akusaidie kubuni kozi{link_end}.

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
sw_ke: Ili uweze kubuni kozi katika {studio_name}, lazima uwe na marupurupu ya m'buni wa kozi kubuni kozi yako mwenyewe.

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
sw_ke: Maombi yako kwa mtungaji wa kozi katika {studio_name} yamekataliwa. Tafadhali {link_start}wasiliana na {platform_name} mfanyi kazi kwa masuali zaidi{link_end}.

source: Thanks for signing up, {name}!
sw_ke: Asante kwa kujinga, {name}!

source: We need to verify your email address
sw_ke: Tunahitaji kuhakiki anwani yako ya barua pepe

source: Almost there! In order to complete your sign up we need you to verify your email address ({email}). An activation message and next steps should be waiting for you there.
sw_ke: Karibu na hapo! Ili ukamilishe kujiunga kwako twahitaji wewe uhakikishe anwani yako ya barua pepe ({email}). Ujumbe wa kuamsha na hatua nyenginezo zitakungojea huko.

source: Need help?
sw_ke: Unahitaji msaada?

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
sw_ke: Tafadhali angalia mikunjo ya Spam na Junk iwapo anwani yetu ya barua pepehaipo kwenye KISANDUKU CHA UPOKEZI WA JUMBE ZA BARUA PEPE. Bado huwezi kupata barua pepe ya kuthibitisha?Omba usaidizi kupitia kiunganishi hapo chini.

source: Content Library
sw_ke: Yaliyomo Maktaba

source: Add Component
sw_ke: Ongeza Kigezo/Sehemu

source: Adding content to your library
sw_ke: Kuongeza yaliyomo kwa maktaba yako

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
sw_ke: Ongeza vigezo kwa maktaba yako kwa matumizi ya kozi, ukitumia Ongeza Kigezo Kipya chini ya ukurasa huu.

source: Components are listed in the order in which they are added, with the most recently added at the bottom. Use the pagination arrows to navigate from page to page if you have more than one page of components in your library.
sw_ke: Vigezo vimeorodheshwa katika mpangilio kulingana vinavyo ongezwa, ikiwa kilichuongezewa karibuni zaidi kuwa chini. Tumia mishale ya kuweka nambari za kurasa kumarisi kutoka ukurasa hadi mwingine iwapo una kurasa zaidi ya moja ya vigezo kwenye maktaba yako.

source: Using library content in courses
sw_ke: Tumia maudhui ya 'maktaba' katika kozi

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
sw_ke: Tumia yaliyomo ya maktaba katika kozi kwa kuongezea {em_start}yaliyomo_maktaba{en_end} kanuni halisi kwa Orodha ya Kipimo Kilichoboreshwa kwenye Mikakati Ilioboreshwa ya kozi, kisha ongeza Pande kubwa la yaliyomo ya kubahatisha kwenye koziwea. Kwenye Mikakati ya kila pande la yaliyomo ya kubahatisha, chagua maktaba hii kama maktaba asili, na utaje idadi ya matatizo yachagulie kwa kubahatisha na yaonyeshwe kwa kila mwanafunzi.

source: Learn more about content libraries
sw_ke: Jifunze zaidi kuhusu yaliyomo ya maktaba

source: Course Team Settings
sw_ke: Mikakati ya Kikosi cha Kozi

source: New Team Member
sw_ke: Mwanachama Mpya

source: Add a User to Your Course's Team
sw_ke: Ongezea Mtumiaji Kwenye Timu yako ya Kozi

source: New Team Member Information
sw_ke: Taarifa za Mwanatimu Mpya

source: User's Email Address
sw_ke: Anwani ya Barua Pepe ya Mtumiaji

source: Provide the email address of the user you want to add as Staff
sw_ke: Toa anwani ya barua pepe kwa mtumiaji unaetaka kumuongeza kama Mfanyakazi

source: Add User
sw_ke: Ongeza Mtumiaji

source: Add Team Members to This Course
sw_ke: Ongeza Wanatimu kwenye Hii Kozi

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
sw_ke: Kuongeza wanakikosi inafanya utungaji wa kozi uwe wa ushirikiano. Watumiaji lazima wajiunge kwa mtandao wa {studio_name} na wapate akaunti zilizo amka/hai.

source: Add a New Team Member
sw_ke: Ongeza Mwanatimu Mpya

source: Course Team Roles
sw_ke: Majukumu ya Timu ya Kozi

source: Course team members with the Staff role are course co-authors. They have full writing and editing privileges on all course content.
sw_ke: Wanakikosi wa kozi na uwajibikaji wa Wafanya kazi ni watunzi wenza. Wana haki kamili za uandishi na uhariri kwa yaliyomo yote katika kozi.

source: Admins are course team members who can add and remove other course team members.
sw_ke: Wasimamizi ni wanatimu wa kozi ambao wanaweza kuongeza na kuondoa wanatimu wengine wa kozi.

source: All course team members can access content in Studio, the LMS, and Insights, but are not automatically enrolled in the course.
sw_ke: Wanakikosi wote wa kozi wanaweza kufikia yaliyomo katika studio, LMS, na Umaizi, lakini hawajasajiliwa kiwenyewe katika kozi.

source: Transferring Ownership
sw_ke: Kuhamisha Umiliki

source: Every course must have an Admin. If you are the Admin and you want to transfer ownership of the course, click <strong>Add admin access</strong> to make another user the Admin, then ask that user to remove you from the Course Team list.
sw_ke: Kila kozi lazima iwe na mtawala. Kama wewe ni mtawala na unahitaji kuhamisha umiliki wa kozi, bonyeza <strong>Ongeza ufikiaji wa mtawala</strong> kumtawaza mtumiaji mwengine Utawala, kisha muuliaze huyo mtumiaji akuondoe katika orodha ya Kikosi cha Kozi.

source: Library User Access
sw_ke: Fursa ya Mtumiaji Maktaba

source: User Access
sw_ke: Fursa ya Mtumiaji

source: Grant Access to This Library
sw_ke: Toa ya Idhini ya Upatikanaji wa Hii Maktaba

source: Provide the email address of the user you want to add
sw_ke: Toa anwani ya barua pepe ya mtumiaji unaetaka kumuongeza

source: Add More Users to This Library
sw_ke: Ongeza Watumiaji Zaidi kwenye Maktaba Hii

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
sw_ke: Idhinisha ufikiaji kwa washiriki wengine wa kikosi cha kozi kwa maktaba hii. Watumiaji wapya wa maktaba lazima wawe na akaunti {studio_name} ilioamka/hai.

source: Add a New User
sw_ke: Ongeza Mtumiaji Mpya

source: Library Access Roles
sw_ke: Majukumu ya upatikanaji wa Maktaba

source: There are three access roles for libraries: User, Staff, and Admin.
sw_ke: Kuna majukumu matatu ya upatikanaji wa maktaba: Mtumiaji, Mfanyakazi, na Msimamizi.

source: Library Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
sw_ke: Watumiaji wa Maktaba waweza kuangalia yaliyomo ya maktaba na wanaweza kurudia au kutumia vigezo vya maktaba katika kozi zao, lakini hawawezi kuhariri yaliyomo ya maktaba.

source: Library Staff are content co-authors. They have full editing privileges on the contents of a library.
sw_ke: Wafanya kazi wa maktaba ni watungaji wenza wa yaliyomo. Wana haki kamili za uhariri kwa yaliyomo ya maktaba.

source: Library Admins have full editing privileges and can also add and remove other team members. There must be at least one user with the Admin role in a library.
sw_ke: Watawala wa Maktaba wana haki kamili za uhariri na waweza pia kuongeza na kupunguza wanakikosi. Lazima kuwepo na japo mtumiaji mmoja na jukumu la Mtawala katika maktaba.

source: Sign Up
sw_ke: Jiandikishe Mtandaoni

source: Sign Up for {studio_name}
sw_ke: Kujisajili Mtandaoni kwa {studio_name}

source: Already have a {studio_name} Account? Sign in
sw_ke: Tayari una {studio_name} Akaunti? Ingia mtandaoni

source: Ready to start creating online courses? Sign up below and start creating your first {platform_name} course today.
sw_ke: Uko tayari kuanza kubuni kozi inayotawaliwa na mtandao? Jiandikishe hapo chini na uanze kubuni kozi {start_name} yako ya kwanza leo.

source: Required Information to Sign Up for {studio_name}
sw_ke: Habari Inayohitajiwa Kujiandikisha kwa {studio_name}

source: This will be used in public discussions with your courses and in our edX101 support forums
sw_ke: Hii itatumika katika majadiliano ya wazi ya kozi yako na kwenye majukwaa yetu ya msaada ya edX101 .

source: Your Location
sw_ke: Eneo Lako

source: Preferred Language
sw_ke: Lugha Iliyopendekezwa

source: I agree to the {a_start} Terms of Service {a_end}
sw_ke: Na kubaliana na {a_start} Masharti ya Huduma {a_end}

source: Create My Account &amp; Start Authoring Courses
sw_ke: Tengeneza Akaunti Yangu &amp; Anza Kuandika Kozi

source: Common {studio_name} Questions
sw_ke: Maswali ya {studio_name} Kawaida

source: Who is {studio_name} for?
sw_ke: {studio_name} kwa ajili ya nani?

source: {studio_name} is for anyone that wants to create online courses that leverage the global {platform_name} platform. Our users are often faculty members, teaching assistants and course staff, and members of instructional technology groups.
sw_ke: {studio_name} ni kwa yoyote anaehitaji kubuni kozi inayotawaliwa mtandaoni inayo enua jukwaa {platform_name} la kilimwengu. Watumiaji wetu aghlabu ni wanafanni, wasaidizi wa kufundisha na wafanya kazi wa kozi, na wanachama wa makundi ya kufundisha taaluma.

source: How technically savvy do I need to be to create courses in {studio_name}?
sw_ke: Nahitaji kuwa vipi kitaalam wa savvy niweze kubuni kozi katika {studio_name}?

source: {studio_name} is designed to be easy to use by almost anyone familiar with common web-based authoring environments (Wordpress, Moodle, etc.). No programming knowledge is required, but for some of the more advanced features, a technical background would be helpful. As always, we are here to help, so don't hesitate to dive right in.
sw_ke: {studio_name} imepangwa/chorwa/tengenezwa kuwa rahisi kutumia kwa takriban yoyote mwenye ufahamu wa mazingira ya utungaji kulingana na mtandao wa kawaida (Wordpress, Moodle, etc.). Haihitaji ujuzi wa mpangilio, lakini kwa baadhi ya vipengele vilivyo boreshwa zaidi, usuli wa kitaalamu utakuwa msaada. Kama kawaida, tuko hapa kusaidia, kwa hivyo usisite kupiga mbizi mtandaoni.

source: I've never authored a course online before. Is there help?
sw_ke: Sijawahipo kutunga kozi itawaliwayo mtandaoni kabla. Kuna usaidizi wowote?

source: Absolutely. We have created an online course, edX101, that describes some best practices: from filming video, creating exercises, to the basics of running an online course. Additionally, we're always here to help, just drop us a note.
sw_ke: Kabisa, Tume buni kozi inayotawaliwa mtandaoni, edX101, inayoelezea baadhi ya mazoezi muaffak kabisa: kuanzia upigaji picha wa filamu za video, mazoezi ya kubuni, mpaka misingi ya uendeshaji wa kozi mtandaoni. Kuongezea, kawaida tuko hapa kusaidia, lakufanya ni kutubwagia nukuu/ujumbe.

source: Schedule & Details Settings
sw_ke: Mitegesho ya Ratiba & Utondoti

source: Schedule & Details
sw_ke: Ratiba & Maelezo

source: Basic Information
sw_ke: Taarifa ya Msingi

source: The nuts and bolts of your course
sw_ke: Msingi wa kozi yako

source: This field is disabled: this information cannot be changed.
sw_ke: Sehemu hii imeondolewa: hii taarifa haiwezi kubadilishwa.

source: Course Summary Page
sw_ke: Ukurasa wa Muhtasari wa Kozi

source: (for student enrollment and access)
sw_ke: (kwa uandikishaji wa mwanafunzi na upatikanaji)

source: Enroll in {course_display_name}
sw_ke: Andikisha kwa {course_display_name}

source: The course "{course_display_name}", provided by {platform_name}, is open for enrollment. Please navigate to this course at {link_for_about_page} to enroll.
sw_ke: Kozi "{course_display_name}", imetolewa na {platform_name}, iko wazi kwa usajili. Tafadhali marisi kwa kozi hii na {link_for_about_page} kujisajili.

source: Send a note to students via email
sw_ke: Tuma nukuu kwa wanafunzi kupitia barua pepe

source: Invite your students
sw_ke: Karibisha wanafunzi wako

source: Promoting Your Course with {platform_name}
sw_ke: Kuza Kozi Yako na {platform_name}

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
sw_ke: Ukurasa wa muhtasari wa kozi yako hautaonekana mpaka kozi yako iwe imetangazwa. Andaa maudhui kwa ajili ya ukurasa na kuonyesha kabla, fuata maagizo yaliyotolewa na 'Meneja wa Mipango'.

source: Course Credit Requirements
sw_ke: Sifa zinazohitajika katika kozi

source: Steps required to earn course credit
sw_ke: Hatua zinazohitajika kupata alama ya kozi

source: Minimum Grade
sw_ke: Daraja ya Chini

source: Successful Proctored Exam
sw_ke: Mtihani wa Uleaji Umefaulu

source: Proctored Exam {number}
sw_ke: Mtihani wa Uleaji {number}

source: ID Verification
sw_ke: Uthibitisho wa Kitambulisho

source: In-Course Reverification {number}
sw_ke: Uthibitisho upya Uko Njiani {number}

source: Course Schedule
sw_ke: Ratiba ya Kozi

source: Dates that control when your course can be viewed
sw_ke: Tarehe zinazo ongoza lini kozi yako yaweza kuangaliwa

source: First day the course begins
sw_ke: Siku ya kwanza ya kozi kuanza

source: Course Start Time
sw_ke: Muda wa Kuanza Kozi

source: Last day your course is active
sw_ke: Siku ya mwisho ambayo kozi yako iliwezeshwa

source: Course End Time
sw_ke: Muda wa Mwisho wa Kozi

source: Enrollment Start Date
sw_ke: Tarehe ya Kuanza Usajili

source: First day students can enroll
sw_ke: Siku ya kwanza wanafunzi wanaweza kujisajili

source: Enrollment Start Time
sw_ke: Muda wa Kuanza kwa Usajili

source: Enrollment End Date
sw_ke: Tarehe ya Mwisho ya Usajili

source: Last day students can enroll.
sw_ke: Siku ya mwisho ambayo wanafunzi waweza kusajili.

source: Contact your edX partner manager to update these settings.
sw_ke: Wasiliana na meneja mwenzako wa edX ili kusasisha mitegesho hii.

source: Enrollment End Time
sw_ke: Muda wa Mwisho wa Uandikishaji

source: These Dates Are Not Used When Promoting Your Course
sw_ke: Tarehe Hizi Hazitumiwi Ukikuuza Kozi Yako

source: These dates impact {strong_start}when your courseware can be viewed{strong_end}, but they are {strong_start}not the dates shown on your course summary page{strong_end}. To provide the course start and registration dates as shown on your course summary page, follow the instructions provided by your Program Manager.
sw_ke: Tarehe hizi zinaathiri {strong_start} wakati kozi yako inaweza kutizamwa{strong_end}, lakini zina {strong_start} sio tarehe zilizoonyeshwa kwenye ukurasa wa muhtasari wa kozi{strong_end}. Kutoa tarehe ya mwanzo wa kozi na uandikishaji kama ilivyoonyeshwa kwenye ukurasa wa muhtasari wako wa kozi, fuata maagizo yaliotolewa na Mkurugenzi wako wa Mpango.

source: Course Details
sw_ke: Utondoti wa Kozi

source: Provide useful information about your course
sw_ke: Toa taarifa muhimu kuhusu kozi yako

source: Identify the course language here. This is used to assist users find courses that are taught in a specific language. It is also used to localize the 'From:' field in bulk emails.
sw_ke: Bainisha lugha ya kozi hapa. Hii inatumika kuwasaidia watumiaji kutafuta kozi ambazo zinafundishwa kwa iana fulani ya lugaha. Pia inatumika kubainisha sehemu ya 'From:' kipengele cha barua pepe nyingi.

source: Introducing Your Course
sw_ke: Tambulisha Kozi Yako

source: Information for prospective students
sw_ke: Taarifa za wanafunzi wanaotarajiwa

source: Course Title
sw_ke: Jina la Mada ya Kozi

source: Displayed as title on the course details page. Limit to 50 characters.
sw_ke: Imeonyeshwa kama jina la mada kwenye ukurasa wa maelezo ya kozi. Herufi zisizidi 50.

source: Course Subtitle
sw_ke: Jina la Mada Ndogo ya Kozi

source: Displayed as subtitle on the course details page. Limit to 150 characters.
sw_ke: Onyesha kama jina la mada ndogo ya kozi kwenye ukurasa wa maelezo ya kozi. Herufi zisizidi 150.

source: Course Duration
sw_ke: Muda/Muhula wa Kozi

source: Displayed on the course details page. Limit to 50 characters.
sw_ke: Imeonyeshwa katika ukurasa wa maelezo ya kozi. Herufi zisizidi 50.

source: Course Description
sw_ke: Maelezo ya Kozi

source: Displayed on the course details page. Limit to 1000 characters.
sw_ke: Imeonyeshwa katika ukurasa wa maelezo ya kozi. Herufi zisizidi 1000.

source: Course Short Description
sw_ke: Maelezo Mafupi ya Kozi

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
sw_ke: Inajitokeza kwenye ukurasa wa katalogi ya 'kozi' wakati wanafunzi wanapoandika 'jina la kozi'. Zisizidi herufi ~150.

source: Course Overview
sw_ke: Maelezo ya jumla ya kozi

source: HTML Code Editor
sw_ke: Namba ya Kuhariri HTML

source: Introductions, prerequisites, FAQs that are used on {a_link_start}your course summary page{a_link_end} (formatted in HTML)
sw_ke: Utangulizi, masharti ya awali, FAQs zinatumika kwenye {a_link_start} muhtasari wako wa kozi{a_link_end} (iliyowezeshwa katika muundo wa HTML)

source: Course Card Image
sw_ke: Picha ya Kadi za Kozi

source: You can manage this image along with all of your other {a_link_start}files and uploads{a_link_end}
sw_ke: Unaweza kumudu taswira hii pamoja na faili zako nyingine {a_link_start} na ulizo zipakia{a_link_end}

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
sw_ke: Kozi yako haina taswira kwa sasa. Tafadhali pakia moja (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)

source: Your course image URL
sw_ke: Picha ya kozi yako kwenye URL

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
sw_ke: Tafadhali toa njia halali na jina la picha ya kozi yako (Kumbuka: Muundo wa 'JPEG au PNG' tu ndo umewezeshwa)

source: Upload Course Card Image
sw_ke: 'Pakia' Picha ya Kadi ya Kozi

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 1440px wide by 400px tall)
sw_ke: Kozi yako kwa sasa hivi haina taswira. Tafadhali pakia faili moja ya (mfumo wa JPEG au PNG, na vipimo vya chini vilivyokadiriwa / kisiwa ni 1440px upana kwa 400px urefu)

source: Your banner image URL
sw_ke: URL ya taswira ya bango lako

source: Please provide a valid path and name to your banner image (Note: only JPEG or PNG format supported)
sw_ke: Tafadhali toa njia halali na jina kwenye taswira ya bango lako (Tambua: mifumo inayokubalika ni ya JPEG au PNG)

source: Upload Course Banner Image
sw_ke: Pakia Taswira ya Bango la Kozi

source: Video Thumbnail Image
sw_ke: Taswira ya Video ya Dole gumba

source: Your course currently does not have a video thumbnail image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
sw_ke: Kozi yako kwa sasa hivi haina taswira ya video ya dole gumba. Tafadhali pakia faili moja ya (mfumo wa JPEG au PNG, na vipimo vya chini vilivyokadiriwa/kisiwa ni 375px upana kwa 200px urefu)

source: Your video thumbnail image URL
sw_ke: URL ya taswira ya video ya dole gumba lako

source: Please provide a valid path and name to your video thumbnail image (Note: only JPEG or PNG format supported)
sw_ke: Tafadhali toa njia halali na jina kwa taswira ya video ya dole gumba lako (Tambua: ni mfumo wa JPEG au PNG unaokubalika)

source: Upload Video Thumbnail Image
sw_ke: Pakia Taswira ya Video ya Dole gumba

source: Course Introduction Video
sw_ke: 'Video' ya Utangulizi wa Kozi

source: Delete Current Video
sw_ke: 'Futa' Video Iliyopo

source: your YouTube video's ID
sw_ke: Kitambulisho cha video yako ya YouTube

source: Enter your YouTube video's ID (along with any restriction parameters)
sw_ke: Ingiza/Weka Kitambulisho cha video yako ya YouTube (along with any restriction parameters)

source: Learning Outcomes
sw_ke: Matokeo ya Kujifunza

source: Add the learning outcomes for this course
sw_ke: 'Ongeza' matokeo ya kujifunza ya kozi hii

source: Add Learning Outcome
sw_ke: 'Ongeza' Matokeo ya Kujifunza

source: Add details about the instructors for this course
sw_ke: 'Ongeza' maelezo kuhusu waalimu kwenye 'hii kozi'

source: Add Instructor
sw_ke: Ongeza Mwalimu

source: Expectations of the students taking this course
sw_ke: Matarajio ya 'wanafunzi' wanaochukua 'kozi hii'

source: Hours of Effort per Week
sw_ke: Muda 'Uliojaribu' kwa Wiki

source: Time spent on all course work
sw_ke: Muda uliotumika kwenye kazi yote ya 'kozi'

source: Prerequisite Course
sw_ke: Masharti ya awali ya kozi

source: Course that students must complete before beginning this course
sw_ke: 'Kozi' ambayo wanafunzi wanatakiwa wakamilishe kabla kuanza kozi hii

source: set pre-requisite course
sw_ke: weka masharti ya awali ya kozi

source: Require students to pass an exam before beginning the course.
sw_ke: Wanafunzi 'wanahitaji' kufaulu mtihani kabla kuanza kozi

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
sw_ke: Unaweza sasa kutizama na kutunga kiingilio mtihanini cha kozi yako kutoka kwa {link_start}Muongozo wa Kozi{link_end}.

source: Grade Requirements
sw_ke: Mahitaji ya Daraja

source: The score student must meet in order to successfully complete the entrance exam.
sw_ke: Alama ambazo 'mwanafunzi' lazima azipate ili afanikiwe kuingia kwenye mtihani.

source: Course Pacing
sw_ke: Mwendo wa Kozi

source: Set the pacing for this course
sw_ke: Weka hatua 'kwenye hii kozi'

source: Instructor-paced courses progress at the pace that the course author sets. You can configure release dates for course content and due dates for assignments.
sw_ke: Mwalimu aliweka hatua za maendeleo ya kozi kwa mwendo ambao mtunzi wa kozi huweka. Unaweza kupanga tarehe za kuachilia yaliyomo ya kozi na tarehe za kumalizia kwa mazoezi yaliyo tolewa.
