Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: sw_ke

source: This content group is not in use. Add a content group to any unit from the {linkStart}Course Outline{linkEnd}.
sw_ke: Kundi la yaliyomo haya halitumiki. Ongeza kundi la yaliyomo kwa kitengo chochote kutoka kwa {linkStart} Udokezi wa fanni{linkEnd}

source: Course Outline
sw_ke: Muhtasari wa Fanni

source: Content Group Name
sw_ke: Jina la Kundi la Yaliyomo

source: Content Group ID
sw_ke: ID ya Yaliyomo kwa Kundi

source: This is the name of the group
sw_ke: Hili ndilo jina la kundi

source: This content group is used in one or more units.
sw_ke: Kundi hili la yaliyomo linatumika katika kitengo kimoja au zaidi.

source: Instructor Name
sw_ke: Jina la Mwalimu

source: Please add the instructor's name
sw_ke: Tafadhali ongeza jina la mwalimu

source: Instructor Title
sw_ke: Cheo cha Mwalimu

source: Please add the instructor's title
sw_ke: Tafadhali ongezea cheo cha mwalimu

source: Organization
sw_ke: Shirika

source: Organization Name
sw_ke: JIna la Shirika

source: Please add the institute where the instructor is associated
sw_ke: Tafadhali ongeza taasisi ambao mwalimu anahusiana nayo

source: Biography
sw_ke: Wasifu

source: Instructor Biography
sw_ke: Wasifu wa Mwalimu

source: Please add the instructor's biography
sw_ke: Tafadhali ongezea wasifu wa mwalimu

source: Photo
sw_ke: Picha

source: Instructor Photo
sw_ke: Picha ya Mwalimu

source: Instructor Photo URL
sw_ke: Picha ya URL ya Mwalimu

source: Please add a photo of the instructor (Note: only JPEG or PNG format supported)
sw_ke: Tafadhali ongeza picha ya mwalimu (Note: only JPEG or PNG format supported)

source: Upload Photo
sw_ke: Pakia Picha

source: Prerequisite: %(prereq_display_name)s
sw_ke: Sharti:%(prereq_display_name)s

source: Contains staff only content
sw_ke: Ina maudhui ya wafanyakazi tu/pekee

source: Unpublished changes to live content
sw_ke: Mabadiliko yasiochapishwa kwa yaliyomo hai

source: Unpublished units will not be released
sw_ke: Vitengo visivyo chapishwa havitatolewa/kuachiliwa

source: Unpublished changes to content that will release in the future
sw_ke: Mabadiliko yasiochapishwa kwa yaliyomo abayo yataachilia mbeleni

source: Ungraded
sw_ke: Yasiopewa daraja

source: Practice proctored Exam
sw_ke: Fanya zoezi la mtihani wa mlezi

source: Proctored Exam
sw_ke: Mtihani wa Mlezi

source: Timed Exam
sw_ke: Mtihani Uliopewa Muda Maalum

source: Collapse/Expand this %(xblock_type)s
sw_ke: Angusha/Panua hii %(xblock_type)s

source: Display Name
sw_ke: Onyesha Jina

source: Configure
sw_ke: Mpangilio wa vipengele mbali mbali pamoja kutekeleza wajibu mmoja

source: Drag to reorder
sw_ke: Buruta/Kokota upange tena

source: Release Status:
sw_ke: Toa Hali Ilivyo

source: Released:
sw_ke: Iliyotolewa

source: Scheduled:
sw_ke: Iliyopangwa kufanyika

source: Graded as:
sw_ke: Pewa daraja kama:

source: Due:
sw_ke: Kutokana:

source: Exam will remain hidden after due date
sw_ke: Mtihani utabaki umefichwa baada ya tarehe ya mwisho

source: Exam will be visible after due date
sw_ke: Mtihani utaonekana baada ya tarehe ya mwisho

source: You haven't added any content to this course yet.
sw_ke: Bado hauja ongoza yaliyomo yoyote kwa fanni hii.

source: Click to add a new %(xblock_type)s
sw_ke: Bonyeza uongeze mpya %(xblock_type)s

source: Learning Outcome
sw_ke: Matokeo ya Kujifunza

source: Add a learning outcome here
sw_ke: Ongeza matokeo ya kujifunza hapa

source: Assignment Type Name
sw_ke: Jina la Aina ya Zoezi

source: The general category for this type of assignment, for example, Homework or Midterm Exam. This name is visible to learners.
sw_ke: Tabaka la jumuia la aina hii ya zoezi, kwa mfano, Kazi ya kufanyia nyumbani au Mtihani wa katikati ya muhula. Jina hili linoenekana kwa mwanagenzi

source: Abbreviation
sw_ke: Kifupisho

source: This short name for the assignment type (for example, HW or Midterm) appears next to assignments on a learner's Progress page.
sw_ke: Jina hili fupi la aina ya zoezi (for example, HW or Midterm) linatokeza baada ya mazoezi katika ukurasa wa maendeleo ya mwnagenzi.

source: Weight of Total Grade
sw_ke: Uzani wa Jumla ya daraja

source: The weight of all assignments of this type as a percentage of the total grade, for example, 40. Do not include the percent symbol.
sw_ke: Uzani wa mazoezi yote ya aina hii kama kwa asilimia ya jumla ya daraja, kwa mfano, 40. Usiijumuishe alama ya asilimia.

source: Total Number
sw_ke: Jumla ya Nambari

source: The number of subsections in the course that contain problems of this assignment type.
sw_ke: Idadi ya vifungu vidogo katika fanni ambayo ina matatizo kwa aina hii ya mazoezi.

source: Number of Droppable
sw_ke: Idadi ya zinazoangushika

source: The number of assignments of this type that will be dropped. The lowest scoring assignments are dropped first.
sw_ke: Idadi ya aina hii ya mazoezi ambayo yataangushwa. Mazoezi yenye alama za chini kabisa yataangushwa mwanzo.

source: Course Handouts
sw_ke: Chapa za masomo ya Fanni

source: You have no handouts defined
sw_ke: Hauna nakala zozote zilizo fafanuliwa

source: There is invalid code in your content. Please check to make sure it is valid HTML.
sw_ke: Kuna kificho kisicho halali katika yaliyomo yako. Tafadhali tizama kuhakikisha ni HTML halali.

source: Send push notification to mobile apps
sw_ke: Tuma ilani ya kusukuma kwa simu za mkononi

source: Send notification to mobile apps
sw_ke: Tuma ilani kwa simu za mkononi

source: Post
sw_ke: Tuma makala kwa mtandao

source: Due Date:
sw_ke: Tarehe inayo Tarajiwa:

source: Due Time in UTC:
sw_ke: Wkati unao Tarajiwa kwenye UTC:

source: Clear Grading Due Date
sw_ke: Tarehe inayo Tarajiwa Kupeana Daraja Wazi

source: Chapter Name
sw_ke: Jina la Sura

source: provide the title/name of the chapter that will be used in navigating
sw_ke: Peana kichwa/jina la sura itakayotumika katika urambazaji

source: Chapter Asset
sw_ke: Mali ya Sura

source: upload a PDF file or provide the path to a Studio asset file
sw_ke: Pakia faili ya PDF au peana njia kwa faili ya mali ya Studio

source: Upload PDF
sw_ke: Pakia PDF

source: delete chapter
sw_ke: futa sura

source: Textbook information
sw_ke: Maelezo ya Kitabu cha kiada

source: Textbook Name
sw_ke: Jina la Kitabu cha kiada

source: Introduction to Cookie Baking
sw_ke: Uanzilishi wa Cookie Banking

source: provide the title/name of the text book as you would like your students to see it
sw_ke: Toa kichwa/jina la kitabu cha kiada vile ungependa wanafunzi wako wakione

source: Chapter information
sw_ke: Maelezo ya Sura

source: Add a Chapter
sw_ke: Ongeza sura

source: Grading
sw_ke: Kuchagua kwa Ubora

source: Grade as:
sw_ke: Pewa daraja kama:

source: Cannot delete when in use by an experiment
sw_ke: Haiwezi kufuta ikiwa inatumika kwa majaribio

source: This Group Configuration is used in:
sw_ke: Mpangilio wa Kundi Hili Unatumika katika:

source: This Group Configuration is not in use. Start by adding a content experiment to any Unit via the {linkStart}Course Outline{linkEnd}.
sw_ke: Mpangilio wa Kundi Hili hautumiki. Anza kwa kuongeza jaribio la yaliyomo kwa kitengo chochote kupitia {linkStart}Course Outline{linkEnd}.

source: Group Configuration information
sw_ke: Habari za Mpangilio wa Kundi

source: Group Configuration Name
sw_ke: Jina la Mpangilio wa Kundi

source: Group Configuration ID
sw_ke: Kitambulisho cha Mpangilio wa Kundi

source: This is the Name of the Group Configuration
sw_ke: Hili ndio Jina la Mpangilio wa Kundi

source: Name or short description of the configuration
sw_ke: Jina au maelezo mafupi ya mpangilio

source: This is the Description of the Group Configuration
sw_ke: Haya ndio maelezo ya Mpangilio wa Kundi

source: Optional long description
sw_ke: Chaguo la maelezo marefu

source: Group information
sw_ke: Maelezo ya kundi

source: Groups
sw_ke: Makundi

source: Name of the groups that students will be assigned to, for example, Control, Video, Problems. You must have two or more groups.
sw_ke: Taja makundi wanafunzi watakayo kuwa ndani, kwa mfano, Matatizo ya Milki ya uendeshaji mambo, Video. Lazima uwe na makundi mawili au zaidi.

source: Add another group
sw_ke: Ongeza kundi jingine

source: This configuration is currently used in content experiments. If you make changes to the groups, you may need to edit those experiments.
sw_ke: Mpangilio huu ndio unatumika kwa sasa katika jaribio la yaliyomo. Ukifanya mabadiliko kwa makundi, utahitaji kuhariri majaribio hayo.

source: delete group
sw_ke: Futa kundi

source: License Type
sw_ke: Aina ya kibali/leseni

source: Learn more about {license_name}
sw_ke: Jifunze Mengi kuhusu {license_name}

source: Options for {license_name}
sw_ke: Chaguo la {license_name}

source: The following options are available for the {license_name} license.
sw_ke: Chaguo zinazo fuata zinapatikana kwa {license_name} kibali / leseni.

source: License Display
sw_ke: Onyesha kibali / leseni

source: The following message will be displayed at the bottom of the courseware pages within your course:
sw_ke: Ujumbe ufuatao utaonyeshwa chini ya kurasa wa courseware katika fanni yako.

source: Creative Commons licensed content, with terms as follow:
sw_ke: Ubuniji wa kibali / leseni cha yaliyomo, kwa masharti kama yafuatayo:

source: Some Rights Reserved
sw_ke: Baadhi ya haki zimemilikiwa

source: New %(item_type)s
sw_ke: Mpya %(item_type)s

source: Add
sw_ke: Ongeza / Jumlisha

source: Clear Value
sw_ke: Thamani ya wazi / Ondosha Tathmini

source: Download
sw_ke: Shukisha

source: You haven't added any textbooks to this course yet.
sw_ke: Bado hauja ongeza vitabu vyovyote vya kiada katika fanni hii.

source: Add your first textbook
sw_ke: Ongeza kitabu chako cha kwanza cha kiada

source: Previous Uploads
sw_ke: Upakiaji Uliopita

source: Download available encodings (.csv)
sw_ke: Shukisha usimbaji zipatikanazo (csv)

source: Duration
sw_ke: Muda

source: Never published
sw_ke: Hakichapishwi

source: Last published %(last_published_date)s by %(publish_username)s
sw_ke: Mwisho kuchapishwa %(last_published_date)s by %(publish_username)s

source: message
sw_ke: Ujumbe

source: Previously published
sw_ke: KIlichapishwa mbeleni

source: Draft (Never published)
sw_ke: Utungo (Never published)

source: Visible to Staff Only
sw_ke: Inaonekana na wafanyikazi pekee

source: Published and Live
sw_ke: Kimechapishwa na kiko Hai

source: Published (not yet released)
sw_ke: Kimechapishwa (not yet released)

source: Draft (Unpublished changes)
sw_ke: Utungo (Unpublished changes)

source: Release:
sw_ke: Achilia

source: Publishing Status
sw_ke: Hali ilivyo ya Uchapishaji

source: Draft saved on %(last_saved_date)s by %(edit_username)s
sw_ke: Utungo umedhibitiwa %(last_saved_date)s na %(edit_username)s

source: with %(release_date_from)s
sw_ke: Na %(release_date_from)s

source: Is Visible To:
sw_ke: Inae stahili kuona:

source: Will Be Visible To:
sw_ke: Ina stahili kuonekana na:

source: Staff Only
sw_ke: Mfanyikazi pekee

source: with %(section_or_subsection)s
sw_ke: Na %(section_or_subsection)s

source: Staff and Students
sw_ke: Mfanyikazi na Wanafunzi

source: Some content in this unit is visible only to particular content groups
sw_ke: Baadhi ya yaliyomo katika kitengo hiki yanaonekana kwa makundi yaliyomo mateule.

source: Hide from students
sw_ke: Ficha wasione wanafunzi

source: Release Date and Time
sw_ke: Toa / Achilia / Taja / Sema Tarehe na Wakati

source: Release Date:
sw_ke: Achilia / Taja tarehe:

source: Release Time in UTC:
sw_ke: Achilia / Taja / Sema Wakati kwa UTC:

source: Clear Release Date/Time
sw_ke: Futilia Wakati/Tarehe iliojulishwa

source: View Live
sw_ke: Tazama tukio kwa muda Litendekapo

source: Signatory
sw_ke: Mueka sahihi

source: Signature Image
sw_ke: Taswira ya Sahihi

source: Certificate Signatory Configuration
sw_ke: Ujumuishaji wa Msahihishaji wa Cheti

source: Name
sw_ke: Jina

source: Name of the signatory
sw_ke: Jina la mueka sahihi

source: The name of this signatory as it should appear on certificates.
sw_ke: Jina la huyu mueka sahihi litakavyo tokeza kwenye vyeti

source: Title
sw_ke: Kichwa / Wadhifa

source: Title of the signatory
sw_ke: Wadhifa wa mueka sahihi

source: Titles more than 100 characters may prevent students from printing their certificate on a single page.
sw_ke: Nyadhifa zilizo na zaidi ya herufi 100 zinaweza kuzuia wanafunzi kuchapisha vyeti vyao kwenye ukurasa mmoja

source: Organization
sw_ke: Shirika / Ushirika

source: Organization of the signatory
sw_ke: Shirika la mueka sahihi

source: The organization that this signatory belongs to, as it should appear on certificates.
sw_ke: Shirika analotoka / analofanya kazi mueka sahihi huyu litakavyo tokea kwenye vyeti.

source: Path to Signature Image
sw_ke: Njia kufikia Taswira ya Sahihi

source: Image must be in PNG format
sw_ke: Taswira lazima iwe katika mfumo wa PNG

source: Upload Signature Image
sw_ke: Pakia Taswira ya Sahihi

source: Student Visibility
sw_ke: Uonaji wa Mwanafunzi / Nadhari ya Mwanafunzi

source: If the unit was previously published and released to students, any changes you made to the unit when it was hidden will now be visible to students.
sw_ke: Kama kitengo kilichapishwa mbeleni na kutolewa kwa wanafunzi, mabadiliko yoyote uliofanya kwenye kitengo hicho yatakuwa dhahiri kwa wanafunzi.

source: If you make this %(xblockType)s visible to students, students will be able to see its content after the release date has passed and you have published the unit.
sw_ke: Ukifanya hivi %(xblockType)s dhahiri kwa wanafunzi, wanafunzi wataweza kuona yaliyomo baada ya tarehe ya kutolea imepita na umechapisha kitengo.

source: Any subsections or units that are explicitly hidden from students will remain hidden after you clear this option for the section.
sw_ke: Vifungu vidogo vyote au vitengo vilivyofichwa ndani zaidi kutoka kwa wanafunzi vitabaki vimefichika baada ya kuondoa chaguo hili kwa kifungu hiki

source: Any units that are explicitly hidden from students will remain hidden after you clear this option for the subsection.
sw_ke: Vitengo vyovyote vilivyo fichika kwa undani zaidi kutoka kwa wanafunzi vitabaki vimefichika baada ya kuondoa chaguo hili kwa kifungu kidogo hiki.

source: Current Role:
sw_ke: Wadhifa wako Hivi sasa:

source: You!
sw_ke: Wewe

source: send an email message to {email}
sw_ke: tuma ujumbe wa barua pepe kwa {email}

source: Promote another member to Admin to remove your admin rights
sw_ke: Kumpandisha cheo mwanachama mwengine kuwa Kiranja ni kuondoa haki za Kiranja

source: Add {role} Access
sw_ke: Ongeza {role} Upatikanaji

source: Remove {role} Access
sw_ke: Ondoa {role} Upatikanaji

source: Delete the user, {username}
sw_ke: Futa mtumiaji, {username}

source: Set as a Special Exam
sw_ke: Tunga kama Mtihani Maalum

source: Exam Types
sw_ke: Aina za Mitihani

source: Timed
sw_ke: Iliopewa muda / wakati maalum

source: Use a timed exam to limit the time learners can spend on problems in this subsection. Learners must submit answers before the time expires. You can allow additional time for individual learners through the Instructor Dashboard.
sw_ke: Tumia mtihani ulio na wakati maalum uweze kubania muda wanagenzi wanaweza kuchukuwa kutatua tatizo kwenye kifungu kidogo hiki. Wanagenzi lazima wafikishe majibu kabla wakati kumalizika. Unaweza kukubali muda wa ziada kwa wanagenzi binafsi kupitia Instructor Dashboard.

source: Proctored
sw_ke: Ulilea Wanafunzi

source: Proctored exams are timed and they record video of each learner taking the exam. The videos are then reviewed to ensure that learners follow all examination rules.
sw_ke: Mitihani ya ulezi wa wanafunzi inawekewa wakati na kunachukuliwa video ya kila mwanafunzi akifanya mtihani. Kisha video hizi zinachezeshwa kuipitia upya na kuhakikisha wanafunzi wamefuata kanuni zote za mtihani.

source: Practice Proctored
sw_ke: Zoezi la Ulezi wa Wanafunzi

source: Use a practice proctored exam to introduce learners to the proctoring tools and processes. Results of a practice exam do not affect a learner's grade.
sw_ke: Tumia zoezi la mtihani wa ulezi kuwaanzishia wanafunzi kwa vifaa vya uleaji na namna zake. Majibu ya zoezi la mtihani hali athiri daraja ya mwanafunzi.

source: Time Allotted (HH:MM):
sw_ke: Wakati Uliotengewa (HH:MM):

source: Select a time allotment for the exam. If it is over 24 hours, type in the amount of time. You can grant individual learners extra time to complete the exam through the Instructor Dashboard.
sw_ke: Chagua wakati wakutenga kwa mtihani. Kama ni zaidi ya masaa 24, andika/chapisha kwenye kompyuta muda wa wakati. Unaweza kuruhusu wanafunzi binafsi muda ziada kumaliza mtihani kupitia Dashibodi ya Mwalimu.

source: Review Rules
sw_ke: Mtizamo kabla wa Sheria / Kanuni

source: Specify any additional rules or rule exceptions that the proctoring review team should enforce when reviewing the videos. For example, you could specify that calculators are allowed.
sw_ke: Taja kanuni za nyongeza au kanuni maalum ambazo kikosi cha kupitia upya uleaji wanastahili watilie mkazo wakichezesha video kwa upitiaji upya. Kwa mfano, unaweza kutaja kuwa vikokotoo vinaruhusiwa.

source: Hide Exam After Due Date
sw_ke: Ficha Mtihani Baada ya Tarehe ya Kuwadia

source: By default, submitted exams are available for review after the due date has passed. Select this option to keep exams hidden after that date.
sw_ke: Kwa kukosea, mitihani iliofikishwa ina patikana kwa upitiaji upya baada ya tarehe ya kuwadia imepita. Chagua hiari hii kuweka mitihani mafichoni baada ya tarehe ya kuwadia.

source: File upload succeeded
sw_ke: Upakiaji wa faili ulifaulu

source: Please check the following validation feedbacks and reflect them in your course settings:
sw_ke: Tafadhali tizama majibu ya uhalalishaji yafuatayo na ulinganishie katika mikakati ya fanni yako:

source: Verification Checkpoint
sw_ke: Kituo cha Uhakikishaji

source: Must complete verification checkpoint
sw_ke: Lazima ukamilishe kituo cha uhakikishaji

source: Verification checkpoint to be completed
sw_ke: Kituo cha Uhakikishaji kikamilike / shwe

source: Learners who require verification must pass the selected checkpoint to see the content in this unit. Learners who do not require verification see this content by default.
sw_ke: Wanagenzi wanaohitaji uhakikishaji lazima wapitie vituo vilivyo chaguliwa kuona yaliyomo katika kitengo hiki. Wanagenzi wasiohitaji uhakikishaji wanaona yaliyomo haya kwa makosa.

source: Edit the name
sw_ke: Kagua jina

source: formLabel
sw_ke: Chapa ya fomu

source: Add URLs for additional versions
sw_ke: Ongeza URLs kwa matoleo mengine ya ziada

source: To be sure all students can access the video, we recommend providing both an .mp4 and a .webm version of your video. Click below to add a URL for another version. These URLs cannot be YouTube URLs. The first listed video that's compatible with the student's computer will play.
sw_ke: Kuwa na hakika wanafunzi wote wanaipata video hii, tunapendelea kutoa zote mp4 na webm kwa matoleo ya video yako. Bonyeza chini uongeze URL kwa toleo jingine. URLs hizi haziwezi kuwa URLs za YouTube.Video itakayo orodheshwa kwanza kama ina wiyana na kompyuta ya mwanafunzi itachezeshwa.

source: Default Timed Transcript
sw_ke: Nakala za hitlafu ya muda maalum

source: Timed Transcript Conflict
sw_ke: Mchanganyiko wa nakala zilizopewa wakati maalum

source: The timed transcript for the first video file does not appear to be the same as the timed transcript for the second video file.
sw_ke: Wakati ulionukuliwa wa faili ya video ya kwanza hatokezi kuwa sawa na wakati ulionukuliwa wa faili ya video ya pili.

source: Which timed transcript would you like to use?
sw_ke: Ungependa kutumia nakala ya wakati upi?

source: Error.
sw_ke: Hitlafu

source: Timed Transcript from %(filename)s
sw_ke: Nakala za nyakati kutoka %(filename)s

source: Timed Transcript Found
sw_ke: Nakala ya Wakati Imepatikana

source: EdX has a timed transcript for this video. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript. If you want to replace this transcript, upload a new .srt transcript file.
sw_ke: EdX ina nakala ya wakati ya video hii. Ukihitaji kukagua nakala hii, unaweza kushukisha, kagua na upakie tena nakala itumikayo sasa. kama wahitaji kubadilisha nakala hii, pakia faili mpya ya nakala ya .srt.

source: Upload New Transcript
sw_ke: Pakia Nakala Mpya ya Wakati

source: Upload New .srt Transcript
sw_ke: Pakia .srt Nakala Mpya

source: Download Transcript for Editing
sw_ke: Shukisha Nakala kwa Ukaguzi

source: No EdX Timed Transcript
sw_ke: Hakuna Nakala ya Wakati ya EdX

source: EdX doesn't have a timed transcript for this video in Studio, but we found a transcript on YouTube. You can import the YouTube transcript or upload your own .srt transcript file.
sw_ke: EdX haina nakala ya wakati kwa video hii katika studio, lakini tulipata nakala ya YouTube. Unaweza kupokea nakala ya YouTube au pakia faili yanakala ya .srt yako mwenyewe.

source: Import YouTube Transcript
sw_ke: Ingiza / Pokea Nakala ya YouTube

source: No Timed Transcript
sw_ke: Hakuna Nakala ya Wakati

source: EdX doesn\'t have a timed transcript for this video. Please upload an .srt file.
sw_ke: EdX haina nakala ya wakati ya video hii. Tafadhali pakia faili ya .srt

source: The timed transcript for this video on edX is out of date, but YouTube has a current timed transcript for this video.
sw_ke: Nakala ya wakati ya video hii katika edX imepitwa na wakati, lakini YouTube ina nakala ya wakati ya sasa ya video hii.

source: Do you want to replace the edX transcript with the YouTube transcript?
sw_ke: Unapenda kubadilisha nakala ya edX kwa nakala ya YouTube?

source: Yes, replace the edX transcript with the YouTube transcript
sw_ke: Ndio, badilisha nakala ya edX kwa nakala ya YouTube

source: Timed Transcript Uploaded Successfully
sw_ke: Upakiaji wa Nakala ya Wakati umefaulu / fanikiwa

source: EdX has a timed transcript for this video. If you want to replace this transcript, upload a new .srt transcript file. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript.
sw_ke: EdX ina nakala ya wakati ya video hii. Ukihitaji kubadilisha nakala hii, pakia faili mpya ya nakala ya .srt. Ukihitaji kukagua nakala hii, unaweza kushukisha, ukague, na upakie tena nakala iliopo.

source: Confirm Timed Transcript
sw_ke: Hakikisha Nakala ya Wakati

source: You changed a video URL, but did not change the timed transcript file. Do you want to use the current timed transcript or upload a new .srt transcript file?
sw_ke: Ulibadilisha URL ya video, lakini hukubadilisha faili ya nakala ya wakati. Je, unahitaji kutumia nakala ya wakati ya sasa au utapakia faili mpya ya nakala ya .srt?

source: Use Current Transcript
sw_ke: Tumia Nakala ya Sasa
