Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: The course mode for this badge image. For example, "verified" or "honor".
sw_ke: Mtindo wa kozi kwa taswira ya beji hii. Kwa mfano, "thibitishwa" au "heshima".

source: Badge images must be square PNG files. The file size should be under 250KB.
sw_ke: Taswira za beji lazima ziwe skwea kwa faili za PNG. Kipimo cha faili kinastahili kiwe chini ya KB250.

source: Set this value to True if you want this image to be the default image for any course modes that do not have a specified badge image. You can have only one default image.
sw_ke: Weka tathmini hii iwe Kweli kama unataka taswira hii iwe ya taswira kosa kwa mtindo wowote wa kozi ambao hauna taswira maalum ya beji. Unaweza kuwa na taswira kosa moja pekee.

source: There can be only one default image.
sw_ke: Kunaweza kuwa na taswira kosa moja pekee.

source: Please check the syntax of your entry.
sw_ke: Tafadhali tizama syntax ya uingizaji wako.

source: Powered by Open edX
sw_ke: Kinatumia edX Wazi

source: {platform_name} for Business
sw_ke: {platform_name} kwa ajili ya Biashara

source: Blog
sw_ke: Blogi

source: News
sw_ke: Habari

source: Help Center
sw_ke: Kituo cha Usaidizi

source: Contact
sw_ke: Mawasiliano

source: Careers
sw_ke: Kazi ujuzi maalum

source: Donate
sw_ke: Changia

source: Terms of Service & Honor Code
sw_ke: Masharti ya Huduma & Kificho cha Heshima

source: Privacy Policy
sw_ke: Kanuni za uBinafsi

source: Accessibility Policy
sw_ke: Ufikiaji wa Kanuni

source: Sitemap
sw_ke: Ramani ya Mahali

source: Media Kit
sw_ke: Chombo cha Idhaa

source: Terms of Service
sw_ke: Masharti ya huduma

source: Download the {platform_name} mobile app from the Apple App Store
sw_ke: Pakua {platform_name} apps za simu kutoka kwa Apple App Store

source: Download the {platform_name} mobile app from Google Play
sw_ke: Pakua {platform_name} app za simu kutoka kwa Google Play

source: "{course_title}" Course Staff
sw_ke: "{course_title}" Walimu wa Kozi

source: CCX Coach
sw_ke: Mkufunzi wa CCX

source: A CCX can only be created on this course through an external service. Contact a course admin to give you access.
sw_ke: CCX inaweza kubuniwa katika kozi hii kupitia huduma ya nje. Wasiliana na mtawala wa kozi akupe ufikiaji.

source: The course is full: the limit is {max_student_enrollments_allowed}
sw_ke: Kozi imejaa: kiwango cha juu ni {max_student_enrollments_allowed}

source: You must be a CCX Coach to access this view.
sw_ke: Lazima uwe Kocha wa CCX kufikia utizamaji huu.

source: You must be the coach for this ccx to access this view
sw_ke: Lazima uwe kocha kwa ccx hii kufikia utizamaji huu

source: You cannot create a CCX from a course using a deprecated id. Please create a rerun of this course in the studio to allow this action.
sw_ke: Huwezi kubuni CCX kutoka kwa kozi ukitumia kitambulisho kilicho na ulalamishi. Tafadhali buni uendeshaji upya wa kozi hii katika studio kuruhusu kitendo hiki.

source: created
sw_ke: imebuniwa

source: regenerated
sw_ke: zalisha upya

source: generated
sw_ke: zalisha

source: All learners
sw_ke: wanafunzi wote

source: For exceptions
sw_ke: Kwa yaliokubalika kinyume cha masharti

source: The full name that will appear on the certificate.
sw_ke: 'Jina' kamili litakalojitokeza kwenye cheti.

source: The template file to use when generating the certificate.
sw_ke: Faili ya kigezo kutumia kuzalishia cheti.

source: The status of the example certificate.
sw_ke: Hali ya cheti mfano.

source: The reason an error occurred during certificate generation.
sw_ke: Sababu hitlafu ilitokea wakati wa kuzalisha cheti.

source: The download URL for the generated certificate.
sw_ke: Ushukishaji wa URL kwa cheti kilicho zalishwa.

source: Name of template.
sw_ke: Jina la kiolezo.

source: Description and/or admin notes.
sw_ke: Maelezo na/au nukuu za mtawala.

source: Django template HTML.
sw_ke: Kigezo cha HTML ya Django.

source: Organization of template.
sw_ke: Utaratibu wa kigezo.

source: The course mode for this template.
sw_ke: Mtindo wa kozi kwa kigezo hiki.

source: On/Off switch.
sw_ke: Kibonyezo cha Wakisha/Zima

source: Description of the asset.
sw_ke: Maelezo ya Rasili mali.

source: Asset file. It could be an image or css file.
sw_ke: Faili ya rasili mali. Inaweza kuwa taswira au faili ya css.

source: Asset's unique slug. We can reference the asset in templates using this value.
sw_ke: Slug ya kipekee ya Rasili mali. Tunaweza kuashiria rasili mali kwa vigezo kutumia tathmini hii.

source: user is not given.
sw_ke: Mtumiaji hajapatiwa.

source: user '{user}' does not exist
sw_ke: mtumiaji '{user}' hapatikani

source: Course id '{course_id}' is not valid
sw_ke: Kitambulisho cha kozi '{course_id}' ni batili

source: The course does not exist against the given key '{course_key}'
sw_ke: Kozi haipo ukilenganisha na funguo iliotolewa '{course_key}'

source: User {username} does not exist
sw_ke: Mtumiaji {user_name} haiptikani

source: {course_key} is not a valid course key
sw_ke: {course_key} ni funguo batili ya kozi

source: The course {course_key} does not exist
sw_ke: Kozi {course_key} haipo

source: User {username} is not enrolled in the course {course_key}
sw_ke: Mtumiaji {user_name} hajasajiliwa katika kozi hii {course_key}

source: An unexpected error occurred while regenerating certificates.
sw_ke: Hitlafu isiotarajiwa imetokea tukizalisha upya vyeti.

source: An {cert_type} certificate demonstrates a high level of achievement in a program of study, and includes verification of the student's identity.
sw_ke: {cert_type} cheti kinaonyesha ufanisi wa hali ya juu katika mpangilio wa masomo, na inajumuisha uthibitishaji utambuaji wa mwanafunzi.

source: This is a valid {platform_name} certificate for {user_name}, who participated in {partner_short_name} {course_number}
sw_ke: Hiki {platform_name} ni cheti halali kwa ajili ya {user_name}, alieshiriki katika {partner_short_name} {course_number}

source: {partner_short_name} {course_number} Certificate | {platform_name}
sw_ke: {partner_short_name} {course_number} Cheti | {platform_name}

source: successfully completed, received a passing grade, and was awarded this {platform_name} {certificate_type} Certificate of Completion in
sw_ke: Ulifaulu kumaliza, kupata daraja ya kufaulu, na alizawadiwa {platform_name} {certificate_type} Cheti hiki cha kumalizia

source: {platform_name} acknowledges achievements through certificates, which are awarded for course activities that {platform_name} students complete.
sw_ke: {platform_name} inatambua mafanikio kupitia vyeti, ambavyo vimezawadiwa kwa harakati za kozi hii ambayo {platform_name} wanafunzi humaliza.

source: All rights reserved
sw_ke: Haki zote zimemilikiwa

source: Invalid Certificate
sw_ke: Cheti batili

source: Terms of Service &amp; Honor Code
sw_ke: Masharti ya Huduma &amp; Kificho cha Heshima

source: Certificate Validation
sw_ke: Uhalalishaji wa Cheti

source: About {platform_name} Accomplishments
sw_ke: Kuhusu {platform_name} Mafanikio

source: Issued On:
sw_ke: Tumika kwenye:

source: Certificate ID Number
sw_ke: Nambari ya Kitambulisho cha Cheti

source: About {platform_name} Certificates
sw_ke: Kuhusu {platform_name} Vyeti

source: How {platform_name} Validates Student Certificates
sw_ke: Vipi {platform_name} Inahalalisha Vyeti vya Wanafunzi

source: Validate this certificate for yourself
sw_ke: Halalisha cheti hiki kwa ko mwenyewe

source: {platform_name} offers interactive online classes and MOOCs.
sw_ke: {platform_name} inatoa uingiliano wa madarasa mtandaoni na MOOCs.

source: About {platform_name}
sw_ke: Kuhusu {platform_name}

source: Learn more about {platform_name}
sw_ke: Jifunze mengi kuhusu {platform_name}

source: Learn with {platform_name}
sw_ke: Jifunze na {platform_name}

source: Work at {platform_name}
sw_ke: Fanya kazi kwa {platform_name}

source: Contact {platform_name}
sw_ke: Wasiliana na {platform_name}

source: {platform_name} acknowledges the following student accomplishment
sw_ke: {platform_name} inatambua mafanikio ya wanafunzi yafuatayo

source: a course of study offered by {partner_short_name}, an online learning initiative of {partner_long_name}.
sw_ke: kozi inayotolewa na {partner_short_name}, utaratibu wa kujifunza kwa mtandao kwa {partner_long_name}.

source: a course of study offered by {partner_short_name}.
sw_ke: kozi inayotolewa na {partner_short_name}.

source: I completed the {course_title} course on {platform_name}.
sw_ke: Nilikamilisha kozi {course_title} kwenye {platform_name}.

source: I completed a course at {platform_name}. Take a look at my certificate.
sw_ke: Nilikamilisha kozi kwenye {platform_name}. Angalia cheti changu.

source: More Information About {user_name}'s Certificate:
sw_ke: Taarifa zaidi kuhusu {user_name}'s Cheti:

source: {fullname}, you earned a certificate!
sw_ke: {full_name}, umejipatia cheti!

source: Congratulations! This page summarizes what you accomplished. Show it off to family, friends, and colleagues in your social and professional networks.
sw_ke: Pongezi! ukurasa huu unatowa muhtasari kwa yale yaliofanikishwa. Ionyeshe kwa familia, marafiki, na wenzako wa kozi kwenye mitandao yako ya jamii na weledi.

source: More about {fullname}'s accomplishment
sw_ke: Mengi kuhusu {full_name}'s mafanikio

source: Username
sw_ke: Jinatumishi

source: Grade
sw_ke: Kiwango cha ubora

source: Percent
sw_ke: Asilimia

source: Opened by this number of students
sw_ke: Ilifunguliwa na idadi hii ya wanafunzi

source: subsections
sw_ke: Vifungu vidogo

source: Count of Students
sw_ke: Idadi ya wanafunzi

source: Percent of Students
sw_ke: Asilimia ya Wanafunzi

source: Score
sw_ke: Alama

source: problems
sw_ke: matatizo

source: {course_id} is not a valid course key.
sw_ke: {course_id} sio funguo halali ya kozi.

source: Course {course_id} does not exist.
sw_ke: Kozi {course_id} haipo.

source: Use the checkout page hosted by the E-Commerce service.
sw_ke: Tumia ukurasa wa utizamaji utizamaji uliomilikiwa na huduma ya E-Commerce.

source: Path to single course checkout page hosted by the E-Commerce service.
sw_ke: Njia kwa ukurasa wa utizamaji wa kozi moja ulimilikiwa na huduma ya E-Commerce.

source: Path to order receipt page.
sw_ke: Njia ya kupangilia ukurasa wa stakabadhi.

source: Automatically approve valid refund requests, without manual processing
sw_ke: Idhinisha maombi halali ya malipo ya pesa kwa kutumia mashine, bila kutumia mkono

source: A refund request has been initiated for {username} ({email}). To process this request, please visit the link(s) below.
sw_ke: Ombi la malipo ya ridhaa limeanzishwa kwa {username} ({email}). Kutayarisha ombi hili, tafadhali tembelea (vi)uunganishi hapo chini.

source: [Refund] User-Requested Refund
sw_ke: [Refund] Mtumiaji - Ameomba Malipo ya ridhaa

source: Receipt
sw_ke: Risiti

source: Payment Failed
sw_ke: Malipo Hayakufaulu

source: There was a problem with this transaction. You have not been charged.
sw_ke: Kulikuwa na tatizo na transaksheni hii. Hujalipishwa.

source: Make sure your information is correct, or try again with a different card or another form of payment.
sw_ke: Hakikisha taarifa yako ni sahihi, au jaribu na kadi tofauti au mfumo mwengine wa malipo.

source: A system error occurred while processing your payment. You have not been charged.
sw_ke: Hitlafu ya mpangilio umetokea tukitayarisha malipo yako. Hujalipishwa.

source: Please wait a few minutes and then try again.
sw_ke: Tafadhali subiri madakika kidogo na kisha jaribu tena.

source: For help, contact {payment_support_link}.
sw_ke: Kwa usaidizi, wasiliana {payment_support_link}.

source: An error occurred while creating your receipt.
sw_ke: Hitlafu imetokea tukibuni risiti yako.

source: If your course does not appear on your dashboard, contact {payment_support_link}.
sw_ke: Kama kozi yako haitokezi kwenye dashibodi yako, wasiliana na {payment_support_link}.

source: This is the wiki for **{organization}**'s _{course_name}_.
sw_ke: Hii ni wiki ya **{organization}**'s_{course_name}_.

source: Course page automatically created.
sw_ke: Ukurasa wa kozi uliobuniwa kiwenyewe.

source: Welcome to the {platform_name} Wiki
sw_ke: Karibu kwa {platform_name} Wiki

source: Visit a course wiki to add an article.
sw_ke: Tembelea jukwaa la kozi kuongeza makala.

source: Course has not started
sw_ke: Kozi haijaanza

source: Course does not start until {}
sw_ke: Kozi haianzi mpaka {}

source: You have unfulfilled milestones
sw_ke: Hujatekeleza mawe ya maili

source: You do not have access to this course
sw_ke: Huna fursa ya kupata kozi hii

source: You do not have access to this course on a mobile device
sw_ke: Huna fursa ya kupata kozi hii kwenye simu ya mkononi

source: {relative} ago - {absolute}
sw_ke: {relative} iliopita - {absolute}

source: in {relative} - {absolute}
sw_ke: katika {relative} - {absolute}

source: Course Starts
sw_ke: Kozi Inaanza

source: Course End
sw_ke: Kumalizika kwa Kozi

source: To earn a certificate, you must complete all requirements before this date.
sw_ke: Kujipatia cheti, lazima umalize mahitaji yote kabla ya tarehe hii.

source: After this date, course content will be archived.
sw_ke: Baada ya tarehe hii, maudhui ya kozi yatapelekwa kwenye hifadhi ya nyaraka.

source: This course is archived, which means you can review course content but it is no longer active.
sw_ke: Kozi hii iko kwenye hifadhi ya nyaraka, ikimaanisha unaweza kutizama yaliyomo ya kozi lakini haitumiki tena.

source: Verification Upgrade Deadline
sw_ke: Uboreshaji wa Mwisho wa Uthibitishaji

source: You are still eligible to upgrade to a Verified Certificate! Pursue it to highlight the knowledge and skills you gain in this course.
sw_ke: Bado una uwezo wa kuboresha Cheti kilichothibitishwa! Ifuatilie uangazie ujuzi na kisomo unacho pata kutoka kwa kozi hii.

source: Upgrade to Verified Certificate
sw_ke: Boresha Kuthibitisha Cheti

source: Learn More
sw_ke: Jifunze Zaidi

source: Retry Verification
sw_ke: Jaribu tena Uthibitishaji

source: Verify My Identity
sw_ke: Thibitisha Kitambulisho Changu

source: Missed Verification Deadline
sw_ke: Ulikosa Mwisho wa Kuthibitisha

source: Unfortunately you missed this course's deadline for a successful verification.
sw_ke: Kwa bahati mbaya hukufanikiwa kufanya uhakiki kabla ya muda wa mwisho wa kozi hii.

source: You must successfully complete verification before this date to qualify for a Verified Certificate.
sw_ke: Lazima ufaulu kukamilisha uthibitisho kabla tarehe hii ustahili kwa Cheti Kilichothibitishwa.

source: There is no user with the username or email address {user_name} enrolled in this course.
sw_ke: Hakuna mtumiaji mwenye jina hili au barua pepe hii {user_name} aliesajiliwa katika kozi hii.

source: This type of component cannot be shown while viewing the course as a specific student.
sw_ke: Aina ya kipengele hiki haiwezi kuoneshwa wakati ambapo unatizama kozi kama mwanafunzi maalum.

source: Syllabus
sw_ke: Muhtasari

source: Progress
sw_ke: Maendeleo

source: Textbooks
sw_ke: Vitabu vya kiada

source: Your enrollment: Audit track
sw_ke: Uandikishwaji wako: Zoezi la ukaguzi

source: You are enrolled in the audit track for this course. The audit track does not include a certificate.
sw_ke: Umeandikishwa kwenye zoezi la ukaguzi wa kozi hii. Zoezi la ukaguzi halihusishi cheti.

source: Your certificate has been invalidated
sw_ke: Cheti chako kimebatilishwa

source: Please contact your course team if you have any questions.
sw_ke: Tafadhali wasiliana na timu ya kozi yako kama una maswali yoyote.

source: Your certificate is available
sw_ke: Cheti chako kinapatikana

source: You can keep working for a higher grade, or request your certificate now.
sw_ke: Unaweza kuendelea kufanya kazi kuchuma daraja ya juu zaidi, au omba cheti chako sasa.

source: We're working on it...
sw_ke: Tuna ishughulikia...

source: We're creating your certificate. You can keep working in your courses and a link to it will appear here and on your Dashboard when it is ready.
sw_ke: Tunatengeneza cheti chako. Unaweza kuendelea kufanya kazi kwenye kozi zako na kiungo-wavuti kitatokeza hapa na kwenye dashibodi yako kikiwa tayari.

source: Certificate unavailable
sw_ke: Cheti hakipatikani

source: You have not received a certificate because you do not have a current {platform_name} verified identity.
sw_ke: Hujapokea cheti kwasababu huna utambulisho wa sasa wa {platform_name} uliohakikiwa.

source: Congratulations, you qualified for a certificate!
sw_ke: Pongezi, umestahili kwa cheti!

source: Invalid location.
sw_ke: Eneo batili.

source: User {username} has never accessed problem {location}
sw_ke: Mtumiaji {username} hajafikia tatizo {location}

source: You must be signed in to {platform_name} to create a certificate.
sw_ke: Lazima uandikishwe katika {platform_name} ili uweze kutengeneza cheti.

source: Course is not valid
sw_ke: Kozi sio halali

source: Your certificate will be available when you pass the course.
sw_ke: Cheti chako kitakuwa tayari ukifaulu kozi.

source: Certificate has already been created.
sw_ke: Cheti tayari kimetengenezwa.

source: Certificate is being created.
sw_ke: Cheti kinatengenezwa.

source: Annual Household Income
sw_ke: Mapato ya Matumizi ya Nyumbani ya Kila Mwaka

source: Tell us about your current financial situation. Why do you need assistance?
sw_ke: Tueleze kuhusu hali yako yaki fedha kwa sasa. Kwanini unahitaji msaada?

source: Tell us about your learning or professional goals. How will a Verified Certificate in this course help you achieve these goals?
sw_ke: Tueleze kuhusu mafunzo yako au malengo ya uweledi. Vipi Cheti Kilichothibitishwa katika kozi hii kitakusaidia kufikia malengo haya?

source: Tell us about your plans for this course. What steps will you take to help you complete the course work and receive a certificate?
sw_ke: Tueleze kuhusu mipango yako kwa kozi hii. Hatua gani utachukua zikusaidie kukamilisha mazoezi ya kozi na upokee cheti?

source: Use between 250 and 500 words or so in your response.
sw_ke: Tumia baina ya maneno 250 na 500 au kama hivyo katika majibui yako.

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
sw_ke: Chagua kozi ambayo unahitaji kujipatia cheti kilichothibitishwa. Kama kozi haitokezi kwenye orodha, hakikisha kuwa umejisajili kwenye mkokoto wa kukagua kozi.

source: Specify your annual household income in US Dollars.
sw_ke: Taja mapato yako ya matumizi ya nyumbni ya kila mwaka kwa Dola za marekani.

source: I allow edX to use the information provided in this application (except for financial information) for edX marketing purposes.
sw_ke: Naruhusu edX kutumia taarifa zilizotolewa katika utumiaji huu (except for financial information) kwa kusudio la elimu ya soko kwa edX.

source: Path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_DIR
sw_ke: Mjia {0} haipo, tafadhali ibuni, au panga njia nyengine ikiwa na GIT_REPO_DIR

source: Non usable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
sw_ke: Git url iliyotolewa isiotumika. Kutarajia kitu kama: git@github.com:mitocw/edx4edx_lite.git

source: Unable to get git log
sw_ke: Haiwezi kupata logi ya git

source: git clone or pull failed!
sw_ke: mvuto haukufaulu au kloni ya git

source: Unable to run import command.
sw_ke: Haiwezi kuendesha amri ya upokeaji kutoka ng'ambo.

source: The underlying module store does not support import.
sw_ke: Ghala ya sehemu ya chini haisaidii upokeaji kutoka nje.

source: The specified remote branch is not available.
sw_ke: Tawi la mbali lililotajwa halipatikani.

source: Unable to switch to specified branch. Please check your branch name.
sw_ke: Haiwezi kubadilishana kwa tawi lillilotajwa. Tafadhali angalia jina la tawi lako.

source: Import the specified git repository and optional branch into the modulestore and optionally specified directory.
sw_ke: Ingiza umiliki wa git uliyotajwa na tawi la hiari kwenye ghala ya moduli na uongozi wa hiari uliyotajwa.

source: Failed in authenticating {username}, error {error}
sw_ke: Haikufaulu katika kuhakikisha {username}, hitlafu {error}

source: Failed in authenticating {username}
sw_ke: Haikufaulu katika kuhakikisha {username}

source: fixed password
sw_ke: nywila iliorekebishwa/nywila iliowekwa kudumu

source: All ok!
sw_ke: Yote sawa!

source: Must provide username
sw_ke: Lazima utoe jinatumishi

source: Must provide full name
sw_ke: Lazima utoe jina kamili

source: Email address must end in {domain}
sw_ke: Anwani ya barua pepe lazima imalizike na {domain}

source: Failed - email {email_addr} already exists as {external_id}
sw_ke: Haikufaulu - barua pepe {email_addr} tayari ipo kama {external_id}

source: Password must be supplied if not using certificates
sw_ke: Nywila lazima isambazwe kama haitumii vyeti

source: email address required (not username)
sw_ke: anwani ya barua pepe inahitajika (not username)

source: Oops, failed to create user {user}, {error}
sw_ke: Oops, haikufaulu kubuni mtumiaji {user}, {error}

source: User {user} created successfully!
sw_ke: Mtumiaji {user} alifaulu kubuni!

source: Cannot find user with email address {email_addr}
sw_ke: Hawezi kupata mtumiaji kwa anwani ya barua pepe hii {email_addr}

source: Cannot find user with username {username} - {error}
sw_ke: Haiwezi kupata mtumiaji kwa jinatumishi hili {username} - {error}

source: Deleted user {username}
sw_ke: Mtumiaji aliefutwa {username}

source: Statistic
sw_ke: Tarakimu

source: Value
sw_ke: Thamani

source: Site statistics
sw_ke: Unyesha tarakimu

source: Total number of users
sw_ke: Idadi ya watumiaji

source: Courses loaded in the modulestore
sw_ke: Kozi zilizo pakiwa kwenye hazina ya moduli

source: username
sw_ke: jina la mtumiaji

source: email
sw_ke: barua pepe

source: Repair Results
sw_ke: Karabati majibu

source: Create User Results
sw_ke: Buni Matokeo ya Mtumiaji

source: Delete User Results
sw_ke: Futa majibu ya watumiaji

source: The git repo location should end with '.git', and be a valid url
sw_ke: Eneo la git repo linastahili kumalizia na '.git', na iwe url halali

source: Added Course
sw_ke: Kozi iliyoongezwa

source: Course Name
sw_ke: Jina la Kozi

source: Directory/ID
sw_ke: Muongozo/kitambulisho

source: Git Commit
sw_ke: Jitolea kwa Git

source: Last Change
sw_ke: Mageuzi ya Mwisho

source: Last Editor
sw_ke: Mhariri wa Mwisho

source: Information about all courses
sw_ke: Taarifa kuhusu kozi zote

source: Error - cannot get course with ID {0}<br/><pre>{1}</pre>
sw_ke: Hitilafu - haiwezi kupata kozi kwa Kitambulisho {0}<br/><pre>{1}</pre>

source: Deleted
sw_ke: Ilifutwa

source: course_id
sw_ke: kitambulisho_kozi

source: # enrolled
sw_ke: # sajiliwa

source: # staff
sw_ke: # mfanyakazi

source: instructors
sw_ke: Waalimu

source: Enrollment information for all courses
sw_ke: Taarifa ya Usajili kwa kozi zote

source: role
sw_ke: jukumu

source: full_name
sw_ke: jina_kamili

source: Title can't be empty
sw_ke: Kichwa hakiwezi kuachwa wazi

source: Body can't be empty
sw_ke: Mwili hauwezi kuachwa mtupu

source: Topic doesn't exist
sw_ke: Mada haipo

source: Comment level too deep
sw_ke: Kina cha maoni ni kirefu sana

source: Error uploading file. Please contact the site administrator. Thank you.
sw_ke: Hitlafu ya kupakia faili. Tafadhali wasiliana na mtawala wa mtandao. Asante.

source: Good
sw_ke: Vizuri

source: EdxNotes Service is unavailable. Please try again in a few minutes.
sw_ke: Huduma ya EdxNotes haipo. Tafadhali jaribu tena baada ya dakika chache.

source: Invalid JSON response received from notes api.
sw_ke: Majibu ya JSON ni batili kutoka kwa nukuu za api.

source: Incorrect data received from notes api.
sw_ke: Takwimu isio sahihi kutoka kwa nukuu za api.
