Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
sw_ke: Faili lako jipya litapewa jina jingine linalolingana na faili lililopo sasa. Mafaili yaliyo na nyongeza tofauti haziruhusiwi.

source: Current revision changed for %s.
sw_ke: Marudio ya sasa hivi yamebadilishwa kuwa %s.

source: Added a reference to "%(att)s" from "%(art)s".
sw_ke: Ongezea ishara kwa \"%(att)s\" kutoka kwenye \"%(art)s\.

source: The file %s was deleted.
sw_ke: Faili la %s lilifutwa.

source: This article is no longer related to the file %s.
sw_ke: Makala hii haihusiani tena na faili %s.

source: A file was changed: %s
sw_ke: Faili lilibadilishwa: %s

source: A file was deleted: %s
sw_ke: Faili lilifutwa: %s

source: New image %s was successfully uploaded. You can use it by selecting it from the list of available images.
sw_ke: Picha mpya %s imefaulu kupakiwa. Unaweza kuitumia kwa kuchagua kutoka kwenye orodha ya picha zilizopo.

source: Are you sure?
sw_ke: Je, una uhakika?

source: image
sw_ke: picha

source: images
sw_ke: picha

source: Image: %s
sw_ke: Picha: %s

source: Current revision not set!!
sw_ke: Marudio ya sasa hivi hayaja tayarishwa!!

source: image revision
sw_ke: marudio ya picha

source: image revisions
sw_ke: marudio ya picha

source: Image Revsion: %d
sw_ke: Marudio ya Picha: %d

source: %s has been restored
sw_ke: %s imerudishwa kama ilivyokuwa

source: %s has been marked as deleted
sw_ke: %s imewekwa alama kuwa imefutwa

source: %(file)s has been changed to revision #%(revision)d
sw_ke: %(file)s yamebadilishwa kuwa marudio namba #%(revision)d

source: %(file)s has been saved.
sw_ke: %(file)s yamehifadhiwa.

source: Images
sw_ke: Picha

source: An image was added: %s
sw_ke: Picha iliongezwa: %s

source: Links
sw_ke: Viungo-wavuti

source: Notifications
sw_ke: Taarifa

source: When this article is edited
sw_ke: Wakati makala hii itakapohaririwa

source: Also receive emails about article edits
sw_ke: Pia pokea barua pepe kuhusu uhariri wa makala

source: Your notification settings were updated.
sw_ke: Mipangilio yako ya taarifa imesasishwa.

source: Your notification settings were unchanged, so nothing saved.
sw_ke: Mipangilio yako ya taarifa haijabadilishwa, kwa hiyo hakuna kilichohifadhiwa.

source: %(user)s subscribing to %(article)s (%(type)s)
sw_ke: %(user)s wanaojiandikisha kwenye %(article)s (%(type)s)

source: Article deleted: %s
sw_ke: Makala imefutwa: %s

source: Article modified: %s
sw_ke: Makala imerekebishwa: %s

source: New article created: %s
sw_ke: Makala mpya imetengenezwa: %s

source: You are now sign up... and now you can sign in!
sw_ke: Sasa umejiunga... na sasa unaweza kuingia mtandaoni!

source: You are no longer logged in. Bye bye!
sw_ke: Haupo mtandaoni. Kwaheri!

source: You are now logged in! Have fun!
sw_ke: Sasa umeingia mtandaoni! Furahia!

source: New article '%s' created.
sw_ke: Makala mpya '%s' imetengenezwa.

source: There was an error creating this article: %s
sw_ke: Kulikuwa na kosa kwenye kutengeneza makala hii: %s

source: There was an error creating this article.
sw_ke: Kulikuwa na kosa kwenye kutengeneza nakala hii.

source: This article cannot be deleted because it has children or is a root article.
sw_ke: Nakala hii haiwezi kufutwa kwa sababu inabeba makala nyingine ndogo ndogo.

source: This article together with all its contents are now completely gone! Thanks!
sw_ke: Makala hii pamoja na maudhui yake yote sasa hayapo! Asante!

source: The article "%s" is now marked as deleted! Thanks for keeping the site free from unwanted material!
sw_ke: Makala \"%s\" imewekwa alama kama imefutwa! Asante kwa kuondoa mtandaoni makala yasiyohitajika!

source: Your changes were saved.
sw_ke: Mabadiliko yako yamehifadhiwa.

source: Restoring article
sw_ke: Kurudisha makala kama ilivyokuwa

source: The article "%s" and its children are now restored.
sw_ke: Makala \"%s\ na makala zilizomo ndani yake sasa zimerudishwa kama zilivyokuwa.

source: The article %(title)s is now set to display revision #%(revision_number)d
sw_ke: Makala %(title)s imetayarishwa kuonesha marudio namba#%(revision_number)d

source: New title
sw_ke: Jina jipya la makala

source: Merge between Revision #%(r1)d and Revision #%(r2)d
sw_ke: Unganisha marudio namba #%(r1)d na marudio namba #%(r2)d

source: A new revision was created: Merge between Revision #%(r1)d and Revision #%(r2)d
sw_ke: Marudio mapya yametengenezwa: Unganisha marudio namba #%(r1)d na marudio namba #%(r2)d
