Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Click {em_start}New Group Configuration{em_end} to add a new configuration. To edit a configuration, hover over its box and click {em_start}Edit{em_end}. You can delete a group configuration only if it is not in use in an experiment. To delete a configuration, hover over its box and click the delete icon.
sw_ke: Bonyeza {em_start}Mpangilio wa Kundi Jipya{em_end} kuongeza mpangilio mpya. Kuhariri mpangilio, vinjari juu ya kisanduku chake na ubonyeze {em_start}Hariri{em_end}. Waweza kufuta mpangilio wa kundi iwapo tu hautumiki kwenye jaribio. Kufuta mpangilio, vinjari juu ya kisanduku chake na ubonyeze taswira ya kufuta.

source: Details & Schedule
sw_ke: Utondoti & Ratiba

source: Welcome
sw_ke: Karibu

source: Welcome to {studio_name}
sw_ke: Karibu kwenye {studio_name}

source: {studio_name} helps manage your online courses, so you can focus on teaching them
sw_ke: {studio_name} inasaidia kumudu kozii zako za mtandaoni, ili uweze kupata malengo ya kufundishia

source: {studio_name}'s Many Features
sw_ke: {studio_name}'s Vipengele Vingi

source: {studio_name} Helps You Keep Your Courses Organized
sw_ke: {studio_name} Inakusaidia Kuweka Kozi Zako katika Mpangilio

source: Enlarge image
sw_ke: Kuza picha

source: Keeping Your Course Organized
sw_ke: Kuweka Kozi Zako kwa Mpangilio

source: The backbone of your course is how it is organized. {studio_name} offers an {strong_start}Outline{strong_end} editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
sw_ke: Msingi wa kozi yako ni vile ilivyopangiliwa. {studio_name} inatoa nyenzo ya uhariri wa {strong_start}Muhtasari {strong_end}, inayokupa mpangilio wa kawaida na uliorahisi kuuendesha kwa ajili ya kukusaidia wewe na wanafunzi wako kupangilia kozi.

source: Simple Organization For Content
sw_ke: Mpangilio Mwepesi wa Maudhui

source: {studio_name} uses a simple hierarchy of {strong_start}sections{strong_end} and {strong_start}subsections{strong_end} to organize your content.
sw_ke: {studio_name} inatumia mpangilio wa kawaida wa{strong_start}sehemu kuu{strong_end} na {strong_start}sehemu ndogo{strong_end} kupangilia maudhui yako.

source: Change Your Mind Anytime
sw_ke: Badili Fikra Zako Wakati wowote

source: Draft your outline and build content anywhere. Simple drag and drop tools let you reorganize quickly.
sw_ke: Fanya mchoro wa kwanza wa muongozo wako na ujenge yaliyomo popote. Buruta kirahisi na angusha zana zikupangie upya kwa upesi.

source: Go A Week Or A Semester At A Time
sw_ke: Nenda Wiki moja Au Muhula Mmoja Baada Mwingine

source: Build and release {strong_start}sections{strong_end} to your students incrementally. You don't have to have it all done at once.
sw_ke: Tengeneza na toa {strong_start}sehemu kuu{strong_end} kwa wanafunzi wako kwa mfumo wa nyongeza. Huhitaji kukamilisha yote kwa wakati mmoja.

source: Learning is More than Just Lectures
sw_ke: Kujifunza ni Zaidi ya Mihadhara

source: {studio_name} lets you weave your content together in a way that reinforces learning. Insert videos, discussions, and a wide variety of exercises with just a few clicks.
sw_ke: {studio_name} inakupa wewe kusuka yaliyomo yako pamoja kwa njia ya kuimarisha mafunzo. Weka video, mazungumzo, na namna nyingi za mazoezi kwa vibonyezo vichache.

source: Create Learning Pathways
sw_ke: Kubuni Njia za Kujifindishia

source: Help your students understand one concept at a time with multimedia, HTML, and exercises.
sw_ke: Saidia wanafunzi wako kuelewa wazo moja baada ya jingine kupitia idhaa mchanganyiko, HTML, na mazoezi.

source: Work Visually, Organize Quickly
sw_ke: Kufanya kwa Kuona, Panga Upesi

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
sw_ke: Fanya kazi kwa maono uone wanafunzi wako wataona nii hasa. Panga upya yote yaliyomo yako kwa kuburuta na kuangusha.

source: A Broad Library of Problem Types
sw_ke: Maktaba Pana ya Aina za Matatizo

source: It's more than just multiple choice. {studio_name} supports more than a dozen types of problems to challenge your learners.
sw_ke: Ni zaidi ya chaguo mchanganyiko. {studio_name} inasaidia zaidi ya aina kumi na mbili za matatizo kuwakabili wanagenzi wako.

source: {studio_name} Gives You Simple, Fast, and Incremental Publishing. With Friends.
sw_ke: {studio_name} Inakupa Wewe urahisi, haraka, na ziada ya ongezeko la Uchapishaji. Na Marafiki.

source: Simple, Fast, and Incremental Publishing. With Friends.
sw_ke: Rahisi, Haraka, na ziada ya Uchapishaji. Na Marafiki.

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
sw_ke: {studio_name} inafanya kama matumizi ya mtandao ambayo tayari wayajua, hali inafahamu namna gani unavyo jenga mtalaa. Uchapishaji wa papo kwa hapo wa mtandao unapohitajia, nyongeza za kuachilia ikiwa inaleta maana. Na pamoja na watunzi wenza, unaweza kuwa na kikosi kizima mukijenga kozi, pamoja.

source: Instant Changes
sw_ke: Mabadiliko ya Papo kwa Hapo

source: Caught a bug? No problem. When you want, your changes go live when you click Save.
sw_ke: Umeshika bug? Hamna tatizo. Ukihitaji, mabadiliko yako yako yaende hai ukibonyeza Dhibiti.

source: Release-On Date Publishing
sw_ke: Tarehe ya Kutoa Chapa

source: When you've finished a {strong_start}section{strong_end}, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
sw_ke: Utakapokuwa umemaliza {strong_start}sehemu kuu{strong_end}, itumie wakati unapotaka iwe bushara na pick when you want it to go live and {studio_name} itahusika na mambo mengine. Tengeneza kozi yako kwa mtindo wa kuongeza kidogo kidogo.

source: Work in Teams
sw_ke: Fanyeni kazi kwa Pamoja

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
sw_ke: Watunzi wenzako wamefaulu kufikia zana zote za utungaji. Fanya fanni yako bora kupitia juhudi / jitihada za kikosi.

source: Sign Up for {studio_name} Today!
sw_ke: Jiunge na {studio_name} Leo!

source: Sign Up & Start Making Your {platform_name} Course
sw_ke: JIunge & Anza Kutengeneza {platform_name} Yako ya Kozi

source: Already have a {studio_name} Account? Sign In
sw_ke: Tayari unayo Akaunti ya {studio_name} ? Ingia mtandaoni

source: Outlining Your Course
sw_ke: Kuonesha Maudhui ya Kozi kwa Ufupi

source: Simple two-level outline to organize your course. Drag and drop, and see your course at a glance.
sw_ke: Andaa muhtasari wa kawaida wa pande mbili ili kupangilia kozi yako. Kokota na uache, na ona mwonekano wa kozi yako.

source: More than Just Lectures
sw_ke: Zaidi ya Mihadhara

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
sw_ke: Haraka tengeneza video, maandishi, majadiliano yaliyo katika mada, na aina mbalimbali za matatizo.

source: Publishing on Date
sw_ke: Inachapishwa kwa Tarehe

source: Simply set the date of a section or subsection, and {studio_name} will publish it to your students for you.
sw_ke: Weka tarehe ya kifungu au kifungu kidogo, na {studio_name} itakuchapishia kwa ajili ya wanafunzi wako.

source: We're having trouble rendering your component
sw_ke: Tumepata tatizo la kushindwa kukutafutia kipengele unachohitaji

source: Students will not be able to access this component. Re-edit your component to fix the error.
sw_ke: Wanafunzi hawataweza kukipata kipengele hiki. Hariri upya kipengele chako urekebishe hitilafu.

source: Library Import
sw_ke: Pokea Maktaba

source: Course Import
sw_ke: Upokeaji wa Kozi

source: Be sure you want to import a library before continuing. The contents of the imported library will replace the contents of the existing library. {em_start}You cannot undo a library import{em_end}. Before you proceed, we recommend that you export the current library, so that you have a backup copy of it.
sw_ke: Kuwa na hakika unahitaji kupokea maktaba kabla kuendelea. Yaliyomo katika mapokezi ya maktaba yatachukua nafasi ya yaliyomo kwa sasa ya maktaba. {em_start}Huwezi kutangua mapokezi ya maktaba{em_end}. Kabla hujaendelea, tunapendekeza utume nje maktaba iliopo sasa, ili upate nakala ya kuungia mkono.

source: The library that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a library.xml file. It may also contain other files.
sw_ke: Maktaba unayopokea lazima iwe ni faili ya tar.gz (that is, a .tar file compressed with GNU Zip). Faili hii ya .tar.gz lazima iwe na maktaba .xml faili. Inaweza pia kuwa na faili nyingine nyingi.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your library until the import operation has completed.
sw_ke: Njia ya mapokezi ina vitongoji vitano. katika vitongo viwili vya kwanza, lazima ubakie katika ukurasa huu. Unaweza kutoka kwa ukurasa huu baada ya upanguzi kukamilika. Tunapendekeza, ijapokuwa, hufanyi mageuzi muhimu kwa maktaba yako mpaka harakati za mapokezi zikamilike.

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
sw_ke: Kuwa na hakika unahitaji kupokea kozi kabla kuendelea. Yaliyomo katika mapokezi ya kozi yatachukua nafasi ya yaliyomo sasa kwenye kozi. {em_start}Huwezi kutangua mapokezi ya kozi{em_end}. Kabla hujaendelea, tunapendekeza kwamba utume nje kozi iliopo sasa, ili upate nakala yake ya kuungia mkono.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
sw_ke: Kozi unayopokea lazima iwe kwa faili ya .tar.gz (that is, a .tar file compressed with GNU Zip). Faili hii .tar.gz lazima iwe na faili ya kozi ya .xml. inaweza pia kuwa na faili nyenginezo.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
sw_ke: Njia ya mapokezi ina vitongoji vitano. Katika vitongoji viwili vya mwanzo, lazima ubakie kwenye ukurasa huu. Unaweza kutoka katika ukurasa huu baada ya kitongoji cha upanguzi kukamilika. Tunapendekeza, ijapokuwa, hufanyi mabadiliko muhimu kwa kozi yako mpaka harakati za mapokezi zikamilike.

source: Select a .tar.gz File to Replace Your Library Content
sw_ke: Chagua Faili ya tar.gz Kubadilisha Yaliyomo ya Maktaba

source: Select a .tar.gz File to Replace Your Course Content
sw_ke: Chagua Faili ya tar.gz Kubadilisha Yaliyomo katika Fanni Yako

source: Choose a File to Import
sw_ke: Chagua Faili ya Kupokea

source: File Chosen:
sw_ke: Faili Iliyochaguliwa:

source: Replace my library with the selected file
sw_ke: Badilisha maktaba yangu kwa faili teule

source: Replace my course with the selected file
sw_ke: Badilisha fanni yangu kwa faili teule

source: Library Import Status
sw_ke: Hali Ilivyo ya Upokeaji wa Maktaba

source: Course Import Status
sw_ke: Hali ya Upokeaji Kozi

source: Transferring your file to our servers
sw_ke: Kuhamisha faili yako kenda kwenye seva zetu

source: Unpacking
sw_ke: Kupangua

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
sw_ke: Mkunjo wa upanuzi na matayarisho/muundo wa faili (you can leave this page safely, but avoid making drastic changes to content until this import is complete)

source: Verifying
sw_ke: Uhakikishaji

source: Reviewing semantics, syntax, and required data
sw_ke: Kupitia upya semantiki, syntaksi, na takwimu inayohitajika

source: Updating Library
sw_ke: Usasishaji Maktaba

source: Updating Course
sw_ke: Usasishaji Kozi

source: Integrating your imported content into this library. This process might take longer with larger libraries.
sw_ke: Kuchanganya yaliyomo katika mapokezi yako na maktaba hii. Njia hii yaweza kukawiya/kuchukua muda mrefu sana kwa maktaba kubwa zaidi.

source: Integrating your imported content into this course. This process might take longer with larger courses.
sw_ke: Kuchanganya yaliyomo katika kozi hii. Njia hii yaweza kukawiya mno kwa kozi pana zaidi.

source: Your imported content has now been integrated into this library
sw_ke: Yaliyomo katika mapokezi yako sasa yamechanganywa kwenye maktaba hii

source: Your imported content has now been integrated into this course
sw_ke: Yaliyomo katika mapokezi yako sasa yamechanganywa kwenye kozi hii

source: View Updated Library
sw_ke: Tizama Ukamilishaji wa Maktaba

source: View Updated Outline
sw_ke: Tizama Muongozo wa Ukamilishaji

source: Why import a library?
sw_ke: Kwanini Upokee Maktaba?

source: You might want to update an existing library to a new version, or replace an existing library entirely. You might also have developed a library outside of {studio_name}.
sw_ke: Ungehitaji kukamilisha maktaba iliopo kwa mtindo mpya, au badilisha maktaba iliopo yote kabisa. Waweza kuwa umeanzisha maktaba nje ya {studio_name}.

source: Note: Library content is not automatically updated in courses
sw_ke: Ilani: Yaliyomo ya maktaba hayajikamilishi yenyewe katika kozi

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
sw_ke: Ukibadilisha na upokee maktaba ambayo imeashiriwa kwa kubahatisha tabaka za yaliyomo kati ya kozi moja au zaidi, kozi hizo hazitumii ukamilishaji kiwenyewe wa yaliyomo. Lazima urudie upya kwa kuweka tabaka za ubahatishaji wa yaliyomo kuzileta ziwe kamilifu na yaliyomo ya maktaba mpya kabisa.

source: Learn more about importing a library
sw_ke: Jifunze mengi kuhusu upokeaji wa maktaba

source: Why import a course?
sw_ke: Kwanini upokee kozi?

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
sw_ke: Ungehitaji kuendesha toleo jipya la kozi iliopo sasa, au badilisha kozi iliopo yote kabisa. Au, pengine ungeanzisha kozi nje ya {studio_name}.

source: What content is imported?
sw_ke: Ni yaliyomo yapi yakupokea?

source: Only the course content and structure (including sections, subsections, and units) are imported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, remains the same as it was in the existing course.
sw_ke: Isipokuwa yaliyomo na muundo wa kozi (including sections, subsections, and units) yanapokelewa kutoka nje. Habari nyenginezo, zikiwemo za wanafunzi, habari za utoaji daraja, habari za mazungumzo ya kongamano, mikakati ya kozi, na habari za kikosi cha kozi, zinabaki vivyo hivyo kama zilivyo kwenye kozi iliopo sasa.

source: Warning: Importing while a course is running
sw_ke: Onyo: Upokeaji ikiwa fanni inaendelea

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
sw_ke: Ukitekeleza upokezi hali kozi inaendelea, na ubadilishe majina ya URL (or url_name nodes) ya vipengele vyovyote vya matatizo, habari za mwanafunzi zihusianazo na vipengele vya matatizo hayo zaweza kupotea. Taarifa hii ni pamoja na alama wapatazo wanafunzi za utahini wa matatizo.

source: Learn more about importing a course
sw_ke: Jifunze zaidi kuhusu upokeaji wa fanni

source: {studio_name} Home
sw_ke: {studio_name} Nyumbani

source: New Course
sw_ke: Kozi Mpya

source: Email staff to create course
sw_ke: Tuma barua pepe kwa mfanyakazi abuni fanni

source: New Library
sw_ke: Maktaba Mpya

source: Please correct the highlighted fields below.
sw_ke: Tafadhali rekebisha viwanja vilivyo angaziwa hapo chini.

source: Create a New Course
sw_ke: Buni Kozi Mpya

source: Required Information to Create a New Course
sw_ke: Taarifa Inayohitajika Kubuni Fanni Mpya

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
sw_ke: Jina lionekanalo na umma kwa kozi hii. Hili haliwezi kubadilishwa, lakini waweza kuonyesha jina tofauti baadae kwa Mikakati Ilioboreshwa.

source: The name of the organization sponsoring the course. {strong_start}Note: The organization name is part of the course URL.{strong_end} This cannot be changed, but you can set a different display name in Advanced Settings later.
sw_ke: Jina la shirika linalo fadhili kozi. {strong_start}Tambua: Jina la shirika ni mojawapo ya URL ya kozi.{strong_end} Hili haliwezi kugeuzwa, lakini waweza kuweka jina jengine lakuonekana baadae kwa Mikakati Iliyoboreshwa.

source: The unique number that identifies your course within your organization. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
sw_ke: Nambari ya kipekee inayo tambua kozi yako katika shirika lako.{strong_start}Tambua: hii ni baadhi ya URL ya kozi yako, hivyo basi hakuna nafasi au tabia maalum zinazo ruhusiwa na haiwezi kubadilishwa.{strong_end}

source: The term in which your course will run. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
sw_ke: Sharti ambayo kozi yako itaendeshwa.{strong_start}Tambua: Hii ni baadhi ya URL ya kozi yako, hivyo basi hakuna nafasi au tabia maalum zinazo ruhusiwa na haiwezi kubalishwa.{strong_end}

source: Create
sw_ke: Unda

source: Create a New Library
sw_ke: Unda Maktaba Mpya

source: Required Information to Create a New Library
sw_ke: Taarifa Inayohitajika Kubuni Maktaba Mpya

source: Library Name
sw_ke: Jina la Maktaba

source: e.g. Computer Science Problems
sw_ke: kwa mfano. Matatizo ya Sayansi ya Kompyuta

source: The public display name for your library.
sw_ke: JIna lijulikanalo kwa umma la maktaba.

source: The public organization name for your library.
sw_ke: Jina lijulikanalo na umma la shirika kwa maktaba yako.

source: This cannot be changed.
sw_ke: Hii haiwezi kubadilishwa.

source: Library Code
sw_ke: Kificho cha Maktaba

source: e.g. CSPROB
sw_ke: kwa mfano. CSPROB

source: The unique code that identifies this library. {strong_start}Note: This is part of your library URL, so no spaces or special characters are allowed.{strong_end} This cannot be changed.
sw_ke: Kificho cha kipekee kinacho tambua maktaba hii. {strong_start}Tambua: Hii ni baadhi ya URL ya maktaba yako, hivyo basi hakuna nafasi au tabia maalum zinazo ruhusiwa.{strong_end} Hii haiwezi kubadilishwa.

source: Courses Being Processed
sw_ke: Fanni Zina Tayarishwa

source: Course Run:
sw_ke: Uendeshaji wa Fanni:

source: This course run is currently being created.
sw_ke: Kozi hii inaendelea kubuniwa kwa sasa.

source: Configuring as re-run
sw_ke: Ukusanyaji wa uendeshaji upya

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
sw_ke: Kozi mpya itaongezewa kwa orodha ya kozi yako ndani ya dakika 5-10. Rudi kwa ukurasa huu au {link_start}rudia upya{link_end} kukamilisha orodha ya kozi. Kozi mpya itahitaji upangaji usio wa kiwenyewe.

source: This re-run processing status:
sw_ke: Hali ya uendeshaji upya wa matayarisho:

source: Configuration Error
sw_ke: Hitlafu za Ukusanyaji

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
sw_ke: Hitlafu ya mpangilio ilitokea ikitayarisha kozi yako. Tafadhali nenda kwa kozi halisi kujaribu kuendesha upya tena, au wasiliana na PM yako kwa usaidizi.

source: Libraries
sw_ke: Maktaba

source: Are you staff on an existing {studio_name} course?
sw_ke: Mfanyikazi wewe uko katika fanni {studio_name}?

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
sw_ke: M'buni wa kozi lazima akupe ufikiaji kwa kozi. Wasiliana na m'buni wa kozi au mtawala wa kozi unaemsaidia kwa utungaji.

source: Create Your First Course
sw_ke: Unda Kozi Yako ya Kwanza

source: Your new course is just a click away!
sw_ke: Kozi yako mpya utaipata kwa kubofya tu!

source: Becoming a Course Creator in {studio_name}
sw_ke: Kuwa m'buni wa Fanni katika {studio_name}

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
sw_ke: {studio_name} ni uvumbuzi mwenyeji kwa xWashirika walioungana na wageni wateule. Kozi ambazo wewe ni mwanakikosi hutokea juu kwa wewe kuhariri, hali manufaa ya m'buni yanaidhinishwa na {platform_name}. Kikosi chetu kitatathmini ombi lako na kukupa jibu ndani ya masaa 24 katika wiki ya kazi.

source: Your Course Creator Request Status:
sw_ke: Hali ya Ombi la Ubuni wa Fanni:

source: Request the Ability to Create Courses
sw_ke: Omba Uwezo wa Kubuni Fanni

source: Your Course Creator Request Status
sw_ke: Hali ya Ombi la Ubuni wa Fanni Yako

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
sw_ke: {studio_name} ni uvumbuzi mwenyeji kwa xWashirika walioungana na wageni teule. Kozi ambazo wewe ni mwanakikosi hutokea juu kwa wewe kuhariri, hali manufaa ya m'buni wa kozi yanaidhinishwa na {platform_name}. Kikosi chetu kimemaliza kutathmini maombi lako.

source: Your Course Creator request is:
sw_ke: Ombi lako la Uanzishaji Kozi ni:

source: Your request did not meet the criteria/guidelines specified by {platform_name} Staff.
sw_ke: Maombi yako hayakufikia kigezo/miongozo iliyo tajwa na {platform_name} Mfanyikazi.

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
sw_ke: {studio_name} ni uvumbuzi mwenyeji kwa xWashirika walioungana na wageni wateule. Kozi ambazo wewe ni mwanakikosi hutokea juu kwa wewe kuhariri, hali manufaa ya m'buni wa kozi yanaidhinishwa na {platform_name}. Kikosi chetu kimemaliza kutathmini ombi lako.

source: Your request is currently being reviewed by {platform_name} staff and should be updated shortly.
sw_ke: Ombi lako linapitiwa upya hivi sasa na {platform_name} mfanya kazi na lastahili ukamilishaji hivi punde.

source: Were you expecting to see a particular library here?
sw_ke: Ulikuwa ukitarajia kuona maktaba maalum hapa?
