Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: You agree to comply with all applicable law, regulation, and third party rights (including without limitation laws regarding the import or export of data or software, privacy, copyright, and local laws). You will not use the APIs to encourage or promote illegal activity or violation of third party rights. You will not violate any other terms of service with {platform_name}. You will only access (or attempt to access) an API by the means described in the documentation of that API. You will not misrepresent or mask either your identity or yourApplication's identity when using the APIs.
sw_ke: Unakubali kutii na sheria zote zinazoambatana, taratibu ziliopo, na haki za mtu wa tatu (including without limitation laws regarding the import or export of data or software, privacy, copyright, and localo laws). Hutatumia APIs kushajihisha au kuuza vitendo kinyume na sheria au halifu haki za mtu wa tatu. Huta halifu masharti mengine yoyote ya huduma kwa {platform_name}. Utafikia tu (or attempt to access) API kwa namna ilio elezewa katika nyaraka za API hiyo. Hutafasiri/Tafsiri kombo au kugeuza kitambulisho chako au kitambulisho cha maombi ukitumia APIs.

source: Ownership
sw_ke: Umiliki

source: You acknowledge and agree that the APIs and all API Content contain valuable intellectual property of {platform_name} and its partners. The APIs and all API Content are protected by United States and foreign copyright, trademark, and other laws. All rights in the APIs and the API Content, if not expressly granted, are reserved. By using the APIs or any API Content, you do not acquire ownership of any rights in the APIs or API Content. You must not claim or attempt to claim ownership in the APIs or any API Content or misrepresent yourself or your company or your Application as being the source of any API Content. You may not modify, create derivative works of, or attempt to use, license, or in any way exploit any API Content in whole or in part on your own behalf or on behalf of any third party. You may not distribute or modify the APIs or any API Content (including adaptation, editing, excerpting, or creating derivative works).
sw_ke: Una tambua na kukubali kuwa APIs na Yaliyomo yote ya API yana mali za thamani na za hekima kwa {platform_name} na wenzake. APIs na Yaliyomo yote ya API yamedhibitiwa/yamelindiwa haki zake za kunakili na MAREKANI, na alama za biashara, na sheria nyingine za ng'ambo. Haki zote kwenye API na yaliyomo yake, kama hayakuruhusiwa moja kwa moja, zina dhibitiwa.Kwa kutumia APIs au Yaliyomo yake,hupati umiliki wa haki zozote kwa API au Yaliyomo yake. Sio lazima udai au ujaribu kudai umiliki kwenye APIs au Yaliyomo katika API au ujitafsiri kombo au utafsiri kombo kampuni yako au Ombi lako kama chanzo cha Yaliyomo ya API. Unaweza usirekebishe, buni kazi inayotokana na, au kujaribu kutumia, leseni, au kwa njia yoyote kuhujumu Yaliyomo yoyote ya API kikamilifu, au kwa baadhi kwa niaba yako mwenyewe au niaba ya mtu yoyote wa tatu. Unaweza usisambaze au rekebisha APIs au Yaliyomo yoyote ya API (including adaption, editing, excerpting, or creating derivative works).

source: All names, logos and seals ("Trademarks") that appear in the APIs, API Content, or on or through the services made available on or through the APIs, if any, are the property of their respective owners. You may not remove, alter, or obscure any copyright, Trademark, or other proprietary rightrs notices incorporated in or accompanying the API Content. If any third party revokes access to API Content owned or controlled by that third party, including without limitation any Trademarks, you must ensure that all API Content pertaining to that third party is deleted from your app, networks, systems and servers as soon as reasonably possible. If you stop using the APIs altogether or if your API access is revoked, you must delete all API Content in the same way.
sw_ke: Majina yote, nembo na vifungo ("Trademarks") zinazo tokeza kwenye APIs, Yaliyomo ya API, au juu au kupitia huduma zinazopatikana juu au kupitia APIs, kama zipo zozote, ni miliki ya wenyewe kiheshima. Unaweza usiondoe, rekebisha, au vuruga alama zozote za biashara na haki za kunakili, au ilani za haki nyenginezo za umiliki zilizoshirikishwa kwenye, au kufuatana na Yaliyomo ya API. Iwapo mtu wa tatu yoyote atakiuka ufikiaji wa Yaliyomo ya API yanayo milikiwa au endeshwa na mtu wa tatu, pamoja na kutokuwepo vikomo kwa Alama za biashara, lazima uhakikishe kuwa Yaliyomo yote ya API yanayo ambatana na mtu wa tatu, yamefutwa kutoka kwa app, mitandao,mipangilio na sava kwa haraka iwezekanavyo kibusara. Ukiacha kutumia API yote pamoja au kama ufikiaji wako kwa API umekataliwa, lazima ufute yaliyomo yote kwa njia hiyo hiyo.

source: To the extent that you submit any content to {platform_name} in connection with your use of the APIs or any API Content, you hereby grant to {platform_name} a worldwide, non-exclusive, transferable, assignable, sub licensable, fully paid-up, royalty-free, perpetual, irrevocable right and license to host, transfer, display, perform, reproduce, modify, distribute, re-distribute, relicense and otherwise use, make available and exploit such content, in whole or in part, in any form and in any media formats and through any media channels (now known or hereafter developed).
sw_ke: Kuongeza uliofikisha kwa yaliyomo yoyote {platform_name} kulingana na utumiaji wako wa APIs au Yaliyomo yoyote ya API, kwa hapa unaidhisha {platform_name} ya kimataifa, isobagua, inayohamishika, inaweza kutolewa kwa kufanyiwa kazi,kupata leseni ndogo ndogo, ikiwa imelipiwa kikamilifu, haina ufalme, yakuendelea, haki zisizo batilika na leseni za uwenyeji, kuhamisha, kuonyesha, kutekeleza, kuzalisha upya, kurekebisha, kusambaza, kusambaza upya, kutoa leseni upya na matumizi mengine, yanayo patikana na kuhujumu yaliyomo kama hayo, kikamilifu au kwa baadhi, kwa njia yoyote na kwa mfumo wowote wa idhaa na chaneli yoyote ya idhaa (now known or hereafter developed).

source: Privacy
sw_ke: Faragha

source: You agree to comply with all applicable privacy laws and regulations and to be transparent with respect to any collection and use of end user data. You will provide and adhere to a privacy policy for your Application that clearly and accurately describes to your end users what user information you collect and how you may use and share such information (including for advertising) with {platform_name} and other third parties.
sw_ke: Unakubali kutii kwa sheria zote ziliopo na utaratibu wa haki ya kutoingliwa na kuwa wazi kwa heshima ya mkusanyiko wowote na kutumia takwimu za mtumiaji wa mwisho. Utatoa na utii kanuni za faragha kwa maombi yako yanayoeleza kwa uwazi na kikamilifu kwa mtumiaji wako wa mwisho taarifa gani ya mtumiaji unakusanya na vipi ungetumia na kushirikisha habari kama hiyo (including for advertising) kwa {platform_name} na watu wengine katika utatu.

source: Right to Charge
sw_ke: Haki ya Kulipisha

source: {platform_name} reserves the right to modify the Terms at any time without advance notice. Any changes to the Terms will be effective immediately upon posting on this page, with an updated effective date. By accessing or using the APIs after any changes have been made, you signify your agreement on a prospective basis to the modified Terms and all of the changes. Be sure to return to this page periodically to ensure familiarity with the most current version of the Terms.
sw_ke: {platform_name} ina miliki haki za kurekebisha Masharti kwa wakati wowote bila ya ilani yoyote. Mabadiliko yoyote kwa Masharti yatakuwa na athari pindi yakibandikwa mtandaoni kwenye ukurasa huu, ikiwa na tarehe ya kuanza utekelezaji. Kwa ufikiaji au kutumia APIs baada ya kila mabadiliko yaliyofanywa, unasahihisha makubaliano kwa msingi wa manufaa kwa mabadiliko ya Masharti na mageuzi yote mengine. Kuwa na uhakika kurudi kwa ukurasa baada kila muda kuhakikisha ufahamu kwa mitindo yote ya kisasa na Masharti.

source: {platform_name} may also update or modify the APIs from time to time without advance notice. These changes may affect your use of the APIs or the way your integration interacts with the API. If we make a change that is unacceptable to you, you should stop using the APIs. Continued use of the APIs means you accept the change.
sw_ke: {platform_name} inaweza pia kukamilisha au rekebisha APIs baada kila wakati bila ya ilani yoyote. Mageuzi haya yanaweza kuathiri utumiaji wako wa APIs au namna unavyo ingiliana na kuchanganyika na API. Tukifanya mabadiliko ambayo hayakubaliki kwako, unastahili kuacha kutumia APIs. Kuendelea kutumia APIs ina maanisha umekubaliana na mabadiliko.

source: Confidentiality
sw_ke: Usiri

source: Your credentials (such as client secret and IDs) are intended to be used solely by you. You will keep your credentials confidential and discourage others from using your credentials. Your credentials may not be embedded in open source projects.
sw_ke: Sifa zako (such as client secret and IDs) zinadhamiriwa kutumika na wewe pekee. Utaweka sifa zako kiuaminifu na usishawishi wengine kutumia sifa zako. Sifa zako zawezi siziwekwe katika miradi ya asili wazi.

source: In the event that {platform_name} provides you with access to information specific to {platform_name} and/or the APIs that is either marked as "Confidential" or which a reasonable person would assume to be confidential or proprietary given the terms of its disclosure ("Confidential Information"), you agree to use this information only to use and build with the APIs. You may not disclose the Confidential Information to anyone without {platform_name}'s prior written consent, and you agree to protect the Confidential Information from unauthorized use and disclosure in the same way that you would protect your own confidential information. Confidential information does not include information that you independently developed, that was rightfully given to you by a third party without confidentiality obligation, or that becomes public through no fault of your own. You may disclose Confidential Information when compelled to do so by law if you provide {platform_name} with reasonable prior notice, unless a court orders that {platform_name} not receive notice.
sw_ke: Katika tukio la {platform_name} inakupa wewe ufikiaji kwa habari maalum kwa {platform_name} na/au APIs ambayo imewekwa alama kama "Ya kuaminika mno" au mtu mstahiki angedhania kuamuaminifu au kwa umiliki apewe masharti ya yaliyobanwa ("Confidential Information"), unakubali kutumia habari hii itumike pekee na kujenga na APIs. Unaweza usifunguke kwa Habari za Kuaminika kwa yoyote bila ya {platform_name}'s kabla kuandika idhini, na unakubali kulinda Habari Muhimu za Kuaminika kwa utumizi usio na ruhusa kwa njia ile ile ungelinda Habari zako Muhimu za Kuaminika. Habari za Kuaminika Muhimu hazihusu habari ambazo unazibuni, ambapo ulipewa uhuru huo kihalali na mtu wa utatu bila ya mujibu wa umuhimu au usiri, au zitangae kwa umma kupitia kasoro isio yako. Unaweza kutoa Habari Muhimu utakapo lazimika kufanya hivyo kisheria ukitoa {platform_name} sababu na ilani mbele kabla, labda mahakama iamuru kuwa {paltform_name} haikupokea ujilisho.

source: Disclaimer of Warranty / Limitation of Liabilities
sw_ke: Kukanusha Haki / Dhima za Ukomo

source: THE APIS AND ANY INFORMATION, API CONTENT OR SERVICES MADE AVAILABLE ON OR THROUGH THE APIS ARE PROVIDED "AS IS" AND "AS AVAILABLE" WITHOUT WARRANTY OF ANY KIND (EXPRESS, IMPLIED OR OTHERWISE), INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, EXCEPT INSOFAR AS ANY SUCH IMPLIED WARRANTIES MAY NOT BE DISCLAIMED UNDER APPLICABLE LAW.
sw_ke: APIS NA HABARI ZOZOTE, YALIYOMO YA API AU HUDUMA ZILIZOPO KWENYE AU KUPITIA APIS ZINATOLEWA "KAMA ILIVYO" NA "ZINAVYOPATIKANA" BILA YA HAKI YA AINA YOYOTE (EXPRESS, IMPLIED OR OTHERWISE), PAMOJA, BILA VIKOMO, HAKI ZOZOTE ZILIZOEKWA ZA BIASHARA, UZIMA WA LENGO MAALUM NA KUTOVUNJA, ISIPOKUWA KWA HAKI ZILIZOEKWA HAZIWEZI KUDAIWA CHINI YA SHERIA ZILIOPO.

source: {platform_name} AND THE {platform_name} PARTICIPANTS (AS HERINAFTER DEFINED) DO NOT WARRANT THAT THE APIS WILL OPERATE IN AN UNINTERRUPTED OR ERROR-FREE MANNER, THAT THE APIS ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT THE APIS OR API CONTENT PROVIDED WILL MEET YOUR NEEDS OR EXPECTATIONS. {platform_name} AND THE {platform_name} PARTICIPANTS ALSO MAKE NO WARRANTY ABOUT THE ACCURACY, COMPLETENESS, TIMELINESS, OR QUALITY OF THE APIS OR ANY API CONTENT, OR THAT ANY PARTICULAR API CONTENT WILL CONTINUE TO BE MADE AVAILABLE. "{platform_name} PARTICIPANTS" MEANS MIT, HARVARD, THE OTHER MEMBERS, THE ENTITIES PROVIDING INFORMATION, API CONTENT OR SERVICES FOR THE APIS, THE COURSE INSTRUCTORS AND THEIR STAFFS.
sw_ke: {platform_name} NA {platform_name} WAHUSIKA (AS HEREINAFTER DEFINED) HAWANA HAKI KUWA APIS ITAFANYA KAZI KATIKA HALI YA KUTOINGILIWA AU KUPATA HITLAFU, NA KUWA APIS ZIKO HURU KUTOKANA NA VIRUSI AU VIGEZO VYENGINE VILIVYO NA MADHARA, AU KUWA APIS AU YALIYOMO KWENYE API YATAFIKIA MALENGO YAKO AU MATARAJIO. {platform_name} NA {platform_name} WAHUSIKA HAWANA UHAKIKISHO KUHUSU USAWA, UKAMILIFU, WAKATI MUAFFAKA, AU UBORA WA APIS AU YALIYOMO YOYOTE YA API, AU KUWA YALIYOMO MAALUM YA API YATAENDELEA KUPATIKANA. "{platform_name} WAHUSIKA" KUMAANISHA MIT, HARVARD, NA WAHUSIKA WENGINE, NA YAHUSIKAYO YENYE KUTOA HABARI, YALIYOMO YA API AU HUDUMA KWA APIS, WAALIMU WA KOZI NA WAFANYI KAZI WENGINE.

source: USE OF THE APIS, AND THE API CONTENT AND ANY SERVICES OBTAINED FROM OR THROUGH THE APIS, IS AT YOUR OWN RISK. YOUR ACCESS TO OR DOWNLOAD OF INFORMATION, MATERIALS OR DATA THROUGH THE APIS IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM) OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OR USE OF SUCH MATERIAL OR DATA, UNLESS OTHERWISE EXPRESSLY PROVIDED FOR IN THE {platform_name} PRIVACY POLICY.
sw_ke: TUMIA APIS, NA YALIYOMO YA API NA HUDUMA ZOZOTE NYINGINE ZIPATIKANAZO AU KUPITIA APIS, NI KWA UHATIRISHAJI WAKO MWENYEWE. UFIKIAJI WAKO KWA AU MASHUKISHO YA HABARI, VIFAA AU TAKWIMU KUPITIA APIS ZIKO KATIKA DHIMA YAKO NA UHATIRISHAJI, NA UTACHUKUWA JUKUMU KWA UHARIBIFU WOWOTE KWA MALI YAKO (INCLUDING YOUR COMPUTER SYSTEM) AU KUPOTEA KWA TAKWIMU ITAKAYO SABABISHWA NA USHUKISHAJI AU KWA VIFAA AU TAKWIMU, LABDA ITOLEWE MOJA KWA MOJA NA MOJA KATIKA {platform_name} KANUNI ZA FARAGHA.

source: TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, YOU AGREE THAT NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL BE LIABLE TO YOU FOR ANY LOSS OR DAMAGES, EITHER ACTUAL OR CONSEQUENTIAL, ARISING OUT OF OR RELATING TO THESE TERMS, OR YOUR (OR ANY THIRD PARTY'S) USE OF OR INABILITY TO USE THE APIS OR ANY API CONTENT, OR YOUR RELIANCE UPON INFORMATION OBTAINED FROM OR THROUGH THE APIS, WHETHER YOUR CLAIM IS BASED IN CONTRACT, TORT, STATUTORY OR OTHER LAW.
sw_ke: KWA KIWANGO KAMILI KURUHUSIWA NA SHERIA ILIOPO, UNAKUBALI KUWA{platform_name} AU SIO {platform_name} WAHUSIKA WATAKUGHARAMIKIA KWA UPOTEAJI AU HASARA YOYOTE, KAMA NI HALISI AU KWA YANAYO ATHIRI HASARA, KUTOKANA NA AU KUHUSIANA NA MASHARTI HAYA, AU (OR ANY THIRD PARTY'S) KWA UTUMIZI WA AU KUTOWEZA KUTUMIA APIS AU YALIYOMO YOYOTE YA API, AU UTEGEMEAJI WAKO WA HABARI KUTOKA AU KUPITIA APIS, IKIWA MADAI YAKO YATOKANA NA MKATABA, MAKOSA YA KIDAAWA, NIYAKUDUMU AU KISHERIA NYENGINE.

source: IN PARTICULAR, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL HAVE ANY LIABILITY FOR ANY CONSEQUENTIAL, INDIRECT, PUNITIVE, SPECIAL, EXEMPLARY OR INCIDENTAL DAMAGES, WHETHER FORESEEABLE OR UNFORESEEABLE AND WHETHER OR NOT {platform_name} OR ANY OF THE {platform_name} PARTICIPANTS HAS BEEN NEGLIGENT OR OTHERWISE AT FAULT (INCLUDING, BUT NOT LIMITED TO, CLAIMS FOR DEFAMATION, ERRORS, LOSS OF PROFITS, LOSS OF DATA OR INTERRUPTION IN AVAILABILITY OF DATA).
sw_ke: KWA KUPENDELEA, KWA UREFU WA KIKAMILIFU ULIRUHUSIWA NA SHERIA ILIOPO, SIO {platform_name} AU YOYOTE KATI YA {platform_name} WAHUSIKA ATAKUWA NA DHAMANA KWA YATOKEYAYO, SIO KWA DHAHIRI, KUPONEA, MAALUM, KIMFANO AU KIBAHATI MBAYA YA HASARA, IKIWA IMEWEZA KUONEKANA KABLA AU ISO ONEKANA NA IKIWA AU ISWE {platform_name} AU AU YOYOTE YA {platform-name} WAHUSIKA ALIEPUUZA AU KIVYOVYOTE KUKOSEA (PAMOJA, LAKINI BILA VIKOMO KWA, MALALAMISHI YA UHARIBIFU WA JINA, HITLAFU, UPOTEZAJI WA FAIDA, UPOTEZAJI WA TAKWIMU AU KWA UINGILIAJI KATI KATIKA UPATAJI WA TAKWIMU)

source: CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MIGHT HAVE ADDITIONAL RIGHTS.
sw_ke: BAADHI YA SHERIA ZA KIINCHI HAZIRUHUSU VIKOMO KWENYE HAKI ZILIZO WEKWA AU UTENGAJI AU KUWEKA VIKOMO KWA HASARA FULANI. KAMA SHERIA HIZI ZINAKUPASA WEWE, BAADHI AU ZOTE KWA UKANUSHI WA JUU, UTENGANISHI, AU VIKOMO ZAWEZA ZISIKUPASE, NA UNAWEZA KUWA NA HAKI ZAIDI.

source: The APIs and API Content may include hyperlinks to sites maintained or controlled by others. {platform_name} and the {platform_name} Participants are not responsible for and do not routinely screen, approve, review or endorse the contents of or use of any of the products or services that may be offered at these sites. If you decide to access linked third-party websites, you do so at your own risk.
sw_ke: Maudhui ya APIs na API yaweza kuchanganya uunganishi wa kupita kiasi kwa tovuti isimamiwayo au inayoendeshwa na wengine. {platform_name} na {platform_name} Wahusika hawana dhamana kwa na hawana utaratibu wa uchunguzi, idhini, kutizama au kuandika yaliyomo nyuma ya au kutumia kati ya bidhaa au huduma ambayo ingeweza kutolewa na tovuti hizi. Kama utaamua kufikia tovuti ya mtumizi wa tatu iliounganishwa, utafanya hivyo kwa uhatirishaji wako mwenyewe.

source: To the maximum extent permitted by applicable law, you agree to defend, hold harmless and indemnify {platform_name} and the {platform_name} Participants, and their respective subsidiaries, affiliates, officers, faculty, students, fellows, governing board members, agents and employees from and against any third-party claims, actions or demands arising out of, resulting from or in any way related to your use of the APIs and any API Content, including any liability or expense arising from any and all claims, losses, damages (actual and consequential), suits, judgments, litigation costs and attorneys' fees, of every kind and nature. In such a case, {platform_name} or one of the {platform_name} Participants will provide you with written notice of such claim, suit or action.
sw_ke: Kwa kiasi cha juu kinachoruhusiwa na sheria, unakubali kulinda, kutodhuru na kulipa fidia kwenye {platform_name} na Washiriki wa {platform_name}, na matawi yao, washirika wao, maofisa, walimu na wanafunzi, marafiki na bodi za utawala, mawakala na waajiriwa kutoka na dhidi ya malalmiko ya wenye kudai, vitendo au mahitaji yanayojitokeza kwa hali yoyote kutokana na utumiaji wa APIs na Maudhui ya API ikiwemo madeni yoyote au matumizi yatokanyo na madai yoyote, hasara, uharibifu( halisi na yasiyohalisi), mashtaka, hukumu, gharama za kesi na malipo ya mwanasheria ya aina yoyote. Katika hali hiyo, {platform_name} au moja kati ya Washiriki wa {platform_name} atakupa taarifa ya maandishi ya dai hilo, kesi au kitendo hicho.

source: General Legal Terms
sw_ke: Masharti Ya Jumla ya Kisheria

source: The Terms constitute the entire agreement between you and {platform_name} with respect to your use of the APIs and API Content, superseding any prior agreements between you and {platform_name} regarding your use of the APIs and API Content. The failure of {platform_name} to exercise or enforce any right or provision of the Terms shall not constitute a waiver of such right or provision. If any provision of the Terms is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties' intentions as reflected in the provision and the other provisions of the Terms shall remain in full force and effect. The Terms do not create any third party beneficiary rights or any agency, partnership, or joint venture. For any notice provided to you by {platform_name} under these Terms, {platform_name} may notify you via the email address associated with your {platform_name} account.
sw_ke: Vipengele vinajumisha makubaliano yote kati yako na {platform_name} pamoja na utumiaji wako wa APIs na Maudhui ya API, ukibadilisha makubaliano yoyote ya awali kati yako na {platform_name} kuhusu utumiaji wako wa APIs na Maudhui ya API. Kushindwa kwa The failure of {platform_name} kutekeleza au kusimamia haki au maagizo ya vipengele haitahusu kufuta haki hizo. Ikiwa maelezo ya Vipengele vitapatikana na mahakama kuwa ni batili, washirika wakikubaliana kwamba mahakama itoe hukumu na kusimamia maamuzi ya washirika kama yalivyooneshwa kwenye maelezo na maelezo mengine katika Vipengele yatabaki kama yalivyoamuliwa na kutekelezwa. Vipengele havitoi haki za mshirika mwingine wa tatu au kampuni, ushirika, au jumuiya. Kwa taarifa yoyote iliyotolewa kwako na {platform_name} chini ya Vipengele hivi, {platform_name} inaweza kukutaarifu kwa kupitia anwani ya barua pepe inayohusiana na akaunti yako ya{platform_name}.

source: You agree that the Terms, the APIs, and any claim or dispute arising out of or relating to the Terms or the APIs will be governed by the laws of the Commonwealth of Massachusetts, excluding its conflicts of law provisions. You agree that all such claims and disputes will be heard and resolved exclusively in the federal or state courts located in and serving Cambridge, Massachusetts, U.S.A. You consent to the personal jurisdiction of those courts over you for this purpose, and you waive and agree not to assert any objection to such proceedings in those courts (including any defense or objection of lack of proper jurisdiction or venue or inconvenience of forum). Notwithstanding the foregoing, you agree that {platform_name} shall still be allowed to apply to injunctive remedies (or an equivalent type of urgent legal relief) in any jursdiction.
sw_ke: Unakubali kwa masharti ya, APIs, na malalamishi yoyote au ubishani unaokuja kutokana na au Masharti yahusianayo au APIs zitaendeshwa na sheria ya Commonwealth ya Massachusetts, ukitenganisha malumbano ya sheria iliopo. Unakubali kuwa malalamishi yote haya na mabishano yatasikilizwa na kuamuliwa kando katika mahakama ya serikali iliopo eneo la kuhudumia la Cambridge, Massachusetts, MAREKANI. Amri yako kibanafsi kulingana na sheria katika mahamkama kwa ajili hii, na unaifuta na kukubali kuweka kizuwizi chochote kwa ufuatiliaji katika mahakama (including any defense or objection of lack of proper jurisdiction or venue or inconvenience of forum). Kushindwa kuvumilia yanayoendelea, unakubali kwamba {platform_name} ataruhusiwa kama mwanzo kutumia matibabu ya sindano (or an equivalent type of urgent legal relief) katika eneo la kisheria.

source: Termination
sw_ke: Kikomo/ Mwisho

source: You may stop using the APIs at any time. You agree that {platform_name}, in its sole discretion and at any time, may terminate your use of the APIs or any API Content for any reason or no reason, without prior notice or liabiliy.
sw_ke: Unaweza kuwacha kutumia APIs kwa wakati wowote. Unakubali ya kwamba {platform_name}, kwa hiari na wakati wowowte, inaweza kukatiza utumiaji wako wa APIs au Yaliyomo yoyote ya API kwa sababu au bila ya sababu, bila ya ilani kabla au dhamana.
