Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: We received a request to change the e-mail associated with your {platform_name} account from {old_email} to {new_email}. If this is correct, please confirm your new e-mail address by visiting:
sw_ke: Tumepata ombi kubadilisha anwani ya barua pepe ihusianayo na {platform_name} akaunti yako kutoka kwa {old_email} mpaka kwa {new_email}. Kama hii ni sawa, tafadhali thibitisha anwani yako mpya ya barua pepe kwa kutembelea:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {platform_name} web site.
sw_ke: Kama hukuomba hii, huhitaji kufanya lolote; hutapata tena barua pepe kutoka kwetu. Tafadhali usijibu barua pepe hii; kama unahitaji msaada, angalia kifungu cha usaidizi kwa {platform_name} mtandaoni.

source: Request to change {platform_name} account e-mail
sw_ke: Omba ubadilishe {platform_name} akaunti ya anwani ya barua pepe

source: Dear student,
sw_ke: Mpendwa mwanafunzi,

source: You have been invited to join {course_name} at {site_name} by a member of the course staff.
sw_ke: Umekaribishwa kujiunga na {course_name} kwa {site_name} na mmoja wa walimu wa kozi.

source: To access the course visit {course_url} and login.
sw_ke: Kupata kozi tembelea {course_url} na uingie mtandaoni.

source: To access the course visit {course_about_url} and register for the course.
sw_ke: Kupata kozi tembelea {course_about_url} na ujindikishe kwa ajili ya kozi.

source: To finish your registration, please visit {registration_url} and fill out the registration form making sure to use {email_address} in the E-mail field.
sw_ke: Kukamilisha kujiandikisha, tafadhali tembelea {registration_url} na ujaze fomu ya kujiandikisha hakikisha unatumia {email_address} kwenye sehemu ya Barua pepe.

source: Once you have registered and activated your account, you will see {course_name} listed on your dashboard.
sw_ke: Pindi ukishajiandikisha na kuamsha akaunti yako, utaona {course_name} imeorodheshwa kwenye dashibodi yako.

source: Once you have registered and activated your account, visit {course_about_url} to join the course.
sw_ke: Ukishajiandikisha na kuamsha akaunti yako, tembelea {course_about_url} kujiunga na kozi.

source: You can then enroll in {course_name}.
sw_ke: Kisha unaweza kujisajili kwenye {course_name}.

source: You have been invited to register for {course_name}
sw_ke: Umekaribishwa kujisajili kwa ajili ya {course_name}

source: You have been enrolled in {course_name} at {site_name} by a member of the course staff. The course should now appear on your {site_name} dashboard.
sw_ke: Umesajiliwa katika {course_name} kwa {site_name} na mmoja wa walimu wa kozi. Kozi inabidi itokee kwenye dashibodi yako sasa {site_name}.

source: This email was automatically sent from {site_name} to {full_name}
sw_ke: Hii barua pepe imetumwa moja kwa moja kwenda kwa {site_name} mpaka kwa {full_name}

source: You have been enrolled in {course_name}
sw_ke: Umesajiliwa katika {course_name}

source: Your payment was successful. You will see the charge below on your next credit or debit card statement under the company name {merchant_name}.
sw_ke: Malipo yako yamepokelewa. Utaona utozaji hapo chini katika waraka ujao wa hesabu ya kadi yako ya malipo au mkopo ikiwa na jina la kampuni {merchant_name}.

source: Thank you,
sw_ke: Asante,

source: Your order number is: {order_number}
sw_ke: Idadi yako ya uagizaji ni: {order_number}

source: Hi {full_name},
sw_ke: Salamu {full_name},

source: Thanks for submitting your photos!
sw_ke: Asante kwa kuwasilisha picha zako!

source: We've received your information and the verification process has begun. You can check the status of the verification process on your dashboard.
sw_ke: Tumepokea taarifa zako na mchakato wa uhakiki umeanza. Unaweza kuangalia hali ya mchakato wa uhakiki kwenye dashibodi yako.

source: The {platform_name} team
sw_ke: {platform_name} timu

source: Thank you for purchasing enrollments in {course_name}.
sw_ke: Asante kwa kununua usajili kwenye {course_name}.

source: An invoice for {currency_symbol}{total_price} is attached. Payment is due upon receipt. You can find information about payment methods on the invoice.
sw_ke: Bili kwa ajili ya {currency_symbol}{total_price} imeambatanishwa. Malipo yatafanyika baada ya upokeaji. Unaweza kupata maelezo kuhusu njia za malipo kwenye bili

source: A .csv file that lists your enrollment codes is attached. You can use the email template below to distribute enrollment codes to your students. Each student must use a separate enrollment code.
sw_ke: Faili ya CSV inayo orodhesha namba za usajili wako imeshikanishwa. Unaweza kutumia kigezo cha barua pepe hapo chini kusambaza namba za usajili kwa wanafunzi wako. Kila mwanafunzi lazima utumie namba ya usajili kilichotengwa.

source: Thanks, The {platform_name} Team
sw_ke: Asante, Timu {platform_name}

source: Dear [[Name]]:
sw_ke: Mpendwa [[Jina]]:

source: We have provided a course enrollment code for you in {course_name}. To enroll in the course, click the following link:
sw_ke: Tumekupa kificho cha usajili wa kozi kwa ajili ya {course_name}. Kusajili katika kozi, bofya kiungo-wavuti kifuatacho:

source: HTML link from the attached CSV file
sw_ke: Uunganishi kutoka kwa faili ya CSV ilioshikanishwa wa HTML

source: After you enroll, you can see the course on your student dashboard. You can see course materials after the course start date.
sw_ke: Ukishajisajili, unaweza kuona kozi kwenye dashibodi ya mwanafunzi wako. Unaweza kuona zana za kozi baada ya tarehe ya kuanza kozi.

source: Sincerely, [[Your Signature]]
sw_ke: Wako Mwaminifu, [[Sahihi Yako]]

source: INVOICE
sw_ke: ANKARA

source: Invoice No: {invoice_number}
sw_ke: Bili No: {invoice_number}

source: Terms: Due Upon Receipt
sw_ke: Masharti: Malipo Ni Unapopokea Bidhaa ulizo Agizia.

source: Due Date: {date}
sw_ke: Tarehe ya Mwisho: {date}

source: Bill to:
sw_ke: Bili inalipwa kwa:

source: Customer Reference Number: {reference_number}
sw_ke: Namba Itakayo Ashiria Mteja: {reference_number}

source: Balance Due: {currency_symbol}{sale_price}
sw_ke: Mwisho kulipa Baki ya Malipo ni: {currency_symbol}{sale_price}

source: Course: {course_name}
sw_ke: Kozi: {course_name}

source: Price: {currency_symbol}{course_price} Quantity: {quantity} Sub-Total: {currency_symbol}{sub_total} Discount: {currency_symbol}{discount}
sw_ke: Bei: {currency_symbol}{course_price} Kiasi: {quantity} Jumla-Ndogo: {currency_symbol}{sub_total} Punguzo: {currency_symbol}{discount}

source: Total: {currency_symbol}{sale_price}
sw_ke: Jumla: {currency_symbol}{sale_price}

source: Payment Instructions
sw_ke: Maelezo ya Malipo

source: If we do not receive payment, the learner enrollments that use these codes will be canceled and learners will not be able to access course materials. All purchases are final. For more information, see the {site_name} cancellation policy.
sw_ke: Tusipo pokea malipo, usajili wa wanafunzi unaotumia namba hizi utafutwa na wanafunzi hawataweza kufikia nyenzo za kozi. Ununuzi wote unafanyika mwisho. Kwa habari zaidi, ona {site_name} kanuni za ufutaji.

source: For payment questions, contact {contact_email}
sw_ke: Kwa maswali ya jinsi ya kulipa, wasiliana {contact_email}

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the course staff at {email}.
sw_ke: Tunasikitika. Walimu wetu wa kozi hakuidhinisha ombi lako la kubadilisha jina kutoka {old_name} kwa {new_name}. Ukihitaji usaidizi zaidi, tafadhali tuma barua pepe kwa mfany kazi wa kozi kwa {email}.

source: You have been removed as a beta tester for {course_name} at {site_name} by a member of the course staff. The course will remain on your dashboard, but you will no longer be part of the beta testing group.
sw_ke: Umeondolewa kutoka kuwa mtumiaji wa mwanzo wa {course_name} kwa {site_name} na mmoja wa walimu wa kozi. Kozi itabaki kwenye dashibodi yako, lakini hutakuwa miongoni mwa kundi la watuamiaji wa mwanzo.

source: Your other courses have not been affected.
sw_ke: Kozi zako nyingine hazija athirika.

source: You have been removed from a beta test for {course_name}
sw_ke: Umeondolewa kutoka kuwa mtumiaji wa mwanzo wa kozi ya {course_name}

source: We have successfully verified your identity for the {assessment} assessment in the {course_name} course.
sw_ke: Tumefanikiwa kuhakiki kitambulisho chako kwa {assessment} kwa ajili ya tathmini ya kozi {course_name}.

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity.
sw_ke: Hatukueweza kuthibitisha kitambulisho chako kwa {assessment} tathmini katika kozi ya {course_name}. Umetumia majaribio {used_attempts} kati ya majaribio {allowed_attempts} ya kuhakiki kitambulisho chako.

source: You must verify your identity before the assessment closes on {due_date}.
sw_ke: Lazima uthibitishe kabla ya tathmini kufungwa ifikapo tarehe {due_date}.

source: To try to verify your identity again, select the following link:
sw_ke: Kujaribu kuthibitisha tena, chagua kiungo-wavuti ufuatao:

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity, and verification is no longer possible.
sw_ke: Hatukuweza kuthibitisha kitambulisho chako kwa ajili ya {assessment} kwenye kozi {course_name}. Umetumia majaribio {used_attempts} kati ya majaribio yaliyoruhusiwa {allowed_attempts} katika kuhahiki kitambulisho chako, na uhakiki hauwezekani tena.

source: To go to the courseware, select the following link:
sw_ke: Kwenda kwa Maudhui ya kozi, chagua uunganishi ufuatao:

source: If you have any questions, you can contact student support at {support_link}.
sw_ke: Kama una maswali yoyote, unaweza kuwasiliana na usaidizi wa wanafunzi kwenye {support_link}.

source: Thanks,
sw_ke: Asante,

source: Dear Student,
sw_ke: Mpendwa Mwanafunzi,

source: You have been un-enrolled from course {course_name} by a member of the course staff. Please disregard the invitation previously sent.
sw_ke: Usajili wako umetenguliwa kutoka kwenye kozi {course_name} na mmoja wa walimu wa kozi. Tafadhali puuza mwito uliotumwa kwako mbeleni.

source: You have been un-enrolled in {course_name} at {site_name} by a member of the course staff. The course will no longer appear on your {site_name} dashboard.
sw_ke: Usajili wako umetenguliwa kwenye {course_name} kwa {site_name} na mmoja wa walimu wa kozi. Kozi haitatokeza tena kwenye dashibodi {site_name} yako.

source: You have been un-enrolled from {course_name}
sw_ke: Usajili wako umetenguliwa kutoka kwa {course_name}

source: This Course Unavailable In Your Country
sw_ke: Kozi hii Haipatikana Nchini Mwako

source: Our system indicates that you are trying to access this {platform_name} course from a country or region in which it is not currently available.
sw_ke: Mfumo wetu unaonesha kuwa unajaribu kufikia kozi hii {platform_name} kutoka taifa au jimbo ambalo kozi haipatikani kwa sasa.

source: Our system indicates that you are trying to enroll in this {platform_name} course from a country or region in which it is not currently available.
sw_ke: Mfumo wetu unaonesha kuwa unajaribu kusajili katika kozi hii {platform_name} kutoka taifa au jimbo ambalo kozi haipatikani kwa sasa.

source: Enrollment Successful
sw_ke: Usajili Umefanikiwa

source: {platform_name} is a nonprofit bringing high-quality education to everyone, everywhere. Your help allows us to continuously improve the learning experience for millions and make a better future one learner at a time.
sw_ke: {platform_name} sio la kupata faida na linaleta elimu ya hali ya juu kwa kila mtu, kila mahali. Msaada wako unaturuhusu sisi kuendelea kuboresha ujuzi wa mafunzo kwa mamilioni na kuboresha maisha ya baadae kwa mwanafunzi mmoja kwa wakati maalum.

source: Donation Actions
sw_ke: Matendo ya Michango

source: Financial Assistance Application
sw_ke: Ombi la Msaada wa Fedha

source: A Note to Learners
sw_ke: Ilani kwa Wanafunzi

source: Dear edX Learner,
sw_ke: Mpendwa Mwanafunzi wa edX,

source: EdX Financial Assistance is a program we created to give learners in all financial circumstances a chance to earn a Verified Certificate upon successful completion of an edX course.
sw_ke: Msaada wa Kifedha wa edX ni mpango uliobuniwa kuwapatia wanafunzi wote walio katika hali ngumu za kifedha nafasi kujipatia Cheti kilicho Thibitishwa pindi wanapofaulu kumaliza kozi ya edX.

source: If you are interested in working toward a Verified Certificate, but cannot afford to pay the fee, please apply now. Please note that financial assistance is limited and may not be awarded to all eligible candidates.
sw_ke: Kama unapendelea kujibidiisha kwa lengo la kupata Cheti kilicho na Uthibitisho, lakini huwezi kugharamia karo, tafadhali tuma maombi sasa. Tafadhali tambua kuwa msaada wa kifedha una ukomo na unaweza usitolewe kwa kila mwombaji anestahili.

source: In order to be eligible for edX Financial Assistance, you must demonstrate that paying the Verified Certificate fee would cause you economic hardship. To apply, you will be asked to answer a few questions about why you are applying and how the Verified Certificate will benefit you.
sw_ke: Ili ustahili kwa msaada wa kifedha wa edX, lazima uoneshe kuwa ulipaji wako wa karo ya Cheti kilicho Thibitishwa utasababisha hali ngumu zaidi ya kiuchumi. Kutuma maombi, utaulizwa ujibu masuali kidogo kuhusu kwanini unaomba msaada na vipi Cheti kilicho na Uthibitisho kitakunufaisha wewe.

source: If your application is approved, we'll give you instructions for verifying your identity on edx.org so you can start working toward completing your edX course.
sw_ke: Kama maombi yako yataidhinishwa / yatapitishwa, tutakupa maagizo ya kuthibitisha kitambulisho chako kwenye edx.org ili uweze kuanza kukamilisha kozi yako ya edX.

source: EdX is committed to making it possible for you to take high quality courses from leading institutions regardless of your financial situation, earn a Verified Certificate, and share your success with others.
sw_ke: EdX imejitolea kukuwezesha kuchukuwa / kufanya / kupata mafunzo bora zaidi ya kozi kutoka kwa taasisi zinaongoza licha ya hali yako duni ya kifedha, pata Cheti kilicho na Uthibitisho, na shirikisha wengine kwenye ufanisi wako.

source: Sincerely, Anant
sw_ke: Wako mwaminifu, Anant

source: Back to Student FAQs
sw_ke: Rudi kwenye FAQs za Wanafunzi

source: Apply for Financial Assistance
sw_ke: Tuma maombi ya Msaada wa Fedha

source: Add Coupon Code
sw_ke: Ongeza Namba ya Kuponi

source: Enter information about the coupon code below.
sw_ke: Ingiza taarifa kuhusu namba ya kuponi hapo chini.

source: Discount Percentage
sw_ke: Asilimia ya Punguzo

source: Add expiration date
sw_ke: Ongeza Tarehe ya mwisho kutumika

source: Example Certificates
sw_ke: Vyeti Mfano

source: Generate example certificates for the course.
sw_ke: Zalisha vyeti mfano vya kozi.

source: Generate Example Certificates
sw_ke: Zalisha Vyeti Mfano

source: Status:
sw_ke: Hali halisi:

source: Generating example {name} certificate
sw_ke: Inazalisha vyeti {name} mfano

source: Error generating example {name} certificate: {error}
sw_ke: Hitilafu katika uzalishaji wa vyeti {name} mfano: {error}

source: View {name} certificate
sw_ke: Angalia {name} cheti

source: Refresh Status
sw_ke: Onesha upya Hali halisi

source: Student-Generated Certificates
sw_ke: Vyeti vilivyo Zalishwa na Wanafunzi

source: Disable Student-Generated Certificates
sw_ke: Lemaza Uzalishaji wa Vyeti kwa Wanafunzi

source: Enable Student-Generated Certificates
sw_ke: Wezesha Uzalishaji wa Vyeti kwa Wanafunzi

source: You must successfully generate example certificates before you enable student-generated certificates.
sw_ke: Lazima ufaulu kuzalisha vyeti mfano kabla kuwezesha wanafunzi kuzalisha vyeti.

source: Generate Certificates
sw_ke: Zalisha Vyeti

source: Course certificate generation requires an activated web certificate configuration.
sw_ke: Uzalishaji wa vyeti vya kozi unahitaji mtandao uliamshwa wa mpangilio wa kuzalisha vyeti.

source: When you are ready to generate certificates for your course, click Generate Certificates. You do not need to do this if you have set the certificate mode to on-demand generation.
sw_ke: Ukiwa tayari kuzalisha cheti cha kozi yako, bofya Zalisha Vyeti. Huhitaji kufanya hivi kama umetegesha mtindo wa utoaji cheti kinapohitajika.

source: Pending Tasks
sw_ke: Majukumu Yanayo subiri Maamuzi

source: The status for any active tasks appears in a table below.
sw_ke: Hali halisi ya jukumu lolote hai linatokeza kwenye jedwali hapo chini.

source: Regenerate Certificates
sw_ke: Zalisha upya Vyeti

source: To regenerate certificates for your course, choose the learners who will receive regenerated certificates and click Regenerate Certificates.
sw_ke: Kuzalisha upya vyeti vya kozi yako, chagua wanafunzi ambao watapokea vyeti vilivyozalishwa upya na bofya Zalisha upya Vyeti.

source: Choose learner types for regeneration
sw_ke: Chagua aina ya uzalishaji upya wa mwanafunzi

source: Regenerate for learners who have already received certificates. ({count})
sw_ke: Zalisha Upya kwa Wanafunzi ambao tayari wamepokea vyeti.({count})

source: Regenerate for learners who have not received certificates. ({count})
sw_ke: Zalisha Upya kwa wanafunzi ambao hawajapokea vyeti.({count})

source: Regenerate for learners with audit passing state. ({count})
sw_ke: Zalisha upya kwa wanafunzi wenye nafasi ya kufanikiwa. ({count})

source: Regenerate for learners with audit not passing state. ({count})
sw_ke: Zalisha upya kwa wanafunzi wenye nafasi ya kutofanikiwa. ({count})

source: Regenerate for learners in an error state. ({count})
sw_ke: Zalisha Upya kwa wanafunzi walioko katika hali ya hitilafu.({count})

source: Certificate Generation History
sw_ke: Historia ya Uzalishaji wa Vyeti

source: Task name
sw_ke: Jina la jukumu

source: SET CERTIFICATE EXCEPTIONS
sw_ke: WEKA UMAALUM WA VYETI

source: Set exceptions to generate certificates for learners who did not qualify for a certificate but have been given an exception by the course team. After you add learners to the exception list, click Generate Exception Certificates below.
sw_ke: Weka ada maalum ya uzalishaji wa vyeti kwa wanafunzi ambao hawakufaulu kwa vyeti lakini wamepewa umaalumu na kikosi cha kozi. Baada ya kuongeza wanafunzi katika orodha ya vyeti maalum, bofya Zalisha Vyeti Maalum hapo chini.

source: Invalidate Certificates
sw_ke: Vyeti Batili

source: Enrollment Information
sw_ke: Taarifa ya Usajili

source: Number of enrollees (admins, staff, and students) by track
sw_ke: Idadi ya waliosajili (wasimamizi, wafanyakazi, na wanafunzi) kwa ufuatiliaji

source: Professional
sw_ke: Mtaalamu

source: Basic Course Information
sw_ke: Taarifa za Msingi za Kozi

source: Course Name:
sw_ke: Jina la Kozi:

source: Course Display Name:
sw_ke: Jina la Wazi la Kozi:

source: Course End Date:
sw_ke: Tarehe ya Kumalizika kwa Kozi:

source: No end date set
sw_ke: Hakuna tarehe ya kumaliza/mwisho iliyo wekwa

source: Has the course started?
sw_ke: Kozi imeanza?

source: Yes
sw_ke: Ndio

source: No
sw_ke: La / Hapana

source: Has the course ended?
sw_ke: Kozi imemalizika?

source: Number of sections:
sw_ke: Idadi ya sehemu:

source: Grade Cutoffs:
sw_ke: Punguza Daraja:

source: View detailed Git import logs for this course {link_start}by clicking here{link_end}.
sw_ke: Angalia tondoti za habari za mapokezi ya Git kwa kozi hii {llink_start}kwa kubonyeza hapa{link_end}.

source: Course Warnings
sw_ke: Maonyo ya Kozi

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
sw_ke: Bofya uoneshe mpangilio wa kutoa daraja kwa kozi. Mpangilio wa daraja ni mgawanyiko wa vifungu vidogo vya daraja kwenye kozi (kama mapote ya mitihani na matatizo), na yanaweza kubadilishwa kwenye ukurasa wa 'Utoaji Daraja' (chini ya 'Mitegesho') katika Studio.

source: Grading Configuration
sw_ke: Jinsi ya Kupanga Madaraja

source: Click to download a CSV of anonymized student IDs:
sw_ke: Bofya kupakua CSV ya Vitambulisho vya wwanafunzi asiyejulikana:

source: Get Student Anonymized IDs CSV
sw_ke: Pata CSV ya Vitambulisho vya Wanafunzi Wasiojulikana

source: Reports
sw_ke: Taarifa / Habari

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
sw_ke: Kwa kozi pana, uzalishaji wa nyaraka unaweza kuchukua saa kadhaa. Uzalishaji wa nyaraka unapokamilika, kiunganishi kilicho na tarehe na wakati wa uzalishaji kinatokea kwenye meza hapo chini. Nyaraka hizi zina zalishwa kwenye usuli, kumaanisha ni SAWA kuabiri nje ya ukurasa huu wakati ambao nyaraka zinaendelea kuzalishwa.

source: Please be patient and do not click these buttons multiple times. Clicking these buttons multiple times will significantly slow the generation process.
sw_ke: Tafadhali kuwa mvumilivu / na subira na usibofye hiki kitufe mara kwa mara. Ukibofya hiki kitufe mara kwa mara utazorotesha mchakato wa uzalishaji.

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
sw_ke: Bofya uzalishe faili la CSV la wanafunzi wote waliosajili katika kozi hii, pamoja na habari za wasifu kama anwani za barua pepe na jina la mtumiaji:

source: Download profile information as a CSV
sw_ke: Pakua taarifa za wasifu kama CSV

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
sw_ke: Bofya uzalishe faili la CSV ambalo limeorodhesha wanafunzi katika kozi lakini hawajafanya hivyo.

source: Download a CSV of learners who can enroll
sw_ke: Pakua CSV ya wanafunzi ambao wanaweza kujiandikisha

source: Click to generate a CSV file of all proctored exam results in this course.
sw_ke: Bofya kuzalisha faili la CSV la majibu ya mtihani katika kozi hii.

source: Generate Proctored Exam Results Report
sw_ke: Zalisha Ripoti ya Matokeo ya Mtihani Uliofanywa

source: Click to generate a CSV file of survey results for this course.
sw_ke: Bonyeza kuzalisha faili la CSV la matokeo ya utafiti wa kozi hii.

source: Generate Survey Results Report
sw_ke: Zalisha Ripoti ya Matokeo ya Utafiti

source: To generate a CSV file that lists all student answers to a given problem, enter the location of the problem (from its Staff Debug Info).
sw_ke: Kuzalisha faili la CSV ambayo inaorodhesha majibu ya wanafunzi ya swali waliloulizwa, ingiza mahali tatizo lilipo ( kutokana na Taarifa ya Hitilafu zilizotolewa na Wafanyakazi).

source: Problem location:
sw_ke: Sehemu ambayo Tatizo lipo:

source: Download a CSV of problem responses
sw_ke: Pakua CSV ya majibu ya swali

source: Click to list certificates that are issued for this course:
sw_ke: Bonyeza kuorodhesha vyeti vinavyo tolewa kwa kozi hii:

source: View Certificates Issued
sw_ke: Tizama Vyeti Vilivyotolewa

source: Download CSV of Certificates Issued
sw_ke: Pakua CSV ya Vyeti Vilivyotolewa

source: For smaller courses, click to list profile information for enrolled students directly on this page:
sw_ke: Kwa kozi ndogo ndogo, bofya uorodheshe habari za wasifu wa wanafunzi waliosajili moja kwa moja kwenye ukurasa huu:
