Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: List enrolled students' profile information
sw_ke: Orodhesha taarifa za wasifu wa wanafunzi waliosajiliwa

source: Click to generate a CSV grade report for all currently enrolled students.
sw_ke: Bofya uzalishe waraka wa daraja la CSV kwa wanafunzi wote waliosajiliwa.

source: Generate Grade Report
sw_ke: Zalisha Taarifa ya Daraja

source: Generate Problem Grade Report
sw_ke: Zalisha Habari za Matatizo ya Daraja

source: Generate ORA Data Report
sw_ke: Zalisha Ripoti ya Data za ORA

source: Reports Available for Download
sw_ke: Ripoti Iliyopo kwa ajili ya Kupakuliwa

source: The reports listed below are available for download. A link to every report remains available on this page, identified by the UTC date and time of generation. Reports are not deleted, so you will always be able to access previously generated reports from this page.
sw_ke: Habari zilizo orodheshwa hapo chini zapatikana kwa upakuaji. Kiungo-wavuti cha kila habari kipatikana kwenye ukurasa huu, zikitambuliwa kwa tarehe na wakati wa UTC ya uzalishaji. Habari hazifutwi, kwa hivyo daima utaweza kufikia habari zilizotangulia kuzalishwa kutoka kwenye ukurasa huu.

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
sw_ke: Orodha ya habari za usambazaji wa majibu hapo chini unazalishwa kwa muhula na utayarishaji wakiwenyewe wa asili. Habari ni za mkusanyiko, kwa hivyo majibu yaliyofikishwa baada ya shughuli kuanza zinajumlisha kwenye habari za mpangilio mdogo. Habari zinazalishwa mara kadhaa kwa kila siku moja.

source: {strong_start}Note{strong_end}: To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.
sw_ke: {strong_start}Zingatia{strong_end}: Kuweka taarifa za mwanafunzi salama, huwezi kuhifadhi au kuvituma kwa barua pepe viunganishi hivi ili kuvipata moja kwa moja. Nakala za viunganishi hudumu kwa muda wa dakika 5.

source: Enrollment Codes
sw_ke: Namba za Usajili

source: Create one or more pre-paid course enrollment codes. Students can use these codes to enroll in the course.
sw_ke: Tengeneza moja au zaidi ya vificho vya malipo kabla kwa usajili wa kozi. Wanafunzi wanaweza kutumia vificho hivi kujisajili katika kozi.

source: Create Enrollment Codes
sw_ke: Buni Vificho vya Usajili

source: Cancel, restore, or mark an enrollment code as unused.
sw_ke: Futa, rudisha upya, au weka alama namba za usajili kama hazijatumika.

source: Change Enrollment Code Status
sw_ke: Badilisha Hali ya Namba za Usajili

source: Download a .csv file of all enrollment codes for this course.
sw_ke: Pakua faili la .csv ya vificho vyote vya usajili vya kozi hii.

source: Download All Enrollment Codes
sw_ke: Pakua Namba Zote za Usajili

source: Download a .csv file of all unused enrollment codes for this course.
sw_ke: Pakua faili la .csv la vificho vyote havijatumika vya kozi hii.

source: Download Unused Enrollment Codes
sw_ke: Pakua Namba za Usajili Zisizotumika

source: Download a .csv file of all used enrollment codes for this course.
sw_ke: Pakua faili la .csv na vificho vyote vya usajili vilivyotumika katika kozi hii.

source: Download Used Enrollment Codes
sw_ke: Pakua Namba za Usajili Zilizotumika

source: Course Price
sw_ke: Bei ya Kozi

source: Course price per seat:
sw_ke: Bei ya kozi kwa kila kikao:

source: Edit Price
sw_ke: Hariri Bei

source: Course Seat Purchases
sw_ke: Ununuzi wa Kikao cha Kozi

source: Total Credit Card Purchases:
sw_ke: Jumla ya Ununuzi kupitia Kadi za Malipo:

source: Download a .csv file for all credit card purchases or for all invoices, regardless of status.
sw_ke: Pakua faili ya .csv kwa ununuzi kupitia kadi zote za malipo au kwa ankara zote, licha ya hali halisi ilivyo.

source: Download All Invoices
sw_ke: Pakua bili zote

source: Download All Credit Card Purchases
sw_ke: Pakua ununuzi wote wa kupitia kadi za kukopea

source: To cancel or resubmit an invoice, enter the invoice number below.
sw_ke: Kubatilisha au kuwasilisha tena bili, ingiza namba ya bili hapo chini.

source: Invoice Number
sw_ke: Nambari ya Ankara

source: Cancel Invoice
sw_ke: Futa Ankara

source: Resubmit Invoice
sw_ke: Fikisha upya Ankara

source: Create a .csv file that contains enrollment information for your course.
sw_ke: Tengeneza faili la .csv lenye taarifa za usajili kwa ajili kozi yako.

source: Create Enrollment Report
sw_ke: Tengeneza Ripoti za Usajili

source: Create an HTML file that contains an executive summary for this course.
sw_ke: Tengeneza faili la HTML lenye muhtasari mkuu kwa ajili ya kozi hii.

source: Create Executive Summary
sw_ke: Tengeneza Muhtasari kwa Mkuu

source: Available Reports
sw_ke: Habari ziliopo

source: The following reports are available for download. Reports are not deleted. A link to every report remains available on this page, identified by the date and time (in UTC) that the report was generated.
sw_ke: Taarifa ifuatayo ipo tayari kwa ajili ya kupakuliwa. Taarifa/Ripoti hazifutwi. Muunganiko wa kila ripoti unapatikana kwenye huu ukurasa, inayotambuliwa na tarehe na muda (wa UTC) ambazo ripoti ilizalishiwa.

source: {strong_start}Note{strong_end}: To help protect learner data, links to these reports that you save outside of this page or that you send or receive in email expire after five minutes.
sw_ke: {strong_start}Zingatia{strong_end}: Ili kulinda taarifa za mwanafunzi, viunganishi vya kwenye ripoti hizi unazohifadhi nje ya ukurasa au unaotuma au unaopokea kwenye barua pepe hupotea baada ya dakika tano.

source: Coupon Code List
sw_ke: Orodha ya Namba za Kuponi

source: Download a .csv file of all coupon codes for this course.
sw_ke: Pakua faili ya .csv ya vificho vya kuponi zote katika kozi hii.

source: Download Coupon Codes
sw_ke: Pakua Namba za Kuponi

source: Coupon Codes
sw_ke: Tambulizi ya Koponi

source: Coupon (%)
sw_ke: Kuponi (%)

source: Number Redeemed
sw_ke: Namba iliyokombolewa

source: The Invoice Number field cannot be empty.
sw_ke: Sehemu ya namba ya bili haiwezi kuwa wazi.

source: No Expiration Date
sw_ke: Hakuna Tarehe ya Mwisho

source: Enter the company name.
sw_ke: Ingiza / Weka jina la kampuni.

source: The company name cannot be a number.
sw_ke: Jina la kampuni haliwezi kuwa na namba.

source: Enter the company contact name.
sw_ke: Ingiza / Weka jina la mawasiliano ya kampuni.

source: The company contact name cannot be a number.
sw_ke: Jina la mawasiliano kwa kampuni haliwezi kuwa na namba.

source: Enter the email address for the company contact.
sw_ke: Weka/Ingiza anwani ya barua pepe ya mawasiliano ya kampuni.

source: Enter a valid email address.
sw_ke: Weka anwani ya barua pepe itumikayo.

source: Enter the recipient name.
sw_ke: Ingiza / Weka jina la mpokeaji.

source: The recipient name cannot be a number.
sw_ke: Jina la mpokeaji haliwezi kuwa na namba.

source: Enter the recipient email address.
sw_ke: Ingiza / Weka anwani ya barua pepe ya mpokeaji.

source: Enter the billing address.
sw_ke: Ingiza / Weka anwani ya mlipaji.

source: Enter the price per course seat.
sw_ke: Ingiza bei kwa kila kikao cha kozi.

source: Enter a numeric value for the price per course seat. Do not include currency symbols.
sw_ke: Ingiza tathmini ya namba kwa bei ya kila kikao cha kozi. Usiingize alama za sarafu.

source: Enter the number of enrollment codes.
sw_ke: Ingiza idadi ya namba ya waliosajiliwa.

source: Enter a numeric value for the number of enrollment codes.
sw_ke: Ingiza thamani ya namba kwa ajili ya idadi ya msimbo wa usajili.

source: Select a currency.
sw_ke: Chagua sarafu.

source: Enter a coupon code.
sw_ke: Ingiza namba ya kuponi.

source: The discount percentage must be less than or equal to 100.
sw_ke: Punguzo linatakiwa liwe chini ya asilimia au sawa 100.

source: Enter a numeric value for the discount amount. Do not include the percent sign.
sw_ke: Ingiza thamani ya namba ya kiasi cha punguzo. Usiweke alama ya asilimia.

source: Edit Coupon Code
sw_ke: Hariri Namba ya Kuponi

source: Edit Coupon Code Information
sw_ke: Hariri Taarifa ya Namba ya Kuponi

source: Code
sw_ke: Namba

source: example: A123DS
sw_ke: mfano: A123DS

source: Percentage Discount
sw_ke: Punguzo la Asilimia

source: Update Coupon Code
sw_ke: Sasisha Namba ya Kuponi

source: Executive Summary for {display_name}
sw_ke: Muhtasari Mkuu kwa ajili ya {display_name}

source: Report Creation Date
sw_ke: Toa Taarifa kuhusu Tarehe ya Utengenezaji

source: Number of Seats
sw_ke: Idadi ya Vikao

source: Number of Enrollments
sw_ke: Idadi ya Usajili

source: Gross Revenue Collected
sw_ke: Jumla Kuu ya Mapato Yaliyokusanywa

source: Gross Revenue Pending
sw_ke: Jumla Kuu ya Mapato Yanayohitaji Kushughulikiwa

source: Number of Enrollment Refunds
sw_ke: Idadi ya Marejesho ya Fedha kwa Waliosajiliwa

source: Amount Refunded
sw_ke: Kiasi cha Fedha Zilizorudishwa

source: Average Price per Seat
sw_ke: Bei Wastani kwa kila Kikao

source: Frequently Used Coupon Codes
sw_ke: Namba za Kuponi Zilizotumika mara kwa mara

source: Number of seats purchased using coupon codes
sw_ke: Idadi ya vikao vilivyo nunuliwa kutumia namba za kuponi

source: Rank
sw_ke: Cheo

source: Percent Discount
sw_ke: Asilimia ya Upunguzaji bei kwa Maridhiano

source: Times Used
sw_ke: Mara zilizo Tumika

source: Bulk and Single Seat Purchases
sw_ke: Ununuzi wa kikao Kimoja na kwa Wingi

source: Number of seats purchased individually
sw_ke: Idadi ya vikao vilivyo nunuliwa kibinafsi

source: Number of seats purchased in bulk
sw_ke: Idadi ya vikao vilivyo nunuliwa kwa wingi

source: Number of seats purchased with invoices
sw_ke: Idadi ya vikao vilivyo nunuliwa kwa ankara

source: Unused bulk purchase seats (revenue at risk)
sw_ke: Vikao vilivyo nunuliwa kwa wingi ambavyo havijatumika (mapato yaliyo hatarini)

source: Percentage of seats purchased individually
sw_ke: Asilimia ya vikao vilivyo nunuliwa kibinafsi

source: Percentage of seats purchased in bulk
sw_ke: Asilimia ya vikao vilivyo nunuliwa kwa wingi

source: Percentage of seats purchased with invoices
sw_ke: Asilimia ya jozi zilizonunuliwa kwa ankara

source: Individual due date extensions
sw_ke: Tarehe za mwisho zilizoongezwa kwa kila mmoja

source: In this section, you have the ability to grant extensions on specific units to individual students. Please note that the latest date is always taken; you cannot use this tool to make an assignment due earlier for a particular student.
sw_ke: Katika kifungu hiki, una uwezo kuidhinisha uongezaji wa vitengo maalum mpaka kwa wanafunzi. Tafadhali tambua ya kwamba tarehe ya mwisho kawaida ina chukuliwa; huwezi kutumia chombo hiki kufanya kazi iliyotolewa kumalizika mapema kwa mwanafunzi fulani.

source: Specify the {platform_name} email address or username of a student here:
sw_ke: Onyesha {platform_name} anwani ya barua pepe au jinatumishi la mwanafunzi hapa:

source: Student Email or Username
sw_ke: Anwani ya Barua pepe au Jinatumishi

source: Choose the graded unit:
sw_ke: Chagua kitu kilichopewa alama:

source: Specify the extension due date and time (in UTC; please specify {format_string}).
sw_ke: Taja tarehe na mda iliyoongezwa (in UTC; please specify {format_string}).

source: Change due date for student
sw_ke: Badilisha tarehe ya mwanafunzi ya kumaliza

source: Viewing granted extensions
sw_ke: Kuangalia nyongeza iliyotolewa

source: Here you can see what extensions have been granted on particular units or for a particular student.
sw_ke: Hapa unaweza kuona nyongeza iliyotolewa kwa kila kimoja au kwa kila mwanafunzi.

source: Choose a graded unit and click the button to obtain a list of all students who have extensions for the given unit.
sw_ke: Chagua fomu na bofya kitufe kupata orodha ya wanafunzi wote waliopata ongezeko kwa kila kitu alichopewa.

source: List all students with due date extensions
sw_ke: Orodhesha wanafunzi wote na tarehe zilizorekebishwa.

source: Specify a student to see all of that student's extensions.
sw_ke: Chagua mwanafunzi ili uweze kuona ongezeko la mwanafunzi.

source: List date extensions for student
sw_ke: Orodhesha tarehe iliyoongezwa kwa mwanafunzi

source: Resetting extensions
sw_ke: Kurekebisha ongezeko

source: Resetting a problem's due date rescinds a due date extension for a student on a particular unit. This will revert the due date for the student back to the problem's original due date.
sw_ke: Uwekaji upya wa tarehe ya mwisho ya tatizo una tangua tarehe ya mwisho wa maongezi kwa mwanafunzi kwenye kitengo maalum. Hii itarudisha tarehe ya mwisho kwa mwanafunzi kwa tarehe ya mwisho asili.

source: Reset due date for student
sw_ke: Rekebisha tarehe husika kwa wanafunzi

source: Generate Registration Code Modal
sw_ke: Elezea hali ya namba ya kujisajili

source: * Required Information
sw_ke: Taarifa Inayohitajika

source: Organization Name
sw_ke: JIna la Shirika

source: The organization that purchased enrollments in the course
sw_ke: Shikirika lililonunua usajili katika kozi

source: Organization Contact
sw_ke: Mawasiliano kwa Shirika

source: Organization Contact Name
sw_ke: Jina la Mawasiliano ya Shirika

source: The primary contact at the organization
sw_ke: Chanzo cha mawasiliano kwenye shirika

source: Invoice Recipient
sw_ke: Mpokeaji wa Ankara

source: The contact who should receive the invoice
sw_ke: Mawasiliano ya atakaepokea ankara

source: Organization Billing Address
sw_ke: Anwani ya kutuma Gharama za Shirika

source: Address Line 1
sw_ke: Mstari 1 wa Anwani

source: Address Line 2
sw_ke: Mstari 2 wa Anwani

source: Address Line 3
sw_ke: Mstari 3 wa Anwani

source: State/Province
sw_ke: Jimbo/Mkoa

source: Unit Price
sw_ke: Bei ya Kitu kimoja

source: The price per enrollment purchased
sw_ke: Bei kwa kila manunuzi yaliyosajiliwa

source: Number of Enrollment Codes
sw_ke: Idadi ya Namba za Usajili

source: The total number of enrollment codes to create
sw_ke: Jumla ya namba za usajili za kutengenezwa

source: Course Team Internal Reference
sw_ke: Ashirio za Ndani kwa Waliomo kwenye Kozi

source: Internal reference information for the sale
sw_ke: Marejeo ya ndani ya taarifa za mauzo

source: Customer Reference
sw_ke: Rejeo la Mteja

source: Customer's purchase order or other reference information
sw_ke: Orodha ya mahitaji ya Mteja au marejeo ya taarifa nyingine

source: Send me a copy of the invoice
sw_ke: Nitumie nakala ya ankara

source: For analytics about your course, go to {link_start}{analytics_dashboard_name}{link_end}.
sw_ke: Kwa uchanganuzi kuhusu kozi yako, tembelea {link_start}{analytics_dashboard_name}{link_end}.

source: Instructor Dashboard
sw_ke: Dashboard ya Mkufunzi

source: View Course in Studio
sw_ke: Angalia Kozi kwenye Studio

source: Enrollment Code Status
sw_ke: Hali ya Namba ya Usajili

source: Change the status of an enrollment code.
sw_ke: Badilisha hali ya namba ya usajili.

source: Enrollment Code
sw_ke: Namba ya Usajili

source: Find Enrollment Code
sw_ke: Tafuta Namba ya Usajili

source: Enter the reason why the students are to be manually enrolled or unenrolled.
sw_ke: Weka sababu ya kwanini wanafunzi watasajiliwa au kufutwa kawaida.

source: This cannot be left blank and will be recorded and presented in Enrollment Reports.
sw_ke: Hii haiwezi kuachwa wazi na itarikodiwa na kuwasilishwa kwenye Repoti ya Usajili.

source: Therefore, please give enough detail to account for this action.
sw_ke: Hivyo, tafadhali toa taarifa za kutosha za kutilia maanani kwa hili tendo.

source: Reason
sw_ke: Sababu

source: Register/Enroll Students
sw_ke: Jiandikishe/Sajili Wanafunzi

source: To register and enroll a list of users in this course, choose a CSV file that contains the following columns in this exact order: email, username, name, and country. Please include one student per row and do not include any headers, footers, or blank lines.
sw_ke: Kuandikisha na kusajili orodha ya watumiaji katika kozi hii, chagua faili la CSV lililo na nguzo zifuatazo kwenye mpangilio kamili: barua pepe, jina la mtumiaji, jina, na nchi. Tafadhali weka mwanafunzi mmoja kwa kila mstari na usiweke vibwagizo vyovyote vya mwanzo, mwisho, au mistari mitupu.

source: Upload a CSV for bulk enrollment
sw_ke: Pakia CSV kwa uandikishaji mkubwa

source: Upload CSV
sw_ke: Pakia CSV

source: Batch Beta Tester Addition
sw_ke: Kuongeza Mtumiaji wa mwanzo mwenye sauti

source: Note: Users must have an activated {platform_name} account before they can be enrolled as beta testers.
sw_ke: Ilani: Watumiaji lazima wawe na akaunti hai ya {platform_name} kabla hawajawezeshwa kuwa watumiaji wa mwanzo.

source: Checking this box has no effect if 'Remove beta testers' is selected.
sw_ke: Kutizama hili sanduku hakuna athari kama 'Watumiaji wa mwanzo wameondolewa' itachaguliwa.

source: Add beta testers
sw_ke: Ongeza watumiaji wa mwanzo

source: Remove beta testers
sw_ke: Ondoa watumiaji wa mwanzo

source: Course Team Management
sw_ke: Usimamizi wa Waliomo kwenye Kozi

source: Select a course team role:
sw_ke: Chagua jukumu la waliomo kwenye kozi:

source: Getting available lists...
sw_ke: Kupata orodha iliopo...

source: Staff cannot modify these lists. To manage course team membership, a course Admin must give you the Admin role to add Staff or Beta Testers, or the Discussion Admin role to add discussion moderators and TAs.
sw_ke: Wafanyi kazi hawawezi kurekebisha orodha. Kumudu uwanachama wa kikosi cha kozi, kiongozi wa kozi lazima akupe Jukumu la Uongozi kuongeza Wafanya kazi au Watumiaji wa Zamani, au Jukumu la Kiongozi wa Mjadala la Kuongeza wasimamizi wa mjadala na TAs.

source: Course team members with the Staff role help you manage your course. Staff can enroll and unenroll learners, as well as modify their grades and access all course data. Staff also have access to your course in Studio and Insights. You can only give course team roles to enrolled users.
sw_ke: Majukumu ya Timu ya Wanachama wa kozi na Wafanyakazi yanakusaidia kumudu kozi. Wafanyakazi wanaweza kukusajili au kufuta usajili wa wanafunzi, pia kurekebisha alama zao na kupata taarifa za kozi. Wafanyakazi pia wanaona kozi yako Studio na Kutambua. Unaweza kuipa timu ya kozi pekee jukumu la kufuta watumiaji.

source: Add Staff
sw_ke: Ongeza Wafanyi kazi

source: Admin
sw_ke: Msimamizi

source: Course team members with the Admin role help you manage your course. They can do all of the tasks that Staff can do, and can also add and remove the Staff and Admin roles, discussion moderation roles, and the beta tester role to manage course team membership. You can only give course team roles to enrolled users.
sw_ke: Wanachama wa kikosi cha kozi walio na jukumu la Kuongoza wanakusaidia kumudu kozi yako. Wanaweza kufanya majukumu yote ambayo wafanyakazi wanaweza kufanya, na pia wanaweza kuongeza na kuondoa majukumu ya Wafanyakazi na Kiongozi, majukumu ya wasimamizi wa mijadala na majukumu ya watumiaji kumudu uanachama wa timu ya kozi. Unaweza kuwapa wanachama wa timu ya kozi pekee jukumu la kufuta watumiaji.

source: Add Admin
sw_ke: 'Ongeza' Msimamizi

source: Beta Testers
sw_ke: Watumiaji wa Mwanzo

source: Beta Testers can see course content before other learners. They can make sure that the content works, but have no additional privileges. You can only give course team roles to enrolled users.
sw_ke: Watumiaji wa mwanzo wanaweza kuona maudhui ya kozi kabla ya wanafunzi wengine. Wanaweza kuhakikisha maudhui inafaa, ila hawana upendeleo wa ziada. Unaweza kuwapa watumiaji waliosajiliwa majukumu ya timu ya kozi pekee.

source: Add Beta Tester
sw_ke: Ongeza Mtumiaji wa Mwanzo

source: Discussion Admins
sw_ke: Wasimamizi wa Majadiliano

source: Add Discussion Admin
sw_ke: Ongeza Msimamizi wa Majadiliano

source: Discussion Moderators
sw_ke: Waongozaji Majadiliano

source: Add Moderator
sw_ke: Ongeza Msimamizi

source: Add Community TA
sw_ke: Ongeza Jumuiya TA

source: CCX Coaches
sw_ke: Mkufunzi wa CCX

source: CCX Coaches are able to create their own Custom Courses based on this course, which they can use to provide personalized instruction to their own students based in this course material.
sw_ke: Makocha wa CCX wanaweza kubuni Kozi zao wenyewe kutokana na kozi hii, ambayo wanaweza kutumia kutoa maagizo ya kibinafsi kwa wanafunzi wao kutokana na vifaa vya kozi.

source: Add CCX Coach
sw_ke: 'Ongeza' Mkufunzi wa CCX

source: There is no data available to display at this time.
sw_ke: Hakuna taarifa zozote za kuonyesha kwasasa.

source: Use Reload Graphs to refresh the graphs.
sw_ke: Tumia grafu za Kupakia upya kuchangamsha grafu.

source: Reload Graphs
sw_ke: Pakia upya Grafu

source: Subsection Data
sw_ke: Taarifa za Vifungu vidogo

source: Each bar shows the number of students that opened the subsection.
sw_ke: KIla kitufe kinaonesha idadi ya wanafunzi waliofungua vipengele vidogo.

source: You can click on any of the bars to list the students that opened the subsection.
sw_ke: Unaweza kubofya kwenye kitufe chochote kuorodhesha wanafunzi waliofungua vifungu vidogo.

source: You can also download this data as a CSV file.
sw_ke: Pia unaweza kupakua hii taarifa kama faili la CSV.

source: Download Subsection Data for all Subsections as a CSV
sw_ke: Pakua Habari za Kifungu kidogo kwa Vifungu vyote kama CSV

source: Grade Distribution Data
sw_ke: Taarifa za Utoaji Alama

source: Each bar shows the grade distribution for that problem.
sw_ke: Kila kitufe kinaonesha utoaji wa alama kwa kila swali.

source: You can click on any of the bars to list the students that attempted the problem, along with the grades they received.
sw_ke: Unaweza kubofya kitufe chochote kuorodhesha wanafunzi waliojaribu kufanya swali, pamoja na alama walizopata.

source: Download Problem Data for all Problems as a CSV
sw_ke: Pakua Taarifa zote za Maswali kwa Maswali yote kama CSV

source: Grade Distribution per Problem
sw_ke: Utoaji wa Alama kwa kila Swali

source: Download Student Opened as a CSV
sw_ke: Pakua Wanafunzi Waliofungua kama CSV

source: Download Student Grades as a CSV
sw_ke: Pakua Alama za Wanafunzi kama CSV

source: This is a partial list, to view all students download as a csv.
sw_ke: Hii ni baadhi ya orodha, kutizama wanafunzi wote pakua kama csv.

source: There are no problems in this section.
sw_ke: Hamna matatizo katika kitengo hiki.

source: Send to:
sw_ke: Tuma kwa:

source: Myself
sw_ke: Mimi mwenyewe

source: Staff and Administrators
sw_ke: Wafanyakazi na Watawala

source: All Learners
sw_ke: Wanafunzi wote

source: Cohort:
sw_ke: Kundi:

source: (Learners not explicitly assigned to a cohort)
sw_ke: (Wanafunzi hawakuwekwa kwenye kundi)

source: Learners in the {track_name} Track
sw_ke: Wanafunzi wako kwenye Orodha ya {track_name}

source: Subject:
sw_ke: Maudhui:

source: (Maximum 128 characters)
sw_ke: (Kiwango cha juu ni herufi 128)

source: Message:
sw_ke: Ujumbe:

source: We recommend sending learners no more than one email message per week. Before you send your email, review the text carefully and send it to yourself first, so that you can preview the formatting and make sure embedded images and links work correctly.
sw_ke: Tunashauri idadi ya barua pepe kutumwa kwa wanafunzi isizidi moja. Kabla ya kutuma barua pepe yako, pitia tena maandishi kwa makini na yatume kwenye anwani yako kwanza kuangalia fomati na hakikisha picha na viungo-wavuti vimewekwa kwa usahihi. .

source: CAUTION!
sw_ke: TAHADHARI!

source: When you select Send Email, your email message is added to the queue for sending, and cannot be cancelled.
sw_ke: Unapochagua Tuma Barua pepe, barua pepe yako inaongezwa kwenye orodha ya barua zinazotumwa, na haitaaghirishwa kutumwa.

source: Send Email
sw_ke: Tuma Barua pepe
