Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: sw_ke

source: My Notes
sw_ke: Maandishi yangu/Nukuu/Arafa zangu

source: Instructor
sw_ke: Muagizi

source: Public
sw_ke: Hadharani/Paruanja

source: Search
sw_ke: Tafuta

source: Users
sw_ke: Watumiaji

source: Tags
sw_ke: Vitambulisho

source: Annotation Text
sw_ke: Ujumbe wa Nukuu

source: Clear
sw_ke: Safi/Ondoa

source: Text
sw_ke: Ujumbe

source: Image
sw_ke: Taswira

source: Reply
sw_ke: Jibisha

source: Tags:
sw_ke: Vibandiko vya alama:

source: Check the box to remove all flags.
sw_ke: Tizama kisanduku uondoe bendera zote.

source: Check the box to remove %(totalFlags)s flag.
sw_ke: Angalia kisanduku uondoe %(totalFlags)s bendera.

source: Check the box to remove %(count)s flag.
sw_ke: Angali kisanduku uondoe %(count)s bendera.

source: All flags have been removed. To undo, uncheck the box.
sw_ke: Bendera zote zimeondolewa. Kuirudisha ilivyo kuwa, usitizame kisanduku.

source: You have already reported this annotation.
sw_ke: Tayari umeelezea kuhusu nukuu hii.

source: Report annotation as inappropriate or offensive.
sw_ke: Elezea nukuu kama sio sawa au inahujumu.

source: This annotation has %(count)s flag.
sw_ke: Fafanuzi hii ina bendera %(count)s.

source: An unexpected error occurred. Please try again.
sw_ke: Hitlafu isio tarajiwa imetokea. Tafadhali jaribu tena.

source: Financial Assistance
sw_ke: Msaada wa Kifedha

source: Upset Learner
sw_ke: Kuudhi Mwanagenzi

source: Teaching Assistant
sw_ke: Mkufunzi

source: Please specify a reason.
sw_ke: Tafadhali fafanua sababu.

source: Something went wrong changing this enrollment. Please try again.
sw_ke: Kulikuwa na hitlafu kubadilisha usajili. Tafadhali jaribu tena.

source: last activity
sw_ke: Tendakazi za mwisho

source: open slots
sw_ke: Mianya wazi

source: name
sw_ke: jina

source: team count
sw_ke: idadi ya kikosi

source: Teams
sw_ke: Vikosi

source: Create
sw_ke: Buni

source: Update
sw_ke: Kamilisha

source: Team Name (Required) *
sw_ke: Jina la kikosi (Required) *

source: A name that identifies your team (maximum 255 characters).
sw_ke: Jina linalo tambulisha kikosi chako (maximum 255 characters).

source: Team Description (Required) *
sw_ke: Ufafanuzi wa kikosi (Required) *

source: A short description of the team to help other learners understand the goals or direction of the team (maximum 300 characters).
sw_ke: Ufafanuzi mfupi wa kikosi kusaidia mwanagenzi kufahamu malengo au muelekeo wa kikosi (maximum 300 characters).

source: Language
sw_ke: Lugha

source: The language that team members primarily use to communicate with each other.
sw_ke: Lugha msingi wanakikosi huanza kuwasiliana kati yao.

source: Country
sw_ke: Nchi / Taifa

source: The country that team members primarily identify with.
sw_ke: Nchi ambayo wanakikosi wana jitambulisha nayo kwanza.

source: An error occurred. Please try again.
sw_ke: Hitlafu imetokea. Tafadhali jaribu tena.

source: Check the highlighted fields below and try again.
sw_ke: Angalia viwanja vilivyoangaziwa na ujaribu tena.

source: Enter team name.
sw_ke: Ingiza jina la kikosi.

source: Team name cannot have more than 255 characters.
sw_ke: Jina la kikosi haliwezi kuwa na herufi zaidi ya 255.

source: Enter team description.
sw_ke: Ingiza ufafanuzi wa kikosi.

source: Team description cannot have more than 300 characters.
sw_ke: Ufafanuzi wa kikosi hauwezi kuzidi herufi 300.

source: An error occurred while removing the member from the team. Try again.
sw_ke: Hitlafu ilitokea akiondolewa mwakikosi kikosini. Jaribu tena.

source: This team does not have any members.
sw_ke: Kikosi hiki hakina wahusika.

source: Joined %(date)s
sw_ke: Unganishwa %(date)s

source: Last Activity %(date)s
sw_ke: Tendakazi za mwisho %(date)s

source: Remove this team member?
sw_ke: Mwanakikosi huyu aondolewe?

source: This learner will be removed from the team, allowing another learner to take the available spot.
sw_ke: Mwanagenzi huyu ataondolewa kutoka kwa kikosi, kuruhusu mwanagenzi mwengine kuchukua nafasi iliopo.

source: Remove
sw_ke: Ondoa

source: Delete this team?
sw_ke: Futa kikosi hiki?

source: Deleting a team is permanent and cannot be undone. All members are removed from the team, and team discussions can no longer be accessed.
sw_ke: Kufuta kikosi ni kwa kudumu na hataweza kurudiliwa. Wanachama wote wanaondolewa kutoka kwenye kikosi, na mazungumzo ya vikosi/kikosi hayatapatikana tena.

source: Team "{team}" successfully deleted.
sw_ke: Kikosi "{team}" fanikio la kufuta.

source: You are not currently a member of any team.
sw_ke: Kwa sasa hivi hauko kwa kikosi chochote.

source: and others
sw_ke: Na wengineo

source: Last activity %(date)s
sw_ke: Tendakazi za mwisho %(date)s

source: View %(span_start)s %(team_name)s %(span_end)s
sw_ke: Tizama %(span_start)s %(team_name)s %(span_end)s

source: An error occurred. Try again.
sw_ke: Hitlafu imetokea. Jaribu tena.

source: Leave this team?
sw_ke: Acha kikosi hiki?

source: If you leave, you can no longer post in this team's discussions. Your place will be available to another learner.
sw_ke: Ukiondoka, hutaweza kuweka makala katika mazungumzo ya kikosi hiki. Nafasi yako itakuwa wazi kwa mwanagenzi mwengine.

source: Confirm
sw_ke: Hakikisha

source: You already belong to another team.
sw_ke: Tayari wewe uko kwenye kikosi kingine.

source: This team is full.
sw_ke: Kikosi hiki kimejaa/kimekamilika.

source: %(memberCount)s / %(maxMemberCount)s Member
sw_ke: %(memberCount)s / %(maxMemberCount)s Mwanachama

source: All teams
sw_ke: Vikosi vyote

source: Teams Pagination
sw_ke: Pagination ya Vikosi

source: Topics
sw_ke: Mada

source: See all teams in your course, organized by topic. Join a team to collaborate with other learners who are interested in the same topic as you are.
sw_ke: Ona vikosi vyote katika fanni yako, vimepangwa kwa mada. Ungana na kikosi ushirikiane na wanagenzi wengine walio na upendeleo wa mada sawa kama wewe.

source: My Team
sw_ke: Kikosi changu

source: Browse %(sr_start)s teams %(sr_end)s
sw_ke: Vinjari mtandao %(sr_start)s kikosi %(sr_end)s

source: Your request could not be completed. Reload the page and try again.
sw_ke: Ombi lako halikueza kukamilishwa. Pakia tena ukurasa na jaribu tena.

source: Your request could not be completed due to a server problem. Reload the page
sw_ke: Ombi lako halingeweza kukamilishwa kwa sababu ya tatizo la sava. Pakia upya ukurasa

source: Team Search
sw_ke: Tafuta kikosi

source: Showing results for "%(searchString)s"
sw_ke: Kuonesha matokeo ya "%(searchString)s"

source: Create a New Team
sw_ke: Buni kikosi kingine

source: Create a new team if you can't find an existing team to join, or if you would like to learn with friends you know.
sw_ke: Buni kikosi kipya kama huwezi kupata kikosi kiliopo ujiunge, au kama ungependa kujifunza na marafiki uwajuao.

source: Edit Team
sw_ke: Kagua Kikosi

source: If you make significant changes, make sure you notify members of the team before making these changes.
sw_ke: Ukifanya mabadiliko makubwa, hakikisha umejulisha wanakikosi kabla ya kufanya mabadiliko.

source: Membership
sw_ke: Uwanachama

source: You can remove members from this team, especially if they have not participated in the team's activity.
sw_ke: Unaweza kuondoa wanakikosi kutoka kwwenye kikosi hiki, hassa wakiwa hawaja shiriki katika harakati za kikosi.

source: Search teams
sw_ke: Tafuta vikosi

source: All Topics
sw_ke: Vichwa vyote vya maudhui

source: The page "%(route)s" could not be found.
sw_ke: Ukurasa "%(route)s" haupatikani.

source: The topic "%(topic)s" could not be found.
sw_ke: Mada "%(topic)s" haiwezi kupatikana.

source: The team "%(team)s" could not be found.
sw_ke: Kikosi "%(team)s" haipatikani.

source: %(team_count)s Team
sw_ke: %(team_count)s Kikosi

source: Topic
sw_ke: Kichwa cha maudhui

source: View Teams in the %(topic_name)s Topic
sw_ke: Tizama vikosi katika %(topic_name)s Vichwa maudhui

source: {browse_span_start}Browse teams in other topics{span_end} or {search_span_start}search teams{span_end} in this topic. If you still can't find a team to join, {create_span_start}create a new team in this topic{span_end}.
sw_ke: {browse_span_start}Vinjari kikosi katika mada nyingine{span_end} au {search_span_start}tafuta vikosi{span_end}kwenye mada hii. Ikiwa bado hujapata kikosi kujiunga,{create_span_start}buni kikosi kipya kwenye mada hii{span_end}.

source: All topics
sw_ke: Vichwa vyote vya maudhui

source: Open Calculator
sw_ke: Fungua Kihasibu / Calculator

source: Close Calculator
sw_ke: Funga Kihasibu / Calculator

source: Post body
sw_ke: Mwili wa makala

source: Loading data...
sw_ke: Kupakia ujumbe...

source: Error getting issued certificates list.
sw_ke: Hitlafu kupata orodha ya vyeti vilivyotolewa.

source: Error generating proctored exam results. Please try again.
sw_ke: Hitlafu katika kuzalisha uangalizi wa matokeo ya mtihani. Tafadhali jaribu tena.

source: Error generating survey results. Please try again.
sw_ke: Hitlafu katika kuzalisha matokeo ya utafiti. Tafadhali jaribu tena.

source: Error generating student profile information. Please try again.
sw_ke: Hitlafu katika kuzalisha taarifa ya wasifu wa mwanafunzi. Tafadhali jaribu tena.

source: Loading
sw_ke: Kupakia ujumbe

source: Error getting student list.
sw_ke: Hitlafu kupata orodha ya mwanafunzi.

source: Error generating list of students who may enroll. Please try again.
sw_ke: Hitlafu kupata orodha ya wanafunzi wanaotarajiwa kujisajili. Tafadhali jaribu tena.

source: Error retrieving grading configuration.
sw_ke: Hitlafu ya kurudisha mchanganyiko wa daraja.

source: Error generating grades. Please try again.
sw_ke: Hitlafu kuzalisha daraja. Tafadhali jaribu tena.

source: Error generating problem grade report. Please try again.
sw_ke: Hitlafu kuzalisha taarifa ya tatizo la upeanaji daraja. Tafadhali jaribu tena.

source: Error generating ORA data report. Please try again.
sw_ke: Hitlafu kuzalisha habari ya ORA. Tafadhali jaribu tena.

source: Username
sw_ke: Jinatumishi

source: Email
sw_ke: Barua pepe

source: Revoke access
sw_ke: Batilisha ruhusa

source: Enter username or email
sw_ke: Ingiza jinatumishi au barua pepe

source: Please enter a username or email.
sw_ke: Tafadhali ingiza jinatumishi au barua pepe.

source: Error changing user's permissions.
sw_ke: Hitlafu kubadilisha idhini za mtumiaji.

source: Could not find a user with username or email address '<%= identifier %>'.
sw_ke: Haikuweza kumpata mtumiaji kwa jinatumishi au anwani ya barua pepe '<%=identifier %>'.

source: Error: User '<%= username %>' has not yet activated their account. Users must create and activate their accounts before they can be assigned a role.
sw_ke: Hitlafu: Mtumiaji '<%=username%>' hajaweka hai akaunti yake. Watumiaji lazima wabuni na waziweke hai akaunti zao kabla hawajapewa jukumu.

source: Error: You cannot remove yourself from the Instructor group!
sw_ke: Hitlafu: Huwezi kujiondoa katika kikosi cha waalimu!

source: Errors
sw_ke: Hitlafu

source: The following errors were generated:
sw_ke: Hitlafu zifuatazo ni zakutengenezwa:

source: Warnings
sw_ke: Maonyo

source: The following warnings were generated:
sw_ke: Maonyo yafuatayo ni yakutengenezwa:

source: Success
sw_ke: Mafanikio

source: All accounts were created successfully.
sw_ke: Akaunti zote zilifanikiwa kubuniwa.

source: Error adding/removing users as beta testers.
sw_ke: Hitlafu kuongeza/kuondoa watumiaji kama wajaribu wazuri.

source: These users were successfully added as beta testers:
sw_ke: Watumiaji hawa walifaulu kuongezwa kama wajaribu wazuri:

source: These users were successfully removed as beta testers:
sw_ke: Watumiaji hawa walifaulu kuondolewa kama wajaribu wazuri:

source: These users were not added as beta testers:
sw_ke: Watumiaji hawa hawakuongezwa kama wajaribu wazuri:

source: These users were not removed as beta testers:
sw_ke: Watumiaji hawa hawakuondolewa kama wajaribu wazuri:

source: Users must create and activate their account before they can be promoted to beta tester.
sw_ke: Watumiaji lazima wabuni na waweke hai akaunti zao kabla hawaja kuzwa kuwa wajaribu wazuri.

source: Could not find users associated with the following identifiers:
sw_ke: Haikuweza kuwapata watumiaji wahusianao na watambulishi wafuatao:

source: Reason field should not be left blank.
sw_ke: Sababu kiwanja hakistahili kuachwa kitupu.

source: Error enrolling/unenrolling users.
sw_ke: Hitlafu kusajili/kutangua usajili watumiaji.

source: The following email addresses and/or usernames are invalid:
sw_ke: Anwani barua pepe na/au majinatumishi yafuatayo yanatumika:

source: Successfully enrolled and sent email to the following users:
sw_ke: Imefaulu kusajili na kutuma barua pepe kwa watumiaji wafuatao:

source: Successfully enrolled the following users:
sw_ke: Imefaulu kusajili watumiaji wafuatao:

source: Successfully sent enrollment emails to the following users. They will be allowed to enroll once they register:
sw_ke: Tulifaulu kutuma barua pepe za usajili kwa watumiaji wafuatao. Wataruhusiwa kusajili mara tu wakijiandikisha:

source: These users will be allowed to enroll once they register:
sw_ke: Watumiaji hawa wataruhusiwa kusajili watakapo jiandikisha:

source: Successfully sent enrollment emails to the following users. They will be enrolled once they register:
sw_ke: Tulifaulu kutuma barua pepe kwa watumiaji wafuatao. Watasajiliwa mara tu wakijiandikisha:

source: These users will be enrolled once they register:
sw_ke: Watumiaji hawa watasajiliwa watakapo jiandikisha:

source: Emails successfully sent. The following users are no longer enrolled in the course:
sw_ke: Barua pepe ilifaulu kutumwa. Watumiaji wafuatao hawasajiliwi tena katika fanni:

source: The following users are no longer enrolled in the course:
sw_ke: Watumiaji wafuatao hawana tena usajili katika fanni:

source: These users were not affiliated with the course so could not be unenrolled:
sw_ke: Watumiaji hawa hakuongozwa na fanni kwahivyo hakuweza kusajiliwa:

source: Your message must have a subject.
sw_ke: Ujumbe wako hauna maudhui.

source: Your message cannot be blank.
sw_ke: Ujumbe wako hauwezi kuwa mtupu.

source: There are invalid keywords in your email. Please check the following keywords and try again:
sw_ke: Haya ni manenofunguo batili katika barua pepe yako. Tafadhali tizama manenofunguo yafuatayo na ujaribu tena:

source: Your email was successfully queued for sending.
sw_ke: Barua pepe yako ulifaulu kutumwa kwenye msururu/mlolongo.

source: You are about to send an email titled '<%= subject %>' to yourself. Is this OK?
sw_ke: Ukokaribu kutuma jina la barua pepe '<%=subject%>' kwako mwenyewe. Hii ni SAWA?

source: You are about to send an email titled '<%= subject %>' to everyone who is staff or instructor on this course. Is this OK?
sw_ke: Ukokaribu kutuma jina la barua pepe '<%=subject&>' kwa kila mmoja ambae ni mfanya kazi au mwalimu katika fanni hii. Hii ni SAWA?

source: You are about to send an email titled '<%= subject %>' to ALL (everyone who is enrolled in this course as student, staff, or instructor). Is this OK?
sw_ke: Ukokaribu kutuma jina la barua pepe '<%=subject%>' kwa WOTE (everyone who is enrolled in this course as student, staff, or instructor). Is this OK?

source: Your email was successfully queued for sending. Please note that for large classes, it may take up to an hour (or more, if other courses are simultaneously sending email) to send all emails.
sw_ke: Barua pepe yako ilifanikiwa kuwa katika mlolongo/msururu wa kutuma. Tafadhali jua ya kwamba kwa madarasa makubwa kabisa, inaweza kuchukuwa mpaka jisaa moja (or more, if other courses are sinultaneously sending email) kutuma barua pepe zote.

source: Error sending email.
sw_ke: Hitlafu kutuma barua pepe.

source: There is no email history for this course.
sw_ke: Hamna historia ya barua pepe kwa fanni hii.

source: There was an error obtaining email task history for this course.
sw_ke: Kulikuwa na hitlafu kupata sera ya kazi ya barua pepe kwa fanni hii.

source: There was an error obtaining email content history for this course.
sw_ke: Kulikuwa na hitlafu kupata sera ya yaliyomo katika barua pepe kwa fanni hii.

source: Please enter a student email address or username.
sw_ke: Tafadhali ingiza anwani barua pepe au jinatumishi la mwanafunzi.

source: Error getting student progress url for '<%= student_id %>'. Make sure that the student identifier is spelled correctly.
sw_ke: Hitlafu kupata maendeleo ya mwanafunzi url kwa '<%=student_id%>'. Hakikisha kuwa mtambuzi wa mwanafunzi imeandikwa vizuri.

source: Please enter a problem location.
sw_ke: Tafadhali ingiza eneo tatizo lilipo.

source: Success! Problem attempts reset for problem '<%= problem_id %>' and student '<%= student_id %>'.
sw_ke: Mafanikio! Majaribio ya tatizo imepewa tena mikakati kwa tatizo '<%=problem_id%>' na mwanafunzi '<%=student_id%>'.

source: Error resetting problem attempts for problem '<%= problem_id %>' and student '<%= student_id %>'. Make sure that the problem and student identifiers are complete and correct.
sw_ke: Hitlafu kuweka mikakati mingine ya tatizo kwa tatizo '<%=problem_id%>' na mwanafunzi '<%=student_id%>'. Hakikisha kuwa tatizo na mtambuzi wa mwanafunzi zimekamilshwa na ziko sawa.

source: Delete student '<%= student_id %>'s state on problem '<%= problem_id %>'?
sw_ke: Futa mwanafunzi '<%=student_id%>'s elezea juu ya tatizo '<%=problem_id%>'?

source: Error deleting student '<%= student_id %>'s state on problem '<%= problem_id %>'. Make sure that the problem and student identifiers are complete and correct.
sw_ke: Hitlafu kufuta mwanafunzi '<%=student_id %>'s elezea juu ya tatizo '<%=problem_id %>'. Hakikisha kuwa tatizo na mtambuzi wa mwanafunzi zimekamilishwa na ziko sawa.

source: Module state successfully deleted.
sw_ke: Hali ya moduli imefaulu kufutwa.

source: Started rescore problem task for problem '<%= problem_id %>' and student '<%= student_id %>'. Click the 'Show Background Task History for Student' button to see the status of the task.
sw_ke: Imeanza kuweka alama ya tatizo la kazi kwa tatizo '<%=problem_id %>' na mwanafunzi '<%=student_id %>'. Bonyeza kifungo cha 'onyesha Sera ya Kazi ya Background kwa mwanafunzi' uone hali ya kazi.

source: Error starting a task to rescore problem '<%= problem_id %>' for student '<%= student_id %>'. Make sure that the the problem and student identifiers are complete and correct.
sw_ke: Hitlafu tukianza kazi kurekebisha tatizo '<%= problem_id%>' la mwanafunzi '<%= student_id%>'. Hakikisha kwamba watambuzi wa tatizo na mwanafunzi wamekamilika na sawa sawa.

source: Error getting task history for problem '<%= problem_id %>' and student '<%= student_id %>'. Make sure that the problem and student identifiers are complete and correct.
sw_ke: Hitlafu kupata sera ya kazi kwa tatizo '<%=problem_id%>' na mwanafunzi '<%= student_id%>'. Hakikisha kuwa vitambuzi vya tatizo na mwanafunzi viko kamili na sawa sawa / sawa.

source: Entrance exam attempts is being reset for student '{student_id}'.
sw_ke: Kiingilio kwenye jaribio la mtihani kinapewa tena mikakati kwa mwanafunzi '{student_id}'.

source: Error resetting entrance exam attempts for student '{student_id}'. Make sure student identifier is correct.
sw_ke: Hitlafu tukiweka mikakati tena kwenye kiingilio cha jaribio la mtihani kwa mwanafunzi '{student_id}'. Hakikisha kitambuzi cha mwanafunzi kiko sawa.

source: Started entrance exam rescore task for student '{student_id}'. Click the 'Show Background Task History for Student' button to see the status of the task.
sw_ke: Tumeanza kazi ya kurekebisha kiingilio cha jaribio la mtihani kwa mwanafunzi '{student_id}'. Bonyeza kifungo 'onyesha sera ya kazi ya mwanafunzi' kuona hali ya kazi.

source: Error starting a task to rescore entrance exam for student '{student_id}'. Make sure that entrance exam has problems in it and student identifier is correct.
sw_ke: Hitlafu tukianza kurekebisha kiingilio cha mtihani kwa mwanafunzi '{student_id}'. Hakikisha kwamba kiingilio cha mtihani kina matatizo ndani yake na kitambuzi cha mwanafunzi kiko sawa sawa.

source: Enter a student's username or email address.
sw_ke: Ingiza jinatumishi au anwani barua pepe ya mwanafunzi.

source: Do you want to allow this student ('{student_id}') to skip the entrance exam?
sw_ke: Ungetaka kumruhusu mwanafunzi huyu ('{student_id}') arukize kiingilio cha mtihani?

source: An error occurred. Make sure that the student's username or email address is correct and try again.
sw_ke: Hitlafu imetokea. Hakikisha kwamba jinatumishi au barua pepe kwa mwanafunzi ziko sawa na ujaribu tena.

source: Entrance exam state is being deleted for student '{student_id}'.
sw_ke: Hali ya kiingilio cha mtihani kinafutwa / kinaondolewa kwa mwanafunzi '{student_id}'.

source: Error deleting entrance exam state for student '{student_id}'. Make sure student identifier is correct.
sw_ke: Hitlafu kufuta hali ya kiingilio cha mtihani kwa mwanafunzi '{student_id}'. Hakikisha kitambuzi cha mwanafunzi kiko sawa sawa.

source: Error getting entrance exam task history for student '{student_id}'. Make sure student identifier is correct.
sw_ke: Hitlafu kupata sera za kazi ya kiingilio cha mtihani kwa mwanafunzi '{student_id}'. Hakikisha kitambuzi cha mwanafunzi kiko sawa.

source: Reset attempts for all students on problem '<%= problem_id %>'?
sw_ke: Weka tena mikakati ya majaribio kwa wanafunzi wote juu ya tatizo '<%= problem_id%>'?

source: Successfully started task to reset attempts for problem '<%= problem_id %>'. Click the 'Show Background Task History for Problem' button to see the status of the task.
sw_ke: Kwa ufanisi kazi imeanza ya kuweka mikakati tena ya majaribio kwa tatizo '<%=problem_id %>'. Bonyeza kifungo 'Onyesha sera ya kazi kwa tatizo' kuona hali ya kazi.

source: Error starting a task to reset attempts for all students on problem '<%= problem_id %>'. Make sure that the problem identifier is complete and correct.
sw_ke: Hitlafu kuanza kazi ya kuweka mikakati tena ya majaribio kwa wanafunzi wote juu ya tatizo '<%= problem_id %>'. Hakikisha kuwa kitambuzi cha tatizo kiko kamili na sawa sawa.

source: Rescore problem '<%= problem_id %>' for all students?
sw_ke: Rekebisha tatizo '<%= problem_id %>' kwa wanafunzi wote?

source: Successfully started task to rescore problem '<%= problem_id %>' for all students. Click the 'Show Background Task History for Problem' button to see the status of the task.
sw_ke: Kwa ufanisi kazi imeanza ya kurekebisha tatizo '<%= problem_id %>' kwa wanafunzi wote. Bonyeza kifungo 'Onyesha sera ya kazi kwa tatizo' kuona hali ya kazi.

source: Error starting a task to rescore problem '<%= problem_id %>'. Make sure that the problem identifier is complete and correct.
sw_ke: Hitlafu ikianza kazi ya kurekebisha tatizo '<%= problem_id %>'. Hakikisha kwamba kitambuzi cha tatizo kiko kamili na sawa.

source: Error listing task history for this student and problem.
sw_ke: Hitlafu kuorodhesha sera ya kazi kwa mwanafunzi huyu na tatizo hili.

source: Task Type
sw_ke: Aina ya Jukumu

source: Task inputs
sw_ke: Uingizaji wa Jukumu

source: Task ID
sw_ke: Kitambulisho cha Jukumu

source: Requester
sw_ke: Muombaji

source: Submitted
sw_ke: Fikishwa

source: Duration (sec)
sw_ke: Muda (sec)

source: State
sw_ke: Elezea

source: Task Status
sw_ke: Jukumu Lilivyo

source: Task Progress
sw_ke: Uendeleaji wa Jukumu

source: An error occurred retrieving your email. Please try again later, and contact technical support if the problem persists.
sw_ke: Hitlafu imetokea kutoa barua pepe yako. Tafadhali jaribu tena baadae, na wasiliana usaidizi wa ufundi kama tatizo litaendelea.

source: Subject
sw_ke: Maudhui

source: Sent By
sw_ke: Imetumwa na

source: Time Sent
sw_ke: Wakati Iliotumwa

source: Number Sent
sw_ke: Nambari Iliotumwa

source: Copy Email To Editor
sw_ke: Igizia Barua pepe kwa Mkaguzi

source: Subject:
sw_ke: Maudhui:

source: Sent By:
sw_ke: Imetumwa na:
