Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Our staff is currently working to get the site back up as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
sw_ke: Wafanyi kazi wetu kwa sasa wanashughulika kurudisha tovuti tena haraka iwezekanavyo. Tafadhali tutumie barua pepe kupitia {tech_support_email} kutoa taarifa kuhusu tatizo lolote.

source: There has been a 500 error on the {platform_name} servers
sw_ke: Kumekuwa na hitlafu 500 kwenye seva za {platform_name}

source: Please wait a few seconds and then reload the page. If the problem persists, please email us at {email}.
sw_ke: Tafadhali subiri kwa sekunde chache na kisha upakie upya ukurasa. Kama tatizo litaendelea, tafadhali wasiliana nasi kwa barua pepe {email}.

source: Currently the {platform_name} servers are overloaded
sw_ke: Kwa sasa {platform_name} seva zimelemewa

source: Account Settings
sw_ke: Mitegesho ya Akaunti

source: Please Wait
sw_ke: Tafadhali Suburi / Ngoja

source: Sign in or Register
sw_ke: Ingia au Jisajili

source: Student Support
sw_ke: Usaidizi wa Mwanafunzi

source: Student Support: Certificates
sw_ke: Usaidizi wa Mwanafunzi: Vyeti

source: Student Support: Enrollment
sw_ke: Usaidizi kwa Mwanafunzi: Usajili

source: About to refund this order:
sw_ke: Kuhusu kurejesha malipo ya hili agizo:

source: Order Id:
sw_ke: Namba ya Agizo:

source: Enrollment:
sw_ke: Usajili:

source: enrolled
sw_ke: sajiliwa

source: unenrolled
sw_ke: haijasajiliwa

source: Cost:
sw_ke: Gharama:

source: CertificateItem Status:
sw_ke: Hali ya Cheti cha bidhaa:

source: Order Status:
sw_ke: Hali ilivyo ya Uagizaji:

source: Fulfilled Time:
sw_ke: Muda Uliotimizwa:

source: Refund Request Time:
sw_ke: Muda wa maombi ya kurejesha malipo:

source: User Survey
sw_ke: Utafiti wa Mtumiaji

source: Pre-Course Survey
sw_ke: Utafiti wa Kabla ya Kozi

source: You can begin your course as soon as you complete the following form. Required fields are marked with an asterisk (*). This information is for the use of {platform_name} only. It will not be linked to your public profile in any way.
sw_ke: Unaweza kuanza kozi yako haraka iwezekanavyo ukikamilisha fomu hii. Sehemu zinazo takiwa kujazwa zimewekewa alama ya nyota (*). Taarifa hii ni kwa matumizi ya {platform_name} pekee. Haitaunganishwa na wasifu wako kwa namna yeyote.

source: You are missing the following required fields:
sw_ke: Haujajaza maeneo yanayohitajika yafuatayo:

source: Cancel and Return to Dashboard
sw_ke: Futa na Urudi kwa Dashibodi

source: Why do I need to complete this information?
sw_ke: Kwanini nahitaji kukamilisha hii habari?

source: We use the information you provide to improve our course for both current and future students. The more we know about your specific needs, the better we can make your course experience.
sw_ke: Tuna tumia taarifa uliyotupa kuboresha 'kozi' zetu kwa wanafunzi wa sasa na wa baadae. Kadri tunavyofahamu mahitaji yako, ndivyo tunavyoboresha kozi yako zaidi.

source: Who can I contact if I have questions?
sw_ke: Niwasiliane na nani Nikiwa na maswali?

source: If you have any questions about this course or this form, you can contact {link_start}{mail_to_link}{link_end}.
sw_ke: Kama una swali lolote kuhusu kozi hii au fomu hii, unaweza kuwasiliana na {link_start}{mail_to_link}{link_end}.

source: Have questions?
sw_ke: Una masuali?

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
sw_ke: Tafadhali soma {a_start} FAQs zetu kutizama maswali ya kawaida kuhusu vyeti vyetu{a_end}.

source: Re-Verify for {course_name}
sw_ke: Thibitisha Upya kwa ajili ya {course_name}

source: Verification Deadline Has Passed
sw_ke: Siku ya Mwisho ya Kufanya 'Uthibitisho' Imepita

source: Upgrade Deadline Has Passed
sw_ke: Siku ya Mwisho ya Uboreshaji Imepita

source: The verification deadline for {course_name} was {{date}}. Verification is no longer available.
sw_ke: Tarehe ya mwisho ya uhakiki wa {course_name} ilikuwa {{date}}. Uhakiki haupo tena.

source: The deadline to upgrade to a verified certificate for this course has passed.
sw_ke: Siku ya mwisho ya kuboresha cheti kilicho thibitishwa kwa kozi hii imepita.

source: Upgrade Your Enrollment For {course_name}.
sw_ke: Boresha Usajili Wako kwa ajili ya {course_name}.

source: Receipt For {course_name}
sw_ke: Risiti ya {course_name}

source: Verify For {course_name}
sw_ke: Thibitisha Kwa ajili ya {course-name}

source: Enroll In {course_name}
sw_ke: Sajili katika{course_name}

source: Technical Requirements
sw_ke: Mahitaji ya Kiufundi

source: Please make sure your browser is updated to the {strong_start}{a_start}most recent version possible{a_end}{strong_end}. Also, please make sure your {strong_start}webcam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings).{strong_end}
sw_ke: Tafadhali hakikisha kivinjari chako kime sasishwa {strong_start}{a_start}kwenye toleo jipya{a_end}{strong_end}. Pia, tafadhali hakikisha webcam{strong_browser}yako imewekwa kwenye umeme, imewashwa, na imeruhusiwa kufanya kazi kwenye kivinjari cha wavuti yako (inarekebishika kwenye mitegesho ya kivinjari chako).{strong-end}

source: Re-Verification
sw_ke: Thibitisha Upya

source: Identity Verification
sw_ke: 'Uthibitisho' wa Kitambulisho

source: You have already submitted your verification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
sw_ke: Tayari umetoa taarifa za uthibitisho. Utaona ujumbe kwenye skrini yako taratibu za uthibitishozikikamilika (kawaida ndani ya siku 1-2)

source: You cannot verify your identity at this time.
sw_ke: Huwezi kuhakiki kitambulisho chako kwa 'sasa'.

source: Return to Your Dashboard
sw_ke: Rudi kwenye 'Ubao' Wako

source: Got it!
sw_ke: Umeipata!

source: Learn more
sw_ke: Jifunze zaidi

source: Changes
sw_ke: Mabadiliko

source: {span_start}active{span_end}
sw_ke: {span_start}hai{span_end}

source: Add article
sw_ke: Ongeza makala

source: All Rights Reserved
sw_ke: Haki Zote Zimehifadhiwa

source: Attribution
sw_ke: Sifa

source: Noncommercial
sw_ke: Siyo kwa biashara

source: No Derivatives
sw_ke: Hakifanani

source: Share Alike
sw_ke: Washirikishe

source: Creative Commons licensed content, with terms as follow:
sw_ke: Hati ya maudhui iliyobuniwa, kwa mashariti kama ifuatavyo:

source: Some Rights Reserved
sw_ke: Baadhi ya Zaki Zimehifadhiwa

source: Important Course Dates
sw_ke: Tarehe Muhimu za Kozi

source: Today is {date}
sw_ke: Leo ni {date}

source: Search Results
sw_ke: Tafuta Matokeo

source: Connected Accounts
sw_ke: Akaunti Zilizounganishwa

source: Linked
sw_ke: Unganishwa

source: Not Linked
sw_ke: Haijaunganishwa

source: Unlink
sw_ke: Tenganisha

source: Link
sw_ke: Unganisha

source: Learner Profile
sw_ke: Wasifu wa Mwanafunzi

source: Access Course Staff Support on the Partner Portal to submit or review support tickets
sw_ke: Fikia Usaidizi wa wafanyikazi wa kozi katika lango kubwa mwenza kufikia au kupitia upya tiketi za usaidizi

source: edX Partner Portal
sw_ke: Jukwaa Huru linalowezesha edX

source: Browse recently launched courses and see what's new in your favorite subjects.
sw_ke: Kivinjari kimezindua kozi hivi karibuni na kuona nini jipya katika maudhui uyapendayo.

source: Explore New Courses
sw_ke: Tafuta Kozi Mpya

source: Page Footer
sw_ke: Chini ya ukurasa

source: About edX
sw_ke: Kuhusu edX

source: edX Home Page
sw_ke: Ukurasa wa Mwanzo wa edX

source: Main
sw_ke: Kuu

source: Find Courses
sw_ke: Tafuta Kozi

source: Schools & Partners
sw_ke: Shule & Wabia

source: {b_start}Support our Mission: {b_end} EdX, a non-profit, relies on verified certificates to help fund free education for everyone globally
sw_ke: {b_start}Saidia Kazi Yetu: {b_end} EdX, isiyo ya kibiashara, inategemea vyeti vilivyo na uthibitisho kusaidia kuchangia elimu ya bure kwa kila mtu ulimwengu mzima

source: EdX, Open edX, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
sw_ke: Nembo za EdX, Open edX, na edX na Open edX ni alama za kibiashara zilizo ordheshwa kihalali na serikali au alama za kibiashara za {link_start}edX Inc.{link_end}

source: {tos_link_start}Terms of Service{tos_link_end} and {honor_link_start}Honor Code{honor_link_end}
sw_ke: {tos_link_start}Masharti ya huduma{tos_link_end} na {honor_link_start}kanuni za kimaadili{honor_link_end}

source: Copyright
sw_ke: Haki za kunakili

source: Copyright {year}. All rights reserved.
sw_ke: Haki miliki {year}. Haki zote zimehifadhiwa.

source: For anyone, anywhere, anytime
sw_ke: Kwa yeyote, popote, wakati wowote

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
sw_ke: Utapokea barua pepe ya kuwezesha. Lazima ubofye kiunganishi cha kuwezesha ili kukamilisha mchakato. Huoni barua pepe? Angalia jalada la jumbe zisizotakiwa kisha weka alama kwenye barua pepe kutoka darasani.stanford.edu kama 'sio sio ujumbe usiotakiwa', kwa vile utahitaji kuweza kupokea barua pepe kutoka kwenye kozi zako.

source: Need help in registering with {platform_name}?
sw_ke: Unahitaji msaada kwenye kujisajili na {platform_name}?

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
sw_ke: Utakapo jiandikisha, maswali mengi yanaweza kujibiwa katika majadiliano maalum ya kozi katika jukwaa au kupitia FAQs.

source: Thank you for signing up for {platform_name}.
sw_ke: Asante kwa kujiunga kwenye mtandao wa {platform_name}.

source: Change your life and start learning today by activating your {platform_name} account. Click on the link below or copy and paste it into your browser's address bar.
sw_ke: Badilisha maisha yako na uanze kujifunza kwa kuamsha akaunti {platform_name} yako. Bonyeza kwenye kiunganishi hapo chini au iga na ugandishe kwenye ukanda wa anwani ya mvinjari.

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the about section of the {platform_name} Courses web site.
sw_ke: Kama hukuomba hii, huhitaji kufanya lolote; hutapata tena barua pepe kutoka kwetu. Tafadhali usijibu barua pepe hii; kama unahitaji msaada, angalia kifungu cha usaidizi kwa {platform_name} tovuti ya Kozi.

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us at
sw_ke: Hii ni kuthibitisha kwamba ulibadilisha barua pepe inayohusiana na {platform_name} kutoka{old_email} kwenda {new_email}. Kama hukutuma ombi hili, tafadhali wasiliana nasi kupitia

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the tech support at {email}
sw_ke: Tunasikitika. Mfanyakazi wetu hakuidhinisha ombi lako la kubadilisha jina kutoka {old_name} kuwa {new_name}. Kama unahitaji msaada zaidi, tafadhali tuma barua pepe kwa mfanyakazi wa kozi kwa {email}.

source: Put your Terms of Service here!
sw_ke: Weka Masharti yako ya Huduma hapa!

source: Put your Privacy Policy here!
sw_ke: Weka Kanuni za Faragha zako hapa!

source: Put your Honor Code here!
sw_ke: Weka namba zako za siri hapa!

source: Put your Copyright Text here!
sw_ke: Weka ujumbe wako wa haki miliki hapa!

source: The page that you were looking for was not found.
sw_ke: Ukurasa uliokuwa ukitafuta haukupatikana.

source: Go back to the {homepage} or let us know about any pages that may have been moved at {email}.
sw_ke: Rudi nyuma kwenye {homepage} au tujulishe kuhusu ukurasa wowote ambao umewekwa kwenye {email}.

source: {studio_name} Server Error
sw_ke: {studio_name} Kosa la Seva

source: The {em_start}{studio_name}{em_end} servers encountered an error
sw_ke: {em_start}{studio_name}{em_end} Sava zimekumbana na hitilafu

source: An error occurred in {studio_name} and the page could not be loaded. Please try again in a few moments.
sw_ke: Hitilafu imetokea kwenye {studio_name} na ukurasa haukuweza kupakiwa. Tafadhali jaribu tena baada ya muda mchache.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
sw_ke: Tumetambua hitlafu na mfanyakazi wetu anashughulikia kutatua hitlafu hii haraka iwezekanavyo.

source: If the problem persists, please email us at {email_link}.
sw_ke: Kama tatizo linaendelea, tafadhali tutumie barua pepe kupitia {email_link}.

source: {studio_name} Account Activation
sw_ke: {studio_name} Uhuishaji wa Akaunti

source: Your account is already active
sw_ke: Akaunti iko tayari

source: This account, set up using {email}, has already been activated. Please sign in to start working within {studio_name}.
sw_ke: Akaunti hii, mikakati yake {email}, tayari inatumika. Tafadhali ingia mtandaoni uanze kufanya kazi {studio_name}.

source: Sign into {studio_name}
sw_ke: Ingia {studio_name}

source: Your account activation is complete!
sw_ke: Akaunti yako iko tayari!

source: Thank you for activating your account. You may now sign in and start using {studio_name} to author courses.
sw_ke: Asante kwa kuweka hai akaunti yako. Sasa unaweza kuingia mtandaoni kupitia {studio_name} uanze kutunga kozi.

source: Your account activation is invalid
sw_ke: Uwezeshaji wa akaunti yako siyo sahihi

source: We're sorry. Something went wrong with your activation. Check to make sure the URL you went to was correct, as e-mail programs will sometimes split it into two lines.
sw_ke: Samahani. Kuna makosa katika kuweka hai akaunti yako. Tizama kuhakiki kama URL uliofuata iko sawa, mara nyingine ratiba za barua pepe zitagawanyika katika mistari miwili.

source: If you still have issues, contact {platform_name} Support. In the meantime, you can also return to {link_start}the {studio_name} homepage.{link_end}
sw_ke: Kama bado una hoja, wasiliana na {platform_name} kwa Msaada. Kwa sasa, unaweza kurudi kwenye {link_start} ya {studio_name} ukurasa wa mwanzo.{link_end}

source: Files & Uploads
sw_ke: Mafaili & Yaliyopakiwa

source: Upload New File
sw_ke: Pakia faili mpya

source: Adding Files for Your Course
sw_ke: Kuongezea Mafaili kwa ajili Kozi Yako

source: To add files to use in your course, click {em_start}Upload New File{em_end}. Then follow the prompts to upload a file from your computer.
sw_ke: Kuongeza faili utumie kwa kozi yako, bofya {em_start}Pakia Faili Mpya {em_end}. Kisha fuata harakati upakie faili kutoka kwa kompyuta yako.

source: {em_start}Caution{em_end}: {platform_name} recommends that you limit the file size to {em_start}10 MB{em_end}. In addition, do not upload video or audio files. You should use a third party service to host multimedia files.
sw_ke: {em_start}Tahadhari{em_end}: {platform_name} inapendekeza kuwa upunguze ukubwa wa faili kwa {em_start} 10 MB{em_end}. Kwa kuongezea, usipakie video au faili za audio. Wastahili utumie huduma za mtumizi wa tatu uweze kuchukuwa faili za mchanganyiko wa idhaa.

source: The course image, textbook chapters, and files that appear on your Course Handouts sidebar also appear in this list.
sw_ke: Taswira ya kozi, sura za kwenye vitabu vya kiada, na faili zinazotokeza katika ulingo wa pembeni wa nyaraka za Kozi pia zinatokeza katika orodha.

source: Using File URLs
sw_ke: Kutumia faili ya URLs

source: Use the {em_start}{studio_name} URL{em_end} value to link to the file or image from a component, a course update, or a course handout.
sw_ke: Tumia namba ya {em_start}{studio_name} URL{em_end} kuunganisha kwa faili au taswira kutoka kwa kifaa, ukamilishaji wa kozi, au maandishi ya kozi.

source: Use the {em_start}Web URL{em_end} value to reference the file or image only from outside of your course. {em_start}Note:{em_end} If you lock a file, the Web URL no longer works for external access to a file.
sw_ke: Tumia {em_start}Tuvuti ya URL{em_end} tathmini kuashiria faili au taswira tu kutoka nje ya fanni yako. {em_start}Tambua:{em_end} Ukifunga faili, Tuvuti ya URL haitumiki tena kwa ufikiaji wa nje ya faili.

source: To copy a URL, double click the value in the URL column, then copy the selected text.
sw_ke: Kunakili URL, bofya mara mbili namba katika nguzo ya URL, kisha nakili ujumbe uliochaguliwa.

source: Learn more about managing files
sw_ke: Jifunze mengi kuhusu kusimamia faili

source: close
sw_ke: Funga

source: Max per-file size: {max_filesize}MB
sw_ke: Kiwango cha juu cha uwezo wa faili: {max_filesize}MB

source: Choose File
sw_ke: Chagua Faili

source: Your file has been deleted.
sw_ke: Faili lako limefutwa.

source: close alert
sw_ke: funga tahadhari

source: Course Certificates
sw_ke: Vyeti vya Kozi

source: This module is not enabled.
sw_ke: Moduli hii ya kozi haijawezeshwa.

source: This course does not use a mode that offers certificates.
sw_ke: Fanni hii haitumii kitengo kinacho toa vyeti.

source: Working with Certificates
sw_ke: Kufanyia kazi Vyeti

source: Specify a course title to use on the certificate if the course's official title is too long to be displayed well.
sw_ke: Fafanua kichwa cha fanni utumie katika cheti kama kichwa rasmi ni kirefu sana kuoneshwa sawa sawa.

source: For verified certificates, specify between one and four signatories and upload the associated images.
sw_ke: Kwa vyeti vilivyo sawazishwa, fafanua kati ya wasahihishi mmoja au wanne na pakia taswira zinazohusika.

source: To edit or delete a certificate before it is activated, hover over the top right corner of the form and select {em_start}Edit{em_end} or the delete icon.
sw_ke: Kukagua au kufuta cheti kabla hakijawekwa hai, nenda kona ya juu kulia katika fomu na uchague {em_start}Kagua{em_end} au ikoni ya kufuta.

source: To view a sample certificate, choose a course mode and select {em_start}Preview Certificate{em_end}.
sw_ke: Kutizama sampuli/aina ya cheti, chagua mtindo wa kozi na chagua {em_start}Kutizama Cheti{em_end}.

source: Issuing Certificates to Learners
sw_ke: Kutoa Vyeti kwa Wanafunzi

source: To begin issuing course certificates, a course team member with either the Staff or Admin role selects {em_start}Activate{em_end}. Only course team members with these roles can edit or delete an activated certificate.
sw_ke: Kuanza kutoa vyeti vya kozi, mhusika mmoja wa kozi ambae ama ni Mwalimu au Msimamizi wa kozi anachagua {em_start}Amsha{em_end}. Wahusika wa kozi pekee wenye majukumu ya ualimu au usimamizi ndiyo wanaoweza kuhariri au kufuta cheti.

source: {em_start}Do not{em_end} delete certificates after a course has started; learners who have already earned certificates will no longer be able to access them.
sw_ke: {em_start}Usi{em_end} fute vyeti baada ya fanni kuanza; wanagenzi ambao tayari wamepokea vyeti hawataweza kuruhusiwa tena.

source: Learn more about certificates
sw_ke: Jifunze mengi kuhusu vyeti

source: Other Course Settings
sw_ke: Mitegesho Mingine ya Kozi

source: Details &amp; Schedule
sw_ke: Kina cha/Undani &amp; Ratiba

source: Grading
sw_ke: Kutoa Daraja

source: Course Team
sw_ke: Waliomo kwenye Kozi

source: Advanced Settings
sw_ke: Mitegesho iliyoboreshwa

source: Duplicate
sw_ke: Nakala

source: Duplicate this component
sw_ke: Rudufu kipengele hiki

source: Move
sw_ke: Sogeza

source: Delete this component
sw_ke: Futa kipengele hiki

source: Drag to reorder
sw_ke: Kokota iliupange upya

source: Page Actions
sw_ke: Vitendo vya Ukurasa

source: Open the courseware in the LMS
sw_ke: Fungua Maudhui ya kozi katika LMS

source: View Live Version
sw_ke: Tazama toleo mubashara

source: Preview the courseware in the LMS
sw_ke: Mtazamo kabla wa Maudhui ya kozi katika LMS

source: Adding components
sw_ke: Kuongeza vipengele

source: Select a component type under {strong_start}Add New Component{strong_end}. Then select a template.
sw_ke: Chagua aina ya kipengele chini ya {strong_start} Ongeza Kipengele Kipya{strong_end}.Kisha chagua kigezo.

source: The new component is added at the bottom of the page or group. You can then edit and move the component.
sw_ke: Kipengele kipya kinaongezwa chini ya ukurasa au kundi. Unaweza kuhariri na kuondoa kipengele.

source: Editing components
sw_ke: Kuhariri vipengele

source: Click the {strong_start}Edit{strong_end} icon in a component to edit its content.
sw_ke: Bofya {strong_start}Hariri{strong-end} ikoni katika kiambajengo ili uhariri maudhui yake.

source: Reorganizing components
sw_ke: Kupanga upya vipengele

source: Drag components to new locations within this component.
sw_ke: Kokota viambajengo kwenye sehemu mpya ndani ya kiambajengo 'hiki'.

source: For content experiments, you can drag components to other groups.
sw_ke: Kwa majaribio ya maudhui, unaweza kukokota viambajengo kwenye vikundi vingine.

source: Working with content experiments
sw_ke: Fanya kazi na majaribio ya 'maudhui'

source: Confirm that you have properly configured content in each of your experiment groups.
sw_ke: Hakikisha kuwa 'umepanga' maudhui kwa usahihi kwa kila jaribio lako.

source: Learn more about component containers
sw_ke: Jifunze mengi kuhusu vyombo vya kipengele

source: Unit Location
sw_ke: Eneo la kitengo

source: Location ID
sw_ke: Eneo la ID

source: Location in Course Outline
sw_ke: Eneo Kwenye Fanni Muhtasari

source: Create a Course Rerun of:
sw_ke: Buni Maregeleo ya Fanni kwa:

source: Create a re-run of a course
sw_ke: Buni maregeleo ya fanni

source: You are creating a re-run from:
sw_ke: Unabuni maregeleo kutoka:

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
sw_ke: Toa taarifa yenye kutambua uendeshaji upya wa fanii hii. Fanni asili haiathiki kwa njia yoyote na uendeshaji upya.

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
sw_ke: Ilani: Pamoja, shirika, nambari ya fanni, na uendeshaji wa fanni lazima utambue kimaada mfano wa fanni hii mpya.

source: Required Information to Create a re-run of a course
sw_ke: Habari inayohitajika Kubuni uendeshaji upya wa fanni

source: e.g. Introduction to Computer Science
sw_ke: kwa mfano. Uanzishaji wa Sayansi ya Komputa

source: The public display name for the new course. (This name is often the same as the original course name.)
sw_ke: Jina la kuonekana / kujulikana na umma la fanni mpya.(This name is often the same as the original course name.)

source: Organization
sw_ke: Shirika

source: e.g. UniversityX or OrganizationX
sw_ke: kwa mfano. Chuo kikuuX au ShirikaX

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
sw_ke: Jina la shirika linalo fadhili fanni mpya. (This name is often the same as the original organization name.)

source: Note: No spaces or special characters are allowed.
sw_ke: Ilani: Hakuna nafasi au tabia/mtu/kitu/herufi maalum inayo ruhusiwa.

source: e.g. CS101
sw_ke: kwa mfano.CS101

source: The unique number that identifies the new course within the organization. (This number will be the same as the original course number and cannot be changed.)
sw_ke: Namba pekee inayotambulisha kozi mpya kwenye jumuiya. (Namba hii itakuwa sawa na namba ya zamani ya kozi na haiwezi kubadilishwa.)

source: Course Run
sw_ke: Uendeshaji wa Fanni

source: e.g. 2014_T1
sw_ke: kwa mfano. 2014_T1

source: The term in which the new course will run. (This value is often different than the original course run value.)
sw_ke: Masharti ambayo yataendesha fanni mpya. (This value is often different than the original course run value.)

source: Create Re-run
sw_ke: Buni Urudiaji tena
