Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: sw_ke

source: Saving
sw_ke: Kudhibiti

source: OK
sw_ke: Haya / Sawa

source: Cancel
sw_ke: Ondoa / Futa / Kata

source: Delete
sw_ke: Futa

source: Uploading
sw_ke: Pakia ujumbe

source: Name
sw_ke: Jina

source: Choose File
sw_ke: Chagua Faili

source: Ok
sw_ke: Haya / Sawa

source: Unknown
sw_ke: Haijulikani

source: Upload File
sw_ke: Pakia Faili

source: Save
sw_ke: Dhibiti

source: Advanced
sw_ke: Boresha

source: Close
sw_ke: Funga

source: Your changes have been saved.
sw_ke: Marekebisho yako yamedhibitiwa

source: Error
sw_ke: Hitlafu

source: Updating with latest library content
sw_ke: Kamilisha na yaliomo kwa maktaba kwa sasa

source: Creating missing groups
sw_ke: Buni makundi yanayokosekana

source: Show Annotations
sw_ke: Onesha nukuu

source: Hide Annotations
sw_ke: Ficha nukuu

source: Expand Instructions
sw_ke: Fafanua/Panua Maagizo

source: Collapse Instructions
sw_ke: Angusha/Kaidi Maagizo

source: Commentary
sw_ke: Maoni/Mawazo

source: Reply to Annotation
sw_ke: Jibu nukuu

source: (%(earned)s/%(possible)s point)
sw_ke: (%(earned)s/%(possible)s alama)

source: (%(num_points)s point possible)
sw_ke: (%(num_points)s alama iwezekanayo)

source: The grading process is still running. Refresh the page to see updates.
sw_ke: Shughuli za kuboresha bado inaendelea. Tafadhali burudisha ukurasa uone makamilisho.

source: Answer:
sw_ke: Jibu

source: Hide Answer
sw_ke: Ficha Jibu

source: Show Answer
sw_ke: Onesha Jibu

source: Answer hidden
sw_ke: Jibu limefichwa

source: Status: unsubmitted
sw_ke: Hali ilivyo: haijafikishwa

source: Paragraph
sw_ke: Kifungu cha maandishi

source: Preformatted
sw_ke: Imepewa mfumo kabla kutumika

source: Heading 3
sw_ke: Kichwa tangulizi namba 3

source: Heading 4
sw_ke: Kichwa tangulizi namba 4

source: Heading 5
sw_ke: Kichwa tangulizi namba 5

source: Heading 6
sw_ke: Kichwa tangulizi namba 6

source: Add to Dictionary
sw_ke: Ongezea kwa Kamusi

source: Align center
sw_ke: Anzia katikati/Amri ya kuandika kwa kompyuta

source: Align left
sw_ke: Anzia kushoto/Amri ya kuandika kwa kompyuta

source: Align right
sw_ke: Anzia kulia/Amri ya kuandika kwa kompyuta

source: Alignment
sw_ke: Mipaka uandishi kwenye kurasa ya kompyuta

source: Alternative source
sw_ke: Chanzo m'badala

source: Anchor
sw_ke: Egesha

source: Anchors
sw_ke: Maegesho

source: Author
sw_ke: Mtunzi wa vitabu

source: Background color
sw_ke: Rangi ilioenea zaidi katika picha

source: Blocks
sw_ke: Mgawanyiko kwa vyumba/Matofali

source: Body
sw_ke: Mwili

source: Bold
sw_ke: Unene

source: Border color
sw_ke: Rangi ya mpaka

source: Border
sw_ke: Mpaka wa eneo/Mwishoni mwa maeneo

source: Bottom
sw_ke: Chini

source: Bullet list
sw_ke: Orodha kwa vitone

source: Caption
sw_ke: Maneno yaliyochapishwa juu ya picha yakieleza kuihusu

source: Cell padding
sw_ke: Kizimba padding

source: Cell properties
sw_ke: Milki ya kizimba

source: Cell spacing
sw_ke: Ukubwa wa kizimba kinacho wezesha maandishi kwa kompyuta

source: Cell type
sw_ke: Aina ya kizimba

source: Cell
sw_ke: Kizimba

source: Center
sw_ke: Katikati

source: Circle
sw_ke: Mviringo

source: Clear formatting
sw_ke: Mfumo wakueleweka/ulio wazi

source: Code block
sw_ke: Tambulizi ya chumba

source: Code
sw_ke: Tambulizi

source: Color
sw_ke: Rangi

source: Cols
sw_ke: Cols / Nguzo

source: Column group
sw_ke: Kundi la nguzo

source: Column
sw_ke: Nguzo

source: Constrain proportions
sw_ke: Kulazimisha mawiano

source: Copy row
sw_ke: Igiza mraba

source: Copy
sw_ke: Igiza

source: Could not find the specified string.
sw_ke: Haikuweza kutafuta mstari husika.

source: Custom color
sw_ke: Desturi ya rangi

source: Custom...
sw_ke: Desturi...

source: Cut row
sw_ke: Kata mraba

source: Cut
sw_ke: Kata

source: Decrease indent
sw_ke: Punguza upana wa nafasi ya maandishi katika mstari

source: Default
sw_ke: Kukosea Wajibu

source: Delete column
sw_ke: Futa nguzo

source: Delete row
sw_ke: Futa mraba

source: Delete table
sw_ke: Futa meza

source: Description
sw_ke: Fafanuzi

source: Dimensions
sw_ke: Mapana

source: Disc
sw_ke: Diski

source: Document properties
sw_ke: Milki ya stakabadhi

source: Edit HTML
sw_ke: Kagua HTML

source: Edit
sw_ke: Sahihisha

source: Embed
sw_ke: Kushikanisha kwa umadhubuti

source: Emoticons
sw_ke: Ishara ya hisia kwa mchoro

source: Encoding
sw_ke: Kupeana tambulizi

source: File
sw_ke: Faili

source: Find and replace
sw_ke: Tafuta na badilisha

source: Find next
sw_ke: Tafuta ifuatayo

source: Find previous
sw_ke: Tafuta iliopita

source: Find
sw_ke: Tafuta

source: Finish
sw_ke: Maliza

source: Font Family
sw_ke: Jamii ya unene wa maandishi

source: Font Sizes
sw_ke: Unene wa maandishi

source: Footer
sw_ke: Mstari wa chini ya ukurasa unao rudiwa kwa kila ukurasa

source: Format
sw_ke: Mfumo

source: Formats
sw_ke: Mifumo

source: Fullscreen
sw_ke: Kioo kamili

source: General
sw_ke: Jumuia

source: Header 1
sw_ke: Mstari wa 1 unao rudiwa juu ya ukurasa kwa kila ukurasa

source: Header 2
sw_ke: Mstari wa 2 unao rudiwa juu ya ukurasa kwa kila ukurasa

source: Header 3
sw_ke: Mstari wa 3 unao rudiwa juu ya ukurasa kwa kila ukurasa

source: Header 4
sw_ke: Mstari wa 4 unao rudiwa juu ya ukurasa kwa kila ukurasa

source: Header 5
sw_ke: Mstari wa 5 unao rudiwa juu ukurasa kwa kila ukurasa

source: Header 6
sw_ke: Mstari wa 6 unao rudiwa juu ya ukurasa kwa kila ukurasa

source: Header cell
sw_ke: Kizimba kimoja katika mstari wa kurudia juu ya ukurasa

source: Header
sw_ke: Mstari unao rudiwa juu ya ukurasa katika kila ukurasa

source: Headers
sw_ke: Mistari inayo rudiwa juu ya kurasa katika kila ukurasa

source: Heading 1
sw_ke: Kichwa tangulizi namba 1

source: Heading 2
sw_ke: Kichwa tangulizi namba 2

source: Headings
sw_ke: Vichwa tangulizi

source: Height
sw_ke: Urefu / Kimo

source: Horizontal line
sw_ke: Mstari usawa / tambarare

source: Horizontal space
sw_ke: Nafasi sawa / tambarare

source: HTML source code
sw_ke: Asili ya kificho cha HTML

source: Ignore all
sw_ke: Puuza zote

source: Ignore
sw_ke: Puuza

source: Image description
sw_ke: Fafanuzi ya Taswira

source: Increase indent
sw_ke: Ongeza upana wa nafasi ya maandishi kwenye mstari

source: Inline
sw_ke: Ambatana

source: Insert column after
sw_ke: Weka safu baada ya..

source: Insert column before
sw_ke: Weka safu kabla ya..

source: Insert date/time
sw_ke: Weka wakati na tarehe

source: Insert image
sw_ke: Weka taswira

source: Insert link
sw_ke: Weka kiunganishi

source: Insert row after
sw_ke: Weka mstari baada ya...

source: Insert row before
sw_ke: Weka mstari kabla ya...

source: Insert table
sw_ke: Weka meza

source: Insert template
sw_ke: Weka kiigizo/kielelezo

source: Insert video
sw_ke: Weka video

source: Insert
sw_ke: Weka / Pachika

source: Insert/edit image
sw_ke: Weka / kagua taswira

source: Insert/edit link
sw_ke: Weka / kagua kiunganishi

source: Insert/edit video
sw_ke: Weka / kagua video

source: Italic
sw_ke: Italiki

source: Justify
sw_ke: Kuhalalisha

source: Keywords
sw_ke: Maneno muhimu/ya maudhui/ya ufunuo

source: Left to right
sw_ke: Kushoto mpaka kulia

source: Left
sw_ke: Kushoto

source: Lower Alpha
sw_ke: Alfa ya Chini

source: Lower Greek
sw_ke: Giriki ya Chini

source: Lower Roman
sw_ke: Romani ya Chini

source: Match case
sw_ke: Kisanduku cha ulinganishi

source: Merge cells
sw_ke: Linganisha vizimba

source: Middle
sw_ke: Katikati

source: New document
sw_ke: Hati mpya

source: New window
sw_ke: Dirisha jipya mtandaoni

source: Next
sw_ke: Nyingineo/Ifuatayo

source: No color
sw_ke: Hakuna rangi

source: Nonbreaking space
sw_ke: Nafasi isiogawanyika kiukurasa/kimstari

source: None
sw_ke: Hamna

source: Numbered list
sw_ke: Orodha ilio na nambari

source: Page break
sw_ke: Mgawanyo wa ukurasa

source: Paste as text
sw_ke: Igizia kama ujumbe

source: Paste is now in plain text mode. Contents will now be pasted as plain text until you toggle this option off.
sw_ke: Kuigizia sasa iko katika kawaida ya modi ya ujumbe. Sasa yaliyomo yataigiziwa kama ujumbe wa kawaida mpaka ugeuze kuzima chaguo.

source: Paste row after
sw_ke: Igizia mraba baada

source: Paste row before
sw_ke: Igizia mraba kabla

source: Paste your embed code below:
sw_ke: Igizia tambulizi yako madhubuti hapo chini:

source: Paste
sw_ke: Igizia

source: Poster
sw_ke: Makala

source: Pre
sw_ke: Kabla ya

source: Prev
sw_ke: Iliopita

source: Preview
sw_ke: Mtazamo wa makala kabla ya kukamilika kwa utumizi

source: Print
sw_ke: Chapisha

source: Redo
sw_ke: Kufanya tena/Kurudia kwa mfumo mwingine

source: Remove link
sw_ke: Ondoa kiunganishi

source: Replace all
sw_ke: Badilisha zote

source: Replace with
sw_ke: Badilisha na

source: Replace
sw_ke: Badilisha

source: Restore last draft
sw_ke: Rudisha kazi iliopita

source: Rich Text Area. Press ALT-F9 for menu. Press ALT-F10 for toolbar. Press ALT-0 for help
sw_ke: Eneo tajiri la ujumbe. Bonyeza ALT-F9 kwa menu/orodha. Bonyeza ALT-F10 kwa ulingo wa vifaa. Bonyeza ALT-0 kwa usaidizi

source: Right to left
sw_ke: Kulia mpaka kushoto

source: Right
sw_ke: Kulia

source: Robots
sw_ke: Masanamu hai

source: Row group
sw_ke: Kundi la mraba

source: Row properties
sw_ke: Milki ya mraba

source: Row type
sw_ke: Aina ya mraba

source: Row
sw_ke: Mraba

source: Rows
sw_ke: Miraba

source: Scope
sw_ke: Upeo

source: Select all
sw_ke: Chagua zote

source: Show blocks
sw_ke: Onesha vyumba

source: Show invisible characters
sw_ke: Onesha herufi/nambari zisizo onekana

source: Source code
sw_ke: Tambulizi asili

source: Source
sw_ke: Asili

source: Special character
sw_ke: Herufi maalum

source: Spellcheck
sw_ke: Usawazishaji wa herufi kwa upesi

source: Split cell
sw_ke: Gawanya chumba

source: Square
sw_ke: Kuweka sawa/mchoro wa kisanduku kilicho na pande zote sawa kivipimo

source: Start search
sw_ke: Anza kutafuta

source: Strikethrough
sw_ke: Shambulia

source: Style
sw_ke: Mtindo

source: Table properties
sw_ke: Milki ya meza

source: Table
sw_ke: Meza

source: Target
sw_ke: Lengo

source: Templates
sw_ke: Kiigizo/Kielelezo

source: Text color
sw_ke: Rangi ya wino unao andikia ujumbe

source: Text to display
sw_ke: Namna ujumbe unavyo jitokeza

source: The URL you entered seems to be an email address. Do you want to add the required mailto: prefix?
sw_ke: URL ulioingiza ni kama anwani ya barua pepe. Je,unahitaji kuongezea anwani inyo stahili kwa: ?

source: The URL you entered seems to be an external link. Do you want to add the required http:// prefix?
sw_ke: URL ulioingiza ni kama kiunganishi cha nje. Je,unahitaji kuongezea kwa tuvuti inayo stahili http:// ?

source: Title
sw_ke: Kichwa cha muktadha

source: Tools
sw_ke: Vifaa

source: Top
sw_ke: Juu

source: Underline
sw_ke: Piga mstari chini ya neno

source: Undo
sw_ke: Rudisha ilivyo kuwa mwanzo

source: Upper Alpha
sw_ke: Alfa ya Juu

source: Upper Roman
sw_ke: Romani ya Juu

source: Vertical space
sw_ke: Nafasi wima

source: View
sw_ke: Ona

source: Visual aids
sw_ke: Visaidizi vya kuona

source: Whole words
sw_ke: Maneno mazima

source: Width
sw_ke: Upana

source: Words: {0}
sw_ke: Maneno: {0}

source: You have unsaved changes are you sure you want to navigate away?
sw_ke: Una mabadiliko hayaja dhibitiwa una hakika wahitaji kumarisi kwengine?

source: Your browser doesn't support direct access to the clipboard. Please use the Ctrl+X/C/V keyboard shortcuts instead.
sw_ke: Kuvinjari kwako Mtandaoni hakuruhusu ufikiaji kwa ubao wa kutundika. Tafadhali tumia Ctrl+X/C/V ubaofunguo kwa mkato badalayake.

source: Click OK to have your username and e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
sw_ke: Bofya SAWA uwezeshe jinatumishi na anwani barua pepe kutumwa kwa muhusika wa 3.\n \n Bofya Futilia uweze kurudi kwa ukurasa huu bila kutuma ujumbe wako.

source: Click OK to have your username sent to a 3rd party application. Click Cancel to return to this page without sending your information.
sw_ke: Bofya SAWA uweze kutuma jinatumishi kwa matumizi ya muhusika wa 3. Bofya Futa urudi kwa ukurasa huu bila ya kutuma habari zako.

source: Click OK to have your e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
sw_ke: Bofya SAWA ili anwani yako ya barua pepe itumwe kwa matumizi ya muhusika wa 3. Bofya Futa urudi kwa ukurasa huu bila kutuma habari zako.

source: incorrect
sw_ke: Sio sawa

source: correct
sw_ke: Sawa sawa

source: answer
sw_ke: Jibu

source: Short explanation
sw_ke: Maelezo mafupi

source: Explanation
sw_ke: Maelezaji

source: Sequence error! Cannot navigate to %(tab_name)s in the current SequenceModule. Please contact the course staff.
sw_ke: Mlolongo wa hitlafu! Haiwezi kumarisi kwa %(tab_name)s katika mlolongo wa sasa wa moduli. Tafadhali wasiliana na mfanyikazi wa fanni.

source: Play
sw_ke: Chezesha/Cheza

source: Pause
sw_ke: Tuliza

source: Mute
sw_ke: Nyamazisha

source: Unmute
sw_ke: Kuipa sauti tena

source: Exit full browser
sw_ke: Toka kwenye kuvinjari mtandaoni

source: Fill browser
sw_ke: Jaza kuvinjari mtandaoni

source: Speed
sw_ke: Kasi

source: Volume
sw_ke: Sauti/Wingi

source: Muted
sw_ke: Nyamazishwa

source: Very low
sw_ke: Chini sana

source: Low
sw_ke: Chini/Ndogo

source: Average
sw_ke: Wastani

source: Loud
sw_ke: Sauti kubwa

source: Very loud
sw_ke: Sauti ya kelele

source: Maximum
sw_ke: Kiwango kamili

source: VideoPlayer: Element corresponding to the given selector was not found.
sw_ke: VideoPlayer: Kipengele kinacho wiana na uchaguzi uliotolewa hakipatikani.

source: This browser cannot play .mp4, .ogg, or .webm files.
sw_ke: Kuuvinjari Mtandao huu hauchezeshi .mp4, .ogg, au .faili za webm.

source: Try using a different browser, such as Google Chrome.
sw_ke: Jaribu kuvinjari mtandao tofauti, kama Google Chrome.

source: High Definition
sw_ke: Picha zenye maono ya kina

source: off
sw_ke: Kuzima

source: on
sw_ke: Kuwakisha

source: Video position
sw_ke: Mahali ilipo video

source: Video ended
sw_ke: Video imemalizika

source: %(value)s hour
sw_ke: %(value)s Jisaa

source: %(value)s minute
sw_ke: %(value)s dakika

source: %(value)s second
sw_ke: %(value)s sekunde

source: Volume: Click on this button to mute or unmute this video or press UP or
sw_ke: Sauti: Bofya kifungo hiki kunyamazisha au kutonyamazisha video hii au bonyeza UP au

source: Speed: Press UP to enter the speed menu then use the UP and DOWN arrow keys to navigate the different speeds, then press ENTER to change to the selected speed.
sw_ke: Kasi: Bonyeza UP uingize menu/orodha ya kasi kisha tumia mishale ya JUU na CHINI uwezeshe kasi tofauti tofauti, kisha bonyeza ENTER kubadilisha kwa kasi iliochaguliwa.

source: Skip
sw_ke: Rukiza

source: Play video
sw_ke: Chezesha video

source: Do not show again
sw_ke: Usioneshe tena

source: Transcript will be displayed when you start playing the video.
sw_ke: Transcript itaonyeshwa ukianza kuchezesha video.

source: Activating a link in this group will skip to the corresponding point in the video.
sw_ke: Kuweka kiunganishi hai katika kundi hili itarukiza kwa mahali pa uwiano katika video.

source: Video transcript
sw_ke: Transcript ya video

source: Start of transcript. Skip to the end.
sw_ke: Mwanzo wa transscript. Rukiza mpaka mwisho.

source: End of transcript. Skip to the start.
sw_ke: Mwisho wa transcript. Rukiza mpaka mwanzo.

source: Language: Press the UP arrow key to enter the language menu then use UP and DOWN arrow keys to navigate language options. Press ENTER to change to the selected language.
sw_ke: Lugha: Bonyeza mshale funguo ulengao JUU kuingiza orodha ya lugha kisha tumia mishale funguo ya JUU na CHINI kumarisi chaguo za lugha. Bonyeza INGIZA kubadilisha kwa lugha iliyochaguliwa.

source: Open language menu.
sw_ke: Orodha wazi ya lugha.

source: Hide closed captions
sw_ke: Ficha maandishi ya picha yaliofungwa

source: Turn on closed captioning
sw_ke: Fungua maandishi ya picha yaliofungwa

source: Turn on transcripts
sw_ke: Wakisha transcripts

source: Turn off transcripts
sw_ke: Zima transcripts

source: Hide Discussion
sw_ke: Ficha mazungumzo

source: Show Discussion
sw_ke: Onesha mazungumzo

source: Sorry
sw_ke: Samahani

source: We had some trouble loading the discussion. Please try again.
sw_ke: Tuna taklifu kuleta juu mazungumzo. Tafadhali jaribu tena.

source: We had some trouble loading the threads you requested. Please try again.
sw_ke: Tuna taklifu kuleta juu mistari ulioomba. Tafadhali jaribu tena.

source: Loading content
sw_ke: Pakia yaliomo

source: We had some trouble processing your request. Please ensure you have copied any unsaved work and then reload the page.
sw_ke: Tulikukuwa na taabu kushughulikia ombi lako. Tafadhali hakikisha umeigiza kazi yoyote ambayo haijadhibitiwa na kisha pakia tena ukurasa.

source: We had some trouble processing your request. Please try again.
sw_ke: Tuna taklifu kuhudumia ombi lako. Tafadhali jaribu tena.

source: there is currently %(numVotes)s vote
sw_ke: kwa sasa hivi kuna kura %(numVotes)s

source: %(numVotes)s Vote
sw_ke: Idadi ya kura %(numVotes)s

source: We had some trouble subscribing you to this thread. Please try again.
sw_ke: Tulikuwa na matatizo kukuandikisha kwenye uzi huu. Tafadhali jaribu tena.

source: We had some trouble unsubscribing you from this thread. Please try again.
sw_ke: Tulikuwa na matatizo kukufuta kwenye uzi huu. Tafadhali jaribu tena.

source: We had some trouble marking this response as an answer. Please try again.
sw_ke: Tulikuwa na matatizo kutambua jibisho hili kama jibu. Tafadhali jaribu tena.

source: We had some trouble removing this response as an answer. Please try again.
sw_ke: Tulikuwa na matatizo kuondoa jibisho hili kama jibu. Tafadhali jaribu tena.

source: We had some trouble marking this response endorsed. Please try again.
sw_ke: Tulikuwa na hitlafu kuashiria jibu lililoidhinishwa. Tafadhali jaribu tena.

source: We had some trouble removing this endorsement. Please try again.
sw_ke: Tulikuwa na hitlafu kuondoa idhini hii. Tafadhali jaribu tena.

source: We had some trouble saving your vote. Please try again.
sw_ke: Tulikuwa na matatizo kudhibiti kura yako. Tafadhali jaribu tena.

source: We had some trouble pinning this thread. Please try again.
sw_ke: Tulikuwa na matatizo kubandika kwa kudunga uzi huu. Tafadhali jaribu tena.

source: We had some trouble unpinning this thread. Please try again.
sw_ke: Tulikuwa na matatizo kubandua uzi huu. Tafadhali jaribu tena.

source: We had some trouble removing your flag on this post. Please try again.
sw_ke: Tulikuwa na matatizo kuondoa bendera yako kwenye makala haya. Tafadhali jaribu tena.

source: We had some trouble reporting this post. Please try again.
sw_ke: Tulikuwa na matatizo kuelezea makala haya. Tafadhali jaribu tena.

source: We had some trouble closing this thread. Please try again.
sw_ke: Tulikuwa na matatizo kufunga uzi huu. Tafadhali jaribu tena.

source: We had some trouble reopening this thread. Please try again.
sw_ke: Tulikuwa na matatizo kufungua tena uzi huu. Tafadhali jaribu tena.

source: Load more
sw_ke: Pakia zaidi

source: Loading more threads
sw_ke: Pakia mistari zaidi

source: We had some trouble loading more threads. Please try again.
sw_ke: Tumekuwa na matatizo kupakia zaidi uzi huu. Tafadhali jaribu tena.

source: %(unread_count)s new comment
sw_ke: %(unread_count)s wazo jipya

source: Current conversation
sw_ke: Mahojiano yanayoendelea sasa hivi

source: Search Results
sw_ke: Tafuta Matokeo

source: Loading thread list
sw_ke: Kupakia orodha ya nyuzi

source: No results found for %(original_query)s. Showing results for %(suggested_query)s.
sw_ke: Hakuna matokeo yaliopatikana kwa %(original_query)s. Yaoneshayo matokeo ya %(suggested_query)s.

source: No threads matched your query.
sw_ke: Hakuna uzi uliolingana na suali lako.

source: Show posts by %(username)s.
sw_ke: Onesha makala ya %(username)s.

source: The thread you selected has been deleted. Please select another thread.
sw_ke: Uzi uliochagua umefutwa. Tafadhali chagua uzi mwengine.

source: We had some trouble loading responses. Please reload the page.
sw_ke: Tumekuwa na matatizo kupakia majibisho yako. Tafadhali pakia tena ukurasa.

source: We had some trouble loading more responses. Please try again.
sw_ke: Tumekuwa na matatizo kupakia majibisho zaidi. Tafadhali jaribu tena.

source: %(numResponses)s other response
sw_ke: %(numResponses)s jibu jengine

source: %(numResponses)s response
sw_ke: %(numResponses)s jibu

source: Showing all responses
sw_ke: Kuonesha majibisho yote

source: Showing first response
sw_ke: Kuonyesha jibu la kwanza

source: Load all responses
sw_ke: Pakia majibisho yote

source: Load next %(numResponses)s responses
sw_ke: Pakia mjibisho %(numResponses)s yafuatayo

source: Are you sure you want to delete this post?
sw_ke: Una hakika wahitaji kufuta makala haya?

source: We had some trouble loading the page you requested. Please try again.
sw_ke: Tumekuwa na matatizo kupakia ukurasa ulioomba. Tafadhali jaribu tena.

source: Your post will be discarded.
sw_ke: Makala yako yatakataliwa.

source: anonymous
sw_ke: Jumuia

source: Are you sure you want to delete this comment?
sw_ke: Unahakika wahitaji kufuta oni hili

source: We had some trouble deleting this comment. Please try again.
sw_ke: Tuna taklifu kufuta oni hili. Tafadhali jaribu tena.

source: Are you sure you want to delete this response?
sw_ke: Una hakika unahitaji kufuta jibisho hili?

source: Required field.
sw_ke: Kiwanja hitajika.

source: Please do not use any spaces in this field.
sw_ke: Tafadhali usitumie nafasi wazi yoyote kwa kiwanja hiki.

source: Please do not use any spaces or special characters in this field.
sw_ke: Tafadhali usitumie nafasi yoyote au herufi maalum kwa kiwanja hiki.

source: Your request could not be completed. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
sw_ke: Ombi lako halikuweza kumalishwa. Pakia tena ukurasa na ujaribu tena. Kama tashwishi inaendelea, bonyeza tab ya Usaidizi kutoa taarifa ya tatizo.

source: Showing %(first_index)s out of %(num_items)s total
sw_ke: Kuonesha %(first_index)s kati ya %(num_items)s jumla

source: Showing %(first_index)s-%(last_index)s out of %(num_items)s total
sw_ke: Kuonesha %(first_index)s-%(last_index)s kati ya %(num_items)s jumla

source: The email address you've provided isn't formatted correctly.
sw_ke: Anwani barua pepe uliopeana haina mfumo sawa sawa.

source: %(field)s must have at least %(count)d characters.
sw_ke: %(field)s lazima iwe na japo %(count)d herufi.

source: %(field)s can only contain up to %(count)d characters.
sw_ke: %(field)s inaweza kuwa na mpaka %(count)d herufi.

source: Please enter your %(field)s.
sw_ke: Tafadhali ingiza %(field)s.

source: Drop target image
sw_ke: Angusha taswira lengo

source: dragging out of slider
sw_ke: kuburuta/kukokota/kutowa nje ya kitelezi

source: dragging
sw_ke: buruta

source: dropped in slider
sw_ke: angushwa kwenye kitelezi

source: dropped on target
sw_ke: angushwa kwenye lengo

source: %s ago
sw_ke: %s ilopita

source: %s from now
sw_ke: %s kuanzia sasa

source: less than a minute
sw_ke: chini ya dakika moja

source: about a minute
sw_ke: takriban dakika moja

source: %d minute
sw_ke: %d dakika

source: about an hour
sw_ke: takriban saa moja

source: about %d hour
sw_ke: kama %d jisaa

source: a day
sw_ke: siku moja

source: %d day
sw_ke: %d siku

source: about a month
sw_ke: takriban mwezi mmoja

source: %d month
sw_ke: %d mwezi

source: about a year
sw_ke: takriban mwaka mmoja

source: %d year
sw_ke: %d mwaka

source: User
sw_ke: Mtumiaji

source: Annotation
sw_ke: Nukuu zilizo unganishwa kufahamu ujumbe

source: Start
sw_ke: Anza/Mwanzo

source: End
sw_ke: Mwisho

source: #Replies
sw_ke: #Majibu

source: Date posted
sw_ke: Tarehe iliowekwa

source: More
sw_ke: Zaidi/Ongezeko
