Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: We're sorry, but this version of your browser is not supported. Try again using a different browser or a newer version of your browser.
sw_ke: Tunasikitika, lakini uvinjari wa aina hii hauna usaidizi. Jaribu tena ukitumia uvinjari tofauti au aina mpya ya uvinjari.

source: The following errors occurred while processing your registration:
sw_ke: Hitilafu zifuatazo zimetokea tukitayarisha usajili wako:

source: Sign up with {provider_name}
sw_ke: Jiunge mtandaoni na {provider_name}

source: Create your own {platform_name} account below
sw_ke: Unda akaunti yako ya {platform_name} hapo chini

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
sw_ke: Sehemu zinazohitajika zinaoneshwa kwatumia <strong class="indicator"> maandishi yaliyokozwa na alama ya kinyota (*)</strong>.

source: You've successfully signed in with {selected_provider}.
sw_ke: Umefanikiwa kuingia mtandaoni kupitia {selected_provider}.

source: We just need a little more information before you start learning with {platform_name}.
sw_ke: Tunahitaji maelezo zaidi kiasi kabla ya kuanza kujifunza kwenye {platform_name}.

source: Please complete the following fields to register for an account.
sw_ke: Tafadhali kamilisha sehemu zifuatazo ujiandikishe kupata akaunti.

source: Your legal name, used for any certificates you earn.
sw_ke: Jina lako halali, linalotumika kwa vyeti vyovyote unavyopata.

source: Will be shown in any discussions or forums you participate in
sw_ke: Itaoneshwa katika kila majadiliano au kongamano utakaloshiriki

source: cannot be changed later
sw_ke: haiwezi kubadilishwa baadae

source: Welcome {username}
sw_ke: Karibu {username}

source: Enter a Public Display Name:
sw_ke: Ingiza Jina la Kuonekana:

source: Public Display Name
sw_ke: Jina la Kuonekana

source: Additional Personal Information
sw_ke: Taarifa za Ziada za Ubinafsi

source: example: New York
sw_ke: mfano: New York

source: Highest Level of Education Completed
sw_ke: Kiwango cha Juu zaidi cha Elimu Ulichofikia

source: Please share with us your reasons for registering with {platform_name}
sw_ke: Tafadhali tueleze sababu zako za kujiandikisha kwenye {platform_name}

source: Account Acknowledgements
sw_ke: Uthibitisho kwa 'Akaunti'

source: I agree to the {link_start}Terms of Service{link_end}
sw_ke: Nakubaliana na {link_start} Masharti ya Huduma{link_end}

source: I agree to the {link_start}Honor Code{link_end}
sw_ke: Nakubaliana na {link_start}Kanuni za Kimaadili{link_end}

source: Register
sw_ke: Sajili

source: Create My Account
sw_ke: Unda Akaunti Yangu

source: Preferences for {platform_name}
sw_ke: Mapendeleo ya {platform_name}

source: Update my {platform_name} Account
sw_ke: Sasisha Akaunti yangu ya {platform_name}

source: Welcome {username}! Please set your preferences below
sw_ke: Karibu {username}! Tafadhali weka mapendeleo yako hapo chini

source: Enter a public username:
sw_ke: Ingiza jina la mtumiaji linalofahamika:

source: Update My Account
sw_ke: Sasisha Akaunti Yangu

source: Registration Help
sw_ke: Msaada wa Kujiandikisha

source: Already registered?
sw_ke: Tayari Umesajiliwa?

source: Log in
sw_ke: Ingia mtandaoni

source: Welcome to {platform_name}
sw_ke: Karibu kwenye {platform_name}

source: Registering with {platform_name} gives you access to all of our current and future free courses. Not ready to take a course just yet? Registering puts you on our mailing list - we will update you as courses are added.
sw_ke: Kujiandikisha na {platform_name} inakupa nafasi kwa kozi zetu zote za sasa na za wakati ujao. Bado hujakuwa tayari kuchukua kozi? Kujiandikisha inakuweka katika orodha yetu ya barua tutakujulisha iwapo kozi zinaongezewa.

source: Next Steps
sw_ke: Hatua Zifuatazo

source: As part of joining {platform_name}, you will receive an email message with instructions for activating your account. Don't see the email? Check your spam folder and mark {platform_name} emails as 'not spam'. At {platform_name}, we communicate mostly through email.
sw_ke: Kama sehemu ya kujiunga {platform_name}, utapokea ujumbe wa barua pepe wenye maelekezo ya kuamsha akaunti yako. Huioni barua pepe? Angalia kwenye jalada la barua taka na iweke alama {platform_name} barua pepe kuwa 'sio taka'. Kwenye {platform_name}, mara nyingi tunawasiliana kwa barua pepe.

source: Need help registering with {platform_name}?
sw_ke: Wahitaji msaada kujisajili kwa {platform_name}?

source: View our FAQs for answers to commonly asked questions.
sw_ke: 'Angalia' FAQs yetu kwa majibu ya maswali yaulizwayo mara kwa mara.

source: You can find the answers to most of your questions in our list of FAQs. After you enroll in a course, you can also find answers in the course discussions.
sw_ke: Unaweza kuona majibu ya maswali yako mengi kwenye orodha yetu ya FAQs. Ukishajisajili kwenye kozi, unaweza pia kuona majibu kwenye majadiliano ya kozi.

source: Register for {platform_name}
sw_ke: Jiandikishe kwa {platform_name}

source: Create My {platform_name} Account
sw_ke: Unda Akaunti Yangu ya {platform_name}

source: Welcome!
sw_ke: Karibu!

source: Register below to create your {platform_name} account
sw_ke: Jiandikishe hapo chini uunde akaunti yako ya {platform_name}

source: Re-subscribe Successful!
sw_ke: Kujiunga upya kumefaulu!

source: You have re-enabled forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}.
sw_ke: Umewezesha upya ilani za jukwaa kwa barua pepe kutoka kwa {platform_name}. Unaweza {dashboard_link_start}rudi kwenye dashibodi yako{link_end}.

source: Previous
sw_ke: Iliyopita

source: Sequence
sw_ke: Mfululizo

source: Next
sw_ke: Ifuatayo

source: Sign Up for {platform_name}
sw_ke: Jiandikishe mtandaoni kwa {platform_name}

source: e.g. yourname@domain.com
sw_ke: kwa mfano. jinalako@domain.com

source: e.g. yourname (shown on forums)
sw_ke: kwa mfano. jinalako (imeoneshwa kwenye majukwaa)

source: e.g. Your Name (for certificates)
sw_ke: kwa mfano. Jina Lako (kwa ajili ya vyeti)

source: <i>Welcome</i> {name}
sw_ke: <i>Karibu</i> {jina}

source: Full Name *
sw_ke: Jina Kamili *

source: Ed. Completed
sw_ke: Ed. Imekamilika

source: Goals in signing up for {platform_name}
sw_ke: Malengo ya kujiunga mtandaoni kupitia {platform_name}

source: Already have an account?
sw_ke: Una akaunti tayari?

source: Login.
sw_ke: Ingia mtandaoni.

source: This content experiment uses group configuration '{group_configuration_name}'.
sw_ke: Jaribio hili la yaliyomo linatumia usabidi wa kundi '{group_configuration_name}'.

source: Active Groups
sw_ke: Makundi hai

source: Inactive Groups
sw_ke: Makundi Yasiyo hai

source: Staff Debug Info
sw_ke: 'Taarifa za Wafanyakazi'

source: Submission history
sw_ke: Historia ya uwasilisahaji

source: {platform_name} Content Quality Assessment
sw_ke: Tathmini ya Ubora wa Maudhui kwenye {platform_name}

source: Comment
sw_ke: Maoni

source: comment
sw_ke: maoni

source: Tag
sw_ke: 'Weka alama'

source: Optional tag (eg "done" or "broken"):
sw_ke: Alama ya hiari (mfano "imefanywa" or "imeachwa"):

source: tag
sw_ke: 'weka alama'

source: Add comment
sw_ke: Ongeza maoni

source: Actions
sw_ke: Matendo

source: Reset Learner's Attempts to Zero
sw_ke: Futa majaribio ya mwanafunzi yawe sifuri

source: Delete Learner's State
sw_ke: Futa Hali ya Mwanafunzi

source: Rescore Learner's Submission
sw_ke: Weka upya alama za Uwasilisho wa Mwanafunzi

source: Rescore Only If Score Improves
sw_ke: Weka upya alama kama zimekuwa bora

source: Module Fields
sw_ke: Nafasi za kujaza Moduli

source: XML attributes
sw_ke: sifa za XML

source: Submission History Viewer
sw_ke: Angalia Historia ya 'Uwasilishaji'

source: User:
sw_ke: Mtumiaji:

source: View History
sw_ke: Angali Historia

source: {course_number} Textbook
sw_ke: Kitabu cha kiada {course_number}

source: Textbook Navigation
sw_ke: Uabiri wa 'Kitabu cha kiada'

source: Page
sw_ke: Ukurasa

source: Previous page
sw_ke: Ukurasa uliopita

source: Next page
sw_ke: Ukurasa unaofuata

source: Sysadmin Dashboard
sw_ke: Dashibodi ya Msimamizi wa Mfumo

source: Users
sw_ke: Watumiaji

source: Staffing and Enrollment
sw_ke: Uajiri na Usajili

source: Git Logs
sw_ke: Kumbukumbu za Git

source: User Management
sw_ke: Usimamizi wa Mtumiaji

source: Email or username
sw_ke: Barua pepe au jina la mtumiaji

source: Delete user
sw_ke: Futa mtumiaji

source: Create user
sw_ke: Buni mtumiaji

source: Download list of all users (csv file)
sw_ke: Pakua orodha ya watumiaji wote (faili la csv)

source: Check and repair external authentication map
sw_ke: Angalia na urekebishe uthibitisho wa ramani ya nje

source: Go to each individual course's Instructor dashboard to manage course enrollment.
sw_ke: Nenda kwa kila dashibodi ya mwalimu wa kozi kumudu usajili wa kozi.

source: Manage course staff and instructors
sw_ke: Simamia wafanyikazi wa kozi na wakufunzi

source: Download staff and instructor list (csv file)
sw_ke: Pakua orodha ya wafanyakazi na wakufunzi (faili la csv)

source: Administer Courses
sw_ke: Simamia Kozi

source: Repo Location
sw_ke: Eneo Repo

source: Repo Branch (optional)
sw_ke: Tawi la Repo (hiari)

source: Load new course from GitHub
sw_ke: Pakia kozi mpya kutoka GitHub

source: Course ID or dir
sw_ke: Kitambulisho cha Kozi au dir

source: Delete course from site
sw_ke: Futa 'kozi' kutoka kwenye tovuti

source: Platform Version
sw_ke: Tafsiri ya Jukwaa

source: previous
sw_ke: iliyopita

source: Page {current_page} of {total_pages}
sw_ke: Ukurasa {current_page} wa {total_pages}

source: next
sw_ke: inayofuata

source: Recent git load activity for {course_id}
sw_ke: Shughuli za git za upakiaji wa {course_id}

source: Date
sw_ke: Tarehe

source: Git Action
sw_ke: Kitendo cha Git

source: No git import logs have been recorded.
sw_ke: Hakuna upokeaji wa git ulioandikwa.

source: No git import logs have been recorded for this course.
sw_ke: Hamna upokeaji wa git uliioandikwa kwa kozi 'hii'.

source: Source:
sw_ke: Chanzo:

source: Tracking Log
sw_ke: 'Orodha' ya ufuatiliaji mtandaoni

source: datetime
sw_ke: tarehewakati

source: source
sw_ke: chanzo

source: type
sw_ke: aina

source: Unsubscribe Successful!
sw_ke: Kufanikiwa Kujitoa

source: You will no longer receive forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}. If you did not mean to do this, {undo_link_start}you can re-subscribe{link_end}.
sw_ke: Hutapokea tena barua pepe za ilani ya majadiliano kutoka {platform_name}. Unaweza {dashboard_link_start} kurudi kwenye dashibodi yako{link_end}. Ikiwa hukumaanisha kufanya hivi, {undo_link_start}unaweza kujiandikisha upya{link_end}.

source: Dashboard for:
sw_ke: Dashibodi kwa ajili ya:

source: Profile
sw_ke: Wasifu

source: More options
sw_ke: Machaguzi zaidi

source: Using the system
sw_ke: Kutumia mfumo

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
sw_ke: Wakati wa kuirudisha nyuma video, tumia maelezo ya tafsiri na ulingo wa kutambaa ili uabiri. Kubonyeza maelezo ya tafsiri ni njia ya haraka kurukiza mbele na nyuma kwa viwango vichache.

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
sw_ke: Ikiwa uko katika onesho la azimio la chini, ulingo wa kushoto wa abiri waweza kufichwa kwa kubonyeza kwenye mshale wa kushoto wa kifungu cha utatu karibu na hiyo.

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
sw_ke: Ukihitaji fonti kubwa au ndogo, tumia mikakati ya uvinjari wako kuziongeza au kupunguza. Chini ya google chrome, haya yanafanyika kwa kubonyeza ctrl-alama ya kuongeza, au ctrl-alama ya kuondoa kwa wakati mmoja.

source: Loading video player
sw_ke: Kupakia uchezeshaji wa video

source: Play video
sw_ke: Chezesha video

source: No playable video sources found.
sw_ke: Hakuna chanzo kilichopatikana cha uchezeshaji wa video.

source: Your browser does not support this video format. Try using a different browser.
sw_ke: Kivinjari chako hakiruhusu muundo wa video hii. Jaribu kutumia kivinjari tofauti.

source: Downloads and transcripts
sw_ke: Zilizopakuliwa na nakala

source: Download video file
sw_ke: Pakua faili la video

source: Transcripts
sw_ke: Nakala

source: Download {file}
sw_ke: Pakua{file}

source: Download transcript
sw_ke: Pakua cheti

source: Handouts
sw_ke: Vitini

source: Download Handout
sw_ke: Pakua Kitini

source: {num} of {total}
sw_ke: {num} ya {total}

source: Your words were:
sw_ke: Maneno yako yalikuwa:

source: API Access Request
sw_ke: Ombi la Upatikanaji wa API

source: {platform_name} API Access Request
sw_ke: {platform_name} Ombi la idhini ya Kupata API

source: Request API Access
sw_ke: Ombi la idhini ya Kupata API

source: API Access Request Status
sw_ke: Hali ya Ombi la Kupata API

source: Your request to access the {platform_name} Course Catalog API is being processed. You will receive a message at the email address in your profile when processing is complete. You can also return to this page to see the status of your API access request.
sw_ke: Ombi lako kufikia Orodha ya Kozi ya API ya {platform_name} inatayarishwa. Utapokea ujumbe kwa anwani ya barua pepe ilioko kwenye wasifu wako wakati matayarisho yamekamilika. Unaweza pia kurudi kwa ukurasa huu kuona hali ya ombi la ufikiaji API yako.

source: Your request to access the {platform_name} Course Catalog API has been denied. If you think this is an error, or for other questions about using this API, contact {api_support_email_link}.
sw_ke: Ombi lako kufikia Orodha ya Kozi ya API ya {platform_name} limekataliwa. Kama unafikiri hii ni hitilafu, au kwa maswali mengine kuhusu kutumia API hii, wasiliana na {api_support_email_link}.

source: Your request to access the {platform_name} Course Catalog API has been approved.
sw_ke: Ombi lako kufikia Orodha ya Kozi ya API ya {platform_name} limekubaliwa.

source: Application Name
sw_ke: Jina la Ombi

source: API Client ID
sw_ke: Kitambulisho cha Mteja wa API

source: API Client Secret
sw_ke: Siri ya Mteja wa API

source: Redirect URLs
sw_ke: Uelekezaji upya wa URLs

source: If you would like to regenerate your API client information, please use the form below.
sw_ke: Ukitaka kuzalisha upya taarifa ya mteja wa API yako, tafadhali tumia fomu hapo chini.

source: Generate API client credentials
sw_ke: Kuzalisha hati tambulishi ya mteja wa API

source: To learn more about the {platform_name} Course Catalog API, visit {link_start}our API documentation page{link_end}. For questions about using this API, contact {api_support_email_link}.
sw_ke: Kujifunza mengi kuhusu Orodha ya Kozi ya API ya {platform_name} , tembelea {link_start} ukurasa wetu wa waraka wa API{link_end}. Kwa maswali kuhusu kutumia API hii, wasiliana na {api_support_email_link}.

source: API Terms of Service
sw_ke: Sheria na Masharti ya API

source: Terms of Service for {platform_name} APIs
sw_ke: Masharti ya Huduma kwa Ajili ya {platform_name} APIs

source: Effective Date: April 12th, 2016
sw_ke: Tarehe ya Kuanza: April 12th, 2016

source: Welcome to {platform_name}. Thank you for using {platform_name}'s Course Discovery API and any additional APIs that we may offer from time to time (collectively, the "APIs"). Please read these Terms of Service prior to accessing or using the APIs. These Terms of Service, any additional terms within accompanying API documentation, and any applicable policies and guidelines that {platform_name} makes available and/or updates from time to time are agreements (collectively, the "Terms") between you and {platform_name}. By accessing or using the APIs, you accept and agree to be legally bound by the Terms, whether or not you are a registered user. If you do not understand or do not wish to be bound by the Terms, you should not use the APIs.
sw_ke: Karibu kwenye {platform_name}. Asante kwa kutumia {platform_name}'s API ya Uvumbuzi wa Kozi na nyongeza yoyote ya APIs ambayo tunaweza kutoa kwa kila wakati (kwa pamoja, "APIs"). Tafadhali soma Masharti ya Huduma kabla kufikia au kutumia APIs. Masharti haya ya Huduma, nyongeza zozote za masharti ndani ya nyaraka za API, na kanuni zozote zinazo ambatana na muongozo {platform_name} zinazofanya na/au kukimilisha baada kila wakati ni makubaliano (collectively, the "Terms") baina ya wewe na {platform_name}. Kwa kufikia au kutumia APIs, unakubali na kukiri ziwe halali na mafungamano na Mashrti. Kama umtumiaji ulieandikishwa au la. Kama huelewi au hutamani kufangamanishwa na Masharti, hustahili kutumia APIs.

source: API Access
sw_ke: Upatikanaji wa API

source: To access the APIs, you will need to create an {platform_name} user account for your application (not for personal use). This account will provide you with access to our API request page at {request_url}. On that page, you must complete the API request form including a description of your proposed uses for the APIs. Any account and registration information that you provide to {platform_name} must be accurate and up to date, and you agree to inform us promptly of any changes. {platform_name} will review your API request form and, upon approval in {platform_name}'s sole discretion, will provide you with instructions for obtaining your API shared secret and client ID.
sw_ke: Kufikia APIs, utahitaji kuunda {platform_name} akaunti ya mtumiaji kwa ombi lako (not for personal use). Akaunti hii itakutolea ufikiaji wa ukurasa wa ombi la API kwa {request_url}. Katika ukurasa, lazima ukamilishe fomu ya ombi la API yakiwemo maelezo ya maoni yako ya matumizi ya APIs. Akaunti yoyote na taarifa zozote za uandikishaji unazo toa kwa {platform_name} lazima ziwe sawa na kamili, na ukubali kutujulisha pindi kunapo kuwa na mabadiliko. {platform_name} itarudia tena kutizama fomu ya ombi la API yako na, juu ya idhini katika {platform_name}'s busara pekee, tutakupa maagizo ya kupata siri ya shirika na Kitambulisho cha mteja wa API yako.

source: Permissible Use
sw_ke: Matumizi Yaliyoruhusiwa

source: You agree to use the APIs solely for the purpose of delivering content that is accessed through the APIs (the "API Content") to your own website, mobile site, app, blog, email distribution list, or social media property or for another commercial use that you described in your request for access and that {platform_name} has approved on a case-by-case basis. {platform_name} may monitor your use of the APIs for compliance with the Terms and may deny your access or shut down your integration if you try to go around or exceed the requirements and limitations set by {platform_name}. Your Application or other approved use of the API or the API Content must not prompt your end users to provide their {platform_name} username, password or other {platform_name} user credentials anywhere other than the {platform_name} website at {platform_url}.
sw_ke: Unakubali kutumia APIs pekee kwa sababu za kutoa yaliyomo yanayofikiwa kupitia APIs (the "API Content") kwa orodha zako mwenyewe za usambazaji wa tovuti, tovuti ya simu, app, blog, barua pepe au milki ya idhaa za jamii au kwa utumizi wa kibiashara mwengine ulioelezea katika ombi lako kwa upatikanaji na kuwa {platform_name} imeidhinisha kwa misingi ya mashtaka baada ya mashtaka. {platform_name} inaweza kufuatilia utumizi wako wa APIs kwa kutii Masharti na inaweza kukunyima ruhusa au kufunga matangamano yako ukijaribu kinyume au kupitisha kiwango cha yanayo hitajika na yaliyokatazwa yaliyowekwa na {platform_name}. Matumizi yako au matumizi mengine ya APIs yaliyopitishwa au yaliyomo ya APIs sio lazima yamuharakishe mtumiaji wako wa mwisho kutoa {platform_name} jinatumishi, nywila au {platform_name} sifa nyingine popote mbali na {platform_name} tovuti ya {platform_url}.

source: Prohibited Uses and Activities
sw_ke: Shughuli na Matumizi Yaliyopigwa Marufuku

source: {platform_name} shall have the sole right to determine whether or not any given use of the APIs is acceptable, and {platform_name} reserves the right to revoke API access for any use that {platform_name} determines at any time, in its sole discretion, does not benefit or serve the best interests of {platform_name}, its users and its partners.
sw_ke: {platform_name} Itakuwa na haki pekee kuamua kama utumizi wowote wa APIs unakubalika au la, na {platform_name} inastahili haki ya kufuta ufikiaji wa API kwa utumizi wowote ambao {platform_name} utaamuliwa wakati wowote, kwa hadhari kamili, haifaidishi au hudumia kwa manufaa ya {platform_name}, watumiaji wake na washiriki / wadau.

source: The following activities are not acceptable when using the APIs (this is not an exhaustive list):
sw_ke: Shughuli zifuatazo hazikubaliki ukitumia APIs (hii sio orodha yote):

source: collecting or storing the names, passwords, or other credentials of {platform_name} users;
sw_ke: kukusanya au kupanga majina, nywila, au sifa nyengine za {platform_name} watumiaji;

source: scraping or similar techniques to aggregate or otherwise create permanent copies of API Content;
sw_ke: Uondoaji au mbinu kama hizo kulinganisha au kwa kubuni vigezo vya kudumu vya yaliyomo kwenye API;

source: violating, misappropriating or infringing any copyright, trademark rights, rights of privacy or publicity, confidential information or any other right of any third party;
sw_ke: Kukiuka, matumizi mabaya au kuhalifu haki zozote za kunakili, haki za alama ya biashara, haki za usiri au uhadhirishaji, habari za kujulikana na wahusika maalum au haki zozote nyinginezo au mtu wa watatu;

source: altering or removing any trademark, copyright or other proprietary or legal notices contained in, or appearing on, the APIs or any API Content;
sw_ke: Kubadilisha au kuondoa alama yoyote ya biashara, haki za kunakili au umiliki au ilani za halali ziliopo ndani, au kutokea kwnye, APIs au kwa Yaliyomo yoyote ya API;

source: altering or editing any content or graphics in the API Content
sw_ke: Kubadilisha au kuhariri maudhui yoyote au grafu kwenye maudhui ya 'API'

source: sublicensing, re-distributing, renting, selling or leasing access to the APIs or your client secret to any third party;
sw_ke: Upatikanaji wa leseni ndogo ndogo, usambazaji upya, kukodisha, kuuza au kukodisha kwa muda mrefu katika APIs au siri ya mteja wako au mtu watatu;

source: distributing any virus, Trojan horse, spyware, adware, malware, bot, time bomb, worm, or other harmful or malicious component; or
sw_ke: usambazaji virusi vyovyote vya, Farasi wa trojan, spaiwea, adwea, malwea, boti, bomu la wakati, nyungu nyungu, au vigezo vyingine vya madhara au vya udanganyifu: au

source: using the APIs for any purpose which or might overburden, impair or disrupt the {platform_name} platform, servers or networks.
sw_ke: kutumia APIs kwa lengo lolote ambalo au laweza kuu uzito mkubwa, kutolinganisha au kuharibu {platform_name} jukwaa, sava au mitandao.

source: Usage and Quotas
sw_ke: Matumizi na Quotas

source: {platform_name} reserves the right, in its discretion, to impose restrictions and limitations on the number and frequency of calls made by you or your Application to the APIs. You must not attempt to circumvent any restrictions or limitations that we impose.
sw_ke: {platform_name} ina miliki haki, katika hadhari yake, kuweka vikwazo na vikomo kwenye idadi na frikuensi kwa simu inazo piga au uombaji wako kwa APIs. Sio lazima ujaribu kughilibu vikwazo vyovyote au vikomo tunavyoweka.

source: Compliance
sw_ke: Kukubaliana
