Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
sw_ke: Unaweza kutumia faili kutoka kwa makala mengine. Faili hizi ni za kukamilishwa kwa makala mengine ambazo zaweza au haziwezi kuwa kitu kizuri.

source: Search
sw_ke: Tafuta

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
sw_ke: Falil zifuatazo zinapatikana kwa makala haya. Iga alama chini tag kukumbuka moja kwa moja kwa faili kutoka kwa jumbe za makala.

source: Markdown tag
sw_ke: Alama chini tag

source: Uploaded by
sw_ke: Imepakiwa na

source: Size
sw_ke: Ukubwa

source: File History
sw_ke: Kumbukumbu za 'Faili'

source: Detach
sw_ke: Achanisha

source: Replace
sw_ke: Badilisha

source: Restore
sw_ke: Rudisha

source: anonymous (IP logged)
sw_ke: isiojulukana (IP logged)

source: File history
sw_ke: Kumbukumbu za 'Faili'

source: revisions
sw_ke: marudio

source: There are no attachments for this article.
sw_ke: Hakuna viambatisho kwa 'hii' makala.

source: Previewing revision:
sw_ke: Pitia kabla marudio:

source: Previewing a merge between two revisions:
sw_ke: Utizamaji kabla wa uwekaji pamoja wa marudio mawili:

source: This revision has been deleted.
sw_ke: Marudio haya yamefutwa.

source: Restoring to this revision will mark the article as deleted.
sw_ke: Kurudisha haya 'marudio' kutaonesha makala kama imefutwa.

source: Once you have approved this request, go to {catalog_admin_url} to set up a catalog for this user.
sw_ke: Mara utakapokuwa umeidhinisha ombi hili, nenda kwenye {catalog_admin_url} kuweka katalogi kwa mtumiaji huyu.

source: Company Address
sw_ke: Anwani ya Kampuni

source: Describe what your application does.
sw_ke: Elezea maombi yako yanahusu nini.

source: The URL of your company's website.
sw_ke: URL ya tovuti ya kampuni yako.

source: The name of your company.
sw_ke: Jina la kampuni yako.

source: The contact address of your company.
sw_ke: Anwani ya mawasiliano ya kampuni yako.

source: The following users do not exist: {usernames}.
sw_ke: Watumiaji wafuatao hawapo: {usernames}.

source: Comma-separated list of usernames which will be able to view this catalog.
sw_ke: Orodha ya watumiaji walio tenganishwa kwa alama ya mkato ambao wataweza kuona hii katalogi.

source: Denied
sw_ke: Imekataliwa

source: Approved
sw_ke: Imeidhinishwa

source: Status of this API access request
sw_ke: Hali ya upatikanaji wa 'hii' API

source: The URL of the website associated with this API user.
sw_ke: URL ya tovuti ihusianayo na mtumiaji wa API hii.

source: The reason this user wants to access the API.
sw_ke: Sababu ya 'mtumiaji' kuhitaji kutumia API.

source: API access request from {company}
sw_ke: Ombi la kutumia API kutoka kwa {company}

source: API access request
sw_ke: Ombi la kutumia API

source: I, and my company, accept the {link_start}{platform_name} API Terms of Service{link_end}.
sw_ke: Mimi na kampuni yangu, tumekubali {link_start}{platform_name} Mashrti na Huduma za API{link_end}.

source: An error has occurred. Please try again.
sw_ke: "Hitlafu imetokea. Tafadhali jaribu tena.

source: No data provided.
sw_ke: Hakuna taarifa iliyotolewa.

source: Parameter usage_id not provided.
sw_ke: Kigezo kwa kitambulisho cha mtumiaji hakijatolewa.

source: Invalid usage_id: {usage_id}.
sw_ke: Kitambulisho cha mtumiaji ni batili: {usage_id}.

source: Block with usage_id: {usage_id} not found.
sw_ke: Zuio na kitambulisho cha_mtumiaji: {usage_id} hakipo.

source: You can create up to {max_num_bookmarks_per_course} bookmarks. You must remove some bookmarks before you can add new ones.
sw_ke: Unaweza kubuni kwa {max_num_bookmarks_per_course} alama za vitabu. Lazima uondoe baadhi ya alama za vitabu kabla hujaongeza mpya.

source: Bookmark with usage_id: {usage_id} does not exist.
sw_ke: Alama na kitambulisho cha_mtumiaji: {usage_id} haipo.

source: Internal API URL
sw_ke: API URL ya ndani

source: DEPRECATED: Use the setting COURSE_CATALOG_API_URL.
sw_ke: HAIKUFAA: Tumia mfululizo huu KOZI_KATALOGI_API_URL.

source: Specified in seconds. Enable caching of API responses by setting this to a value greater than 0.
sw_ke: Kilichobainishwa muda mfupi. Wezesha majibu ya kumbukumbu ya API kwa kuitegesha kuwa thamani kubwa kuliko 0.

source: Username created for Course Catalog Integration, e.g. lms_catalog_service_user.
sw_ke: Jina la Mtumiaji limetengezwa kwa ajili ya Kujumuishwa kwenye Orodha ya Kozi, mfano. lms_orodha_huduma_mtumiaji.

source: Page Size
sw_ke: Ukubwa wa Kurasa

source: Maximum number of records in paginated response of a single request to catalog service.
sw_ke: Kiwango cha juu cha kumbukumbu ya majibu ya ombi moja yanayoweza kuingizwa kwenye orodha ya huduma.

source: List of domains that are allowed to make cross-domain requests to this site. Please list each domain on its own line.
sw_ke: Orodha ya viwanja ambavyo vinaruhusu maombi ya kugeuza viwanja kwa tovuti hii. Tafadhali orodhesha kila kiwanja katika mstari wake mwenyewe.

source: Default Group
sw_ke: 'Kundi' linalotambulika

source: You cannot create two cohorts with the same name
sw_ke: Huwezi kuunda makundi mawili yenye jina moja

source: There must be one cohort to which students can automatically be assigned.
sw_ke: Lazima kuwe na kundi moja ambalo kwalo wanafunzi wanaweza kupewa mazoezi.

source: A cohort with the same name already exists.
sw_ke: 'Fungamano' lenye jina kama hili tayari lipo.

source: Internal Service URL
sw_ke: Huduma ya Ndani ya URL

source: Public Service URL
sw_ke: Huduma ya Umma ya URL

source: Enable Learner Issuance
sw_ke: Wezesha Utoaji kwa Mwanafunzi

source: Enable issuance of credentials via Credential Service.
sw_ke: Wezesha utoaji wa sifa kupitia Huduma ya Sifa/Hati.

source: Enable Authoring of Credential in Studio
sw_ke: Wezesha Utunzi wa Studio ya Sifa

source: Enable authoring of Credential Service credentials in Studio.
sw_ke: Wezesha utunzi wa Huduma ya Sifa katika Studio.

source: Course Credit Eligibility
sw_ke: Upatikanaji wa Alama za Kozi

source: You are eligible for credit from {providers_string}
sw_ke: Umefanikiwa kupata alama kutoka {provider_string}

source: {first_provider} and {second_provider}
sw_ke: {first_provider} na {second_provider}

source: {first_providers}, and {last_provider}
sw_ke: {first_providers}, na {last_provider}

source: [{username}] is not eligible for credit for [{course_key}].
sw_ke: [{username}] hastahili kupata alama kwa ajili ya [{course_key}].

source: [{course_key}] is not a valid course key.
sw_ke: [{course_key}] namba ya kozi sio sahihi.

source: Whether the credit provider is currently enabled.
sw_ke: Kama mtoa alama amewezeshwa.

source: Name of the credit provider displayed to users
sw_ke: JIna la mtoa alama linaonekana kwa watumiaji.

source: When true, automatically notify the credit provider when a user requests credit. In order for this to work, a shared secret key MUST be configured for the credit provider in secure auth settings.
sw_ke: Ikiwa kweli, moja kwa moja mtaarifu mtoaji mikopo endapo mtumiaji anaomba mkopo. Ili hii iweze kufanya kazi, namba ya siri inayojulikana na watumiaji LAZIMA ifanyiwe usabidi kwa ajili ya mtoaji mkopo katika taratibu salama.

source: Description for the credit provider displayed to users.
sw_ke: Maelezo kwa mtoa mkopo yanaonekana kwa watumiaji.

source: Thumbnail image url of the credit provider.
sw_ke: 'Url' ya picha ndogo ya mtoa mikopo.

source: Credit requirement statuses
sw_ke: Hali ya mahitaji ya mkopo

source: Deadline for purchasing and requesting credit.
sw_ke: Mwisho wa kununua na kuomba mkopo.

source: Preview Language is currently disabled
sw_ke: Hakikisho la lugha limezimwa kwasasa

source: Language code not provided
sw_ke: Msimbo wa lugha haujatolewa

source: Language set to language code: {preview_language_code}
sw_ke: Lugha imetegeshwa kurudi kwenye msimbo wa lugha: {preview_language_code}

source: Language reset to the default language code
sw_ke: Lugha imetegeshwa upya kurudi kwenye msimbo asilia wa lugha

source: Language reset to user's preference: {preview_language_code}
sw_ke: Lugha imetegeshwa upya kukidhi mapendeleo ya mtumiaji: {preview_language_code}

source: COURSE NOT FOUND. Please check that the course ID is valid.
sw_ke: KOZI HAIKUPATIKANA. Tafadhali angalia ikiwa Kitambulisho cha kozi ni halali.

source: The course key for the restricted course.
sw_ke: Ufunguo wa kozi kwa kozi iliyozuiwa.

source: The message to show when a user is blocked from enrollment.
sw_ke: Ujumbe kuonesha lini mtumiaji amezuiwa kusajili.

source: The message to show when a user is blocked from accessing a course.
sw_ke: Ujumbe kuonesha lini mtumiaji amezuiwa kuipata kozi.

source: Allow users who enrolled in an allowed country to access restricted courses from excluded countries.
sw_ke: Ruhusu watumiaji ambao wanasajili katika nchi iliyo ruhusiwa kufikia kozi zilizo na mipaka/vikwazo kutoka kwa nchi zilizotengwa.

source: Two character ISO country code.
sw_ke: Herufi mbili za ISO kwa namba ya nchi.

source: Whether to include or exclude the given course. If whitelist countries are specified, then ONLY users from whitelisted countries will be able to access the course. If blacklist countries are specified, then users from blacklisted countries will NOT be able to access the course.
sw_ke: Kama ni kuongeza au kupunguza kwa kozi iliyotolewa. Kama zilizo kwenye orodha ya nchi zinazoruhusiwa zimetajwa, watumiaji PEKEE kutoka orodha ya nchi zinazoruhusiwa wataweza kufikia kozi. Kama orodha ya nchi zilizozuiwa zimebainishwa, basi watumiaji kutoka orodha ya nchi zilizozuiwa HAWAWEZA kufikia kozi.

source: The course to which this rule applies.
sw_ke: Mahala ambapo hii kanuni inatumika.

source: The country to which this rule applies.
sw_ke: Nchi ambayo hii kanuni inatumika.

source: Whitelist {country} for {course}
sw_ke: Orodha ya {nchi} zinazokubaliwa kwenye {kozi}

source: Blacklist {country} for {course}
sw_ke: Orodha ya {nchi} zisizokubaliwa kwenye {kozi}

source: You have already created an account using an external login like WebAuth or Shibboleth. Please contact {tech_support_email} for support.
sw_ke: Tayari umebuni akaunti kutumia uingiaji wa nje kama WebAuth au Shibboleth. Tafadhali wasiliana na {tech_support_email} kwa msaada.

source: Your university identity server did not return your ID information to us. Please try logging in again. (You may need to restart your browser.)
sw_ke: Seva ya utambulisho ya chuo chako haikurudisha kwetu taarifa zako za kitambulisho Tafadhali jaribu kuingia mtandaoni tena.(Unaweza kuhitaji kuanza upya kivinjari chako.)

source: The file must be smaller than {image_max_size} in size.
sw_ke: Faili lazima liwe dogo kuliko {image_max_size}.

source: The file must be at least {image_min_size} in size.
sw_ke: Faili linatakiwa liwe na ukubwa angalau wa {image_min_size}.

source: The file must be one of the following types: {valid_file_types}.
sw_ke: Faili lazima liwe moja kati ya aina zifuatazo: {valid_file_types}.

source: The Content-Type header for this file does not match the file data. The file may be corrupted.
sw_ke: Ukurasa wa utambulisho wa maudhui ya faili hili haufanani na taarifa za faili. Faili huenda limeharibiwa.

source: The file name extension for this file does not match the file data. The file may be corrupted.
sw_ke: Jina la faili la ziada kwa ajili ya faili hili halifanani na taarifa za faili. Faili huenda limeharibiwa.

source: bytes
sw_ke: baiti

source: No file provided for profile image
sw_ke: Hakuna faili lililo tolewa kwa ajili ya taswira ya wasifu

source: Path used to construct URLs to programs marketing pages (e.g., "/foo").
sw_ke: Njia iliyotumika kutengeneza URLs kuwa kurasa za programu za masoko (e.g., "/foo").

source: Schedule
sw_ke: Ratiba

source: Enable course home page improvements.
sw_ke: Wezesha uboreshaji wa ukurasa wa mwanzo wa kozi.

source: It looks like {email_address} belongs to an existing account. Try again with a different email address.
sw_ke: Inaonekana kama {email_address} ni ya akaunti inayotumika. Jaribu tena kwa anwani ya barua pepe tofauti.

source: It looks like {username} belongs to an existing account. Try again with a different username.
sw_ke: Inaonekana kama {username} ni ya akaunti inayotumika. Jaribu tena kwa jina la mtumiaji tofauti.

source: The email addresses do not match.
sw_ke: Anwani za barua pepe hazilingani.

source: Please select your Country.
sw_ke: Tafadhali chagua Nchi yako.

source: The '{field_name}' field cannot be edited.
sw_ke: Hii '{field_name}' sehemu haiwezi kuhaririwa.

source: username@domain.com
sw_ke: jina la mtumiaji@domain.com

source: The email address you used to register with {platform_name}
sw_ke: Anwani ya barua pepe uliyotumia kujisajili na{platform_name}

source: Password
sw_ke: Nywila

source: Remember me
sw_ke: Nikumbuke

source: This is what you will use to login.
sw_ke: Hii ndiyo utakayotumia kwa kuingia mtandaoni.

source: Confirm Email
sw_ke: Thibitisha Barua pepe

source: This name will be used on any certificates that you earn.
sw_ke: JIna hili litatumika kwenye cheti chochote unachopata.

source: Public Username
sw_ke: Jina la Mtumiaji

source: The name that will identify you in your courses. It cannot be changed later.
sw_ke: Jina litakalotumika kukutambulisha kwenye kozi zako. Haliwezi kubadilishwa baadae.

source: Highest level of education completed
sw_ke: Kiwango cha juu zaidi cha elimu ulichohitimu

source: Year of birth
sw_ke: Mwaka wa kuzaliwa

source: Mailing address
sw_ke: Anwani ya mahali

source: Tell us why you're interested in {platform_name}
sw_ke: Tueleze kwanini unavutiwa na {platform_name}

source: State/Province/Region
sw_ke: Jimbo/Mkoa

source: Company
sw_ke: Kampuni

source: Review the Honor Code
sw_ke: Pitia upya Kanuni za Makubaliano

source: Terms of Service and Honor Code
sw_ke: Masharti ya huduma na Kanuni za Kimaadili

source: Review the Terms of Service and Honor Code
sw_ke: Pitia upya Masharti ya Huduma na Kanuni za Makubaliano

source: I agree to the {platform_name} {terms_of_service}
sw_ke: Nakubaliana na {platform_name} {terms_of_service}.

source: You must agree to the {platform_name} {terms_of_service}
sw_ke: Lazima ukubaliane na {platform_name} {terms_of_service}.

source: Review the Terms of Service
sw_ke: Pitia upya Masharti ya Huduma

source: Delete failed for user preference '{preference_key}'.
sw_ke: Futa ombi la mtumiaji lililoshindikana '{preference_key}'.

source: Preference '{preference_key}' cannot be set to an empty value.
sw_ke: Ombi '{preference_key}' haliwezi kukamilika kukiwa wazi.

source: Invalid user preference key '{preference_key}'.
sw_ke: Pandekezo la mtumiaji ni batili '{preference_key}'.

source: Value '{preference_value}' is not valid for user preference '{preference_key}'.
sw_ke: Namba '{preference_value}' sio halali kwa pendekezo la mtumiaji '{preference_key}'.

source: Value '{preference_value}' not valid for preference '{preference_key}': Not in timezone set.
sw_ke: Tathmini '{preference_value}' sio halali kwa pendekezo '{preference_key}': Haipo kwenye kundi la ukanda wa wakati.

source: Value '{preference_value}' is not a valid time zone selection.
sw_ke: Tathmini '{preference_value}' sio uchaguaji halali wa ukanda wa wakati.

source: Save failed for user preference '{key}' with value '{value}'.
sw_ke: Udhibiti haukufaulu kwa pendekezo la mtumiaji '{key}' kwa namba '{value}'.

source: No data provided for user preference update
sw_ke: Hakuna takwimu iliyotolewa kwa pendekezo la ukamilishaji wa mtumiaji

source: The course key for the course we would like to be auto-cohorted.
sw_ke: Ufunguo ya kozi kwa kozi tungependa iwe na ufungamano wakiwenyewe.

source: This value is invalid.
sw_ke: Namba hii ni batili.

source: This field is not editable
sw_ke: Sehemu hii haiwezi kuhaririwa

source: %(min_score)s is not a valid grade percentage
sw_ke: %(min_score)s asilimia ya daraja sio halali

source: Gating milestone for {usage_key}
sw_ke: Kuzuia mwanzo wa {usage_key}

source: License
sw_ke: Leseni

source: A license defines how the contents of this block can be shared and reused.
sw_ke: Leseni inabainisha jinsi ya kupeana na kutumia tena maudhui ya sehemu hii.

source: Category
sw_ke: Kundi

source: Week 1
sw_ke: Wiki ya 1

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
sw_ke: Jina la kundi la mjadala. Jina hili hutokea upande wa kushoto wa jukwaa la majadiliano ya kozi.

source: Subcategory
sw_ke: Kundi dogo

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
sw_ke: Jina la kundi dogo la mjadala. Jina hili hutokea upande wa kushoto wa jukwaa la majadiliano ya kozi.

source: Bookmarks
sw_ke: Wavuti Muhimu

source: Updates
sw_ke: Ukimilishaji

source: Reviews
sw_ke: Mapitio

source: Sign in
sw_ke: Ingia mtandaoni

source: Enrollment in {course_name} was not complete.
sw_ke: Uandikishaji kwenye kozi {course_name} haukukamilika.

source: The groups in this configuration can be mapped to cohorts in the Instructor Dashboard.
sw_ke: Makundi kwenye huu usabidi yanaweza kupangwa ili kuendana katika ubao wa mwalimu.

source: Content Groups
sw_ke: Makundi yaliyomo

source: invalid JSON
sw_ke: JSON isiostahili

source: must have name of the configuration
sw_ke: lazima iwe na jina la usabidi

source: must have at least one group
sw_ke: lazima iwe na japo kundi moja

source: Invalid course update id.
sw_ke: Utambulisho mpya wa kozi isiyo sahihi.

source: Course update not found.
sw_ke: Taarifa mpya haipatikani.

source: Could not index item: {}
sw_ke: Haikuweza kupanga kitu kwenye orodha:{}

source: General indexing error occurred
sw_ke: Kosa la jumla la kuorodhesha limetokea

source: (Unnamed)
sw_ke: (Haina jina)

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
sw_ke: GIT_REPO_EXPORT_DIR haina mikakati au njia {0} haipo, tafadhali ibuni, au changanya njia tofauti na GIT_REPO_EXPORT_DIR

source: Non writable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
sw_ke: KIRASA kilichotolewa cha Git isiyo andikika. Kutarajia kitu kama: git@github.com:mitocw/edx4edx_lite.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
sw_ke: Ukitumia http urls, lazima uandike jina la mtumiaji na nywila katika url. Mfano wa hii https://user:pass@github.com/user/course.

source: Unable to determine branch, repo in detached HEAD mode
sw_ke: Imeshindwa kutambua tawi, repo katika mtindo MKUU ulioachanishwa

source: Unable to update or clone git repository.
sw_ke: Haiwezi kukamilisha au kumiliki kloni ya git.

source: Unable to export course to xml.
sw_ke: Haiwezi kutuma kozi kwa xml.

source: Unable to configure git username and password
sw_ke: Haiwezi kuchanganya jina la mtumiaji na nywila ya git.

source: Unable to commit changes. This is usually because there are no changes to be committed
sw_ke: Haiwezi kutekeleza mabadiliko. Hii ni kwa sababu hakuna mabadiliko yakutekelezwa

source: Unable to push changes. This is usually because the remote repository cannot be contacted
sw_ke: Haiwezi kusukuma mabadiliko. Hii ni kwa sababu hakuna mawasiliano na hazina ya mbali ya taarifa

source: Bad course location provided
sw_ke: Eneo la fani mbaya limetolewa / patikana.

source: Missing branch on fresh clone
sw_ke: Tawi linalo kosekana kwenye kloni mpya

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
sw_ke: Chukua kozi iliyobainishwa na jaribu kuituma nje kwa hazina ya taarifa ya git . Orodha ya kozi lazima tayari iwe ni hazina ya git. Utumiaji:git_export <course_loc> <git_url>

source: Unknown User ID: {0}
sw_ke: Utambulisho wa Mtumiaji Asiyejulikana: {0}

source: Permission denied
sw_ke: Ruhusa imekataliwa

source: We only support uploading a .tar.gz file.
sw_ke: Tunasaidia tu kupakia faili la .tar.gz

source: Tar file not found
sw_ke: Faili la Tar halikupatikana

source: Unsafe tar file. Aborting import.
sw_ke: Faili la tar lisilosalama. Simamisha upokeaji faili.

source: Could not find the {0} file in the package.
sw_ke: Haikuweza kupata {0} faili katika kifurushi.

source: Deleted Group
sw_ke: Kundi lililofutwa

source: File {filename} exceeds maximum size of {size_mb} MB. Please follow the instructions here to upload a file elsewhere and link to it instead: {faq_url}
sw_ke: Faili {filename} inazidi kiasi kinacho tarajiwa cha {size_mb} MB. Tafadhali fuata maagizo hapa upakie faili mahali kwengine na uiunganishe badala yake:{faq_url}

source: Upload completed
sw_ke: Upakiaji umekamilika

source: must have name of the certificate
sw_ke: lazima iwe na jina la cheti

source: Certificate dict {0} missing value key '{1}'
sw_ke: Dict ya cheti {0} ina kosa tathmini ya ufunguo'{1}'

source: PermissionDenied: Failed in authenticating {user}
sw_ke: Ruhusa Imenyimwa: Haikuweza kuthibitisha {user}

source: {platform_name} Support Levels:
sw_ke: Maeneo ya Msaada {platform_name}:

source: Blank
sw_ke: Tupu

source: Course has been successfully reindexed.
sw_ke: Kozi imefaulu kupata namba nyingine.

source: Unscheduled
sw_ke: Haija pangiwa

source: Special characters not allowed in organization, course number, and course run.
sw_ke: Herufi maalum haziruhusiwi katika shirika, namba ya kozi, na kozi inavyoendeshwa.

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
sw_ke: Tayari kuna kozi inayotambulika kwa shirika na namba ya kozi hiyo. Tafadhali badilisha ama shirika au namba ya kozi iwe ya kipekee.

source: Please change either the organization or course number so that it is unique.
sw_ke: Tafadhali badilisha ama shirika au namba ya kozi ili iwe ya kipekee.

source: Unable to create course '{name}'. {err}
sw_ke: Haiwezi kubuni kozi '{name}' {err}

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
sw_ke: Lazima uunganishe kozi hii na shirika ili uendelee. Shirika ulilochagua halipo katika mpango, utahitaji kuiongezea katika orodha ya kozi.

source: Invalid prerequisite course key
sw_ke: Sharti lisilohalali kwa ufunguo wa fanni

source: An error occurred while trying to save your tabs
sw_ke: Hitilafu ilitokea wakati wa kujaribu kuhifadhi maelezo yako.

source: Tabs Exception
sw_ke: Kukubalika kwa Tab zilizoruhusiwa kinyume cha kanuni

source: This group configuration is in use and cannot be deleted.
sw_ke: Usabidi wa kundi unatumika kwa sasa na hauwezi kufutwa.

source: This content group is in use and cannot be deleted.
sw_ke: Kundi la yaliyomo latumika kwa sasa na haliwezi kufutwa / kufutika.

source: Entrance Exam - Subsection
sw_ke: Kiingilio cha Mtihani - kifungu kidogo

source: Completed Course Entrance Exam
sw_ke: Kamilisha Kiingilio cha Mtihani wa Kozi

source: Course successfully exported to git repository
sw_ke: Kozi imefanikiwa kutumwa kwenye hazina ya Git

source: Vertical
sw_ke: Wima

source: Empty
sw_ke: Tupu

source: File upload corrupted. Please try again
sw_ke: Faili lililopakiwa limeharibika. Tafadhali jaribu tena

source: Invalid data
sw_ke: Taarifa batili

source: Invalid data ({details})
sw_ke: Taarifa batili ({details})

source: You can not move {source_type} into {target_parent_type}.
sw_ke: Huwezi kupeleka {source_type} kwenye {target_parent_type}.

source: Item is already present in target location.
sw_ke: Kipengele tayari kipo katika eneo linalohitajika.
