Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: sw_ke

source: Would you like to sign in using your %(providerName)s credentials?
sw_ke: Ungependa kujiandikisha kwa kutumia %(providerName)s sifa/utambulisho wako?

source: Sign in using %(providerName)s
sw_ke: Jiandindikishe mtandaoni ukitumia %(providerName)s

source: Show me other ways to sign in or register
sw_ke: Nionyeshe njia nyengine kujisndikisha mtandaoni au kujiorodhesha

source: Sign in with Institution/Campus Credentials
sw_ke: Jiandikishe na hati/sifa za taasisi/chuo

source: Choose your institution from the list below:
sw_ke: Chagua taasisi yako kutoka kwa orodha hapo chini:

source: Back to sign in
sw_ke: Rudi kwa kujiandikisha mtandaoni

source: Register with Institution/Campus Credentials
sw_ke: Jiorodheshe na Sifa/Hati za Taasisi/Chuo

source: Register through edX
sw_ke: Jiorodheshe kupitia edX

source: You have successfully signed into %(currentProvider)s, but your %(currentProvider)s account does not have a linked %(platformName)s account. To link your accounts, sign in now using your %(platformName)s password.
sw_ke: Umefaulu kuingia mtandaoni %(currentProvider)s,lakini %(currentProvider)s akaunti yako haina kiunganishi %(platformName)s. Kuunganisha akaunti zako, jiandikishe sasa kutumia nywila %(platformName)s yako.

source: Password Reset Email Sent
sw_ke: Barua pepe ya Mikakati upya ya Nywila Imetumwa

source: We've sent instructions for resetting your password to the email address you provided.
sw_ke: Tumetuma maagizo ya kuipa mikakati upya nywila yako kwa anwani ya barua pepe uliotoa.

source: We couldn't sign you in.
sw_ke: Tusingeweza kukuandikisha.

source: An error occurred when signing you in to %(platformName)s.
sw_ke: Hitlafu ilitokea ukiandikishwa kwa %(platformName)s.

source: Sign in here using your email address and password, or use one of the providers listed below.
sw_ke: Jiandikishe mtandaoni hapa ukitumia anwani ya barua pepe na nywila, au tumia mmoja wa watoaji katika orodha hapo chini.

source: Sign in here using your email address and password.
sw_ke: Jiandikishe hapa ukitumia anwani ya barua pepe na nywila.

source: If you do not yet have an account, use the button below to register.
sw_ke: Ikiwa bado huja kuwa na akaunti, tumia kifungo hapo chini kujiorodhesha.

source: or sign in with
sw_ke: au jiandikishe na

source: Sign in with %(providerName)s
sw_ke: Jiandikishe mtandaoni na %(providerName)s

source: Use my institution/campus credentials
sw_ke: Tumia sifa/hati zangu za taasisi/chuo

source: New to %(platformName)s?
sw_ke: Mpya kwa %(platformName)s?

source: Create an account
sw_ke: Buni akaunti

source: An error occurred.
sw_ke: Hitlafu ilifanyika.

source: Password assistance
sw_ke: Usaidizi wa nywila

source: Please enter your email address below and we will send you instructions for setting a new password.
sw_ke: Tafadhali ingiza anwani ya barua pepe hapo chini na tutakutumia maagizo ya kutengeneza nywila mpya.

source: Reset my password
sw_ke: Iweke upya nywila yangu

source: We couldn't create your account.
sw_ke: Hatungeweza kubuni akaunti yako mpya.

source: You've successfully signed into %(currentProvider)s.
sw_ke: Umefaulu kujiandikisha mtandaoni kwa %(currentProvider)s.

source: We just need a little more information before you start learning with %(platformName)s.
sw_ke: Tunahitaji habari kidogo zaidi kabla uanze kujifunza na %(platformName)s.

source: Create an account using
sw_ke: Buni akaunti ukitumia

source: Create account using %(providerName)s.
sw_ke: Buni akaunti ukitumia %(providerName)s.

source: or create a new one here
sw_ke: au buni moja mpya hapa

source: Create a new account
sw_ke: Buni akaunti mpya

source: Create your account
sw_ke: Buni akaunti yako

source: Required field
sw_ke: Kiwanja kihitajikacho

source: Already have an account?
sw_ke: Una akaunti tayari?

source: Share your "%(display_name)s" award
sw_ke: Gawia tuzo "%(display_name)s" lako

source: Share
sw_ke: Gawia

source: Earned %(created)s.
sw_ke: Umepata %(created)s.

source: What's Your Next Accomplishment?
sw_ke: Ni upi Ukamilishaji Wako Ufuatao?

source: Start working toward your next learning goal.
sw_ke: Anza kushughulikia lengo lako lifuatalo la mafunzo.

source: Find a course
sw_ke: Tafuta kozi

source: An error occurred. Try loading the page again.
sw_ke: Hitlafu ilifanyika. Jaribu kupakia ukurasa tena.

source: You are currently sharing a limited profile.
sw_ke: Kwa sasa hivi munashirikiana katika wasifu wa kikomo.

source: This learner is currently sharing a limited profile.
sw_ke: Mwanagenzi huyu anashirikiana kwa sasa hivi katika wasifu wa kikomo.

source: Share on Mozilla Backpack
sw_ke: Shirikiana kwenye mozillz Backpack

source: To share your certificate on Mozilla Backpack, you must first have a Backpack account. Complete the following steps to add your certificate to Backpack.
sw_ke: Kushirikisha cheti chako kwenye Mozilla Backpck, lazima kwanza uwe na akaunti ya Backpack. Kamilisha hatua zifuatazo kuongeza cheti chako kwa Backpack.

source: Create a %(link_start)sMozilla Backpack%(link_end)s account, or log in to your existing account
sw_ke: Buni %(link_start)s akaunti ya Mozilla Backpack%(link_end)s, au ingia mtandaoni kwa akuanti yako ya sasa

source: %(download_link_start)sDownload this image (right-click or option-click, save as)%(link_end)s and then %(upload_link_start)supload%(link_end)s it to your backpack.</li>
sw_ke: %(download_link_start)sShukisha taswira hii (right-click or option-click, save as)%(link_end)s na kisha %(upload_link_start)spakia%(link_end)s kwa backpack yako.</li>

source: Congratulations! You are now verified on %(platformName)s!
sw_ke: Pongezi! Umehakikishwa kuwa %(platformName)s!

source: You are now enrolled as a verified student for:
sw_ke: Sasa unasajiliwa kama mwanafunzi ulie thibitishwa kwa:

source: A list of courses you have just enrolled in as a verified student
sw_ke: Orodha ya kozi uliojisajili kama mwanafunzi alie thibitishwa

source: Course
sw_ke: Kozi

source: Starts: %(start)s
sw_ke: Inaanza: %(start)s

source: Explore your course!
sw_ke: Talii kozi yako!

source: Go to your Dashboard
sw_ke: Nenda kwa dashibodi yako

source: Verified Status
sw_ke: Hali Iliothibitishwa

source: Thank you for submitting your photos. We will review them shortly. You can now sign up for any %(platformName)s course that offers verified certificates. Verification is good for one year. After one year, you must submit photos for verification again.
sw_ke: Asante kwa kufikisha picha zako. Tutazitima upya punde. Sasa waweza kujiandikisha kwa %(platformName)s kozi yoyote inayotoa vyeti vilivyothibitishwa. Uthibitisho ni mzuri kwa mwaka mmoja. Baada ya mwaka mmoja, lazima ufikishe picha zako kwa uthibitisho tena.

source: Error:
sw_ke: Hitlafu:

source: What You Need for Verification
sw_ke: Nini Wahitaji Kwa Uthibitisho

source: You need a computer that has a webcam. When you receive a browser prompt, make sure that you allow access to the camera.
sw_ke: Wahitaji kompyuta ilio na webcam. Ukipokea ushawishi wa kuvinjari, hakikisha unruhusu ufikiaji wa kamera.

source: Photo Identification
sw_ke: Kitambulisho cha Picha

source: You need a driver's license, passport, or other government-issued ID that has your name and photo.
sw_ke: Wahitaji leseni ya uendeshaji gari, pasipoti/kibali cha usafiri, au Kitambulisho chengine cha serikali kilicho na jina lako na picha yako.

source: Take Your Photo
sw_ke: Chukua Picha Yako

source: When your face is in position, use the camera button {icon} below to take your photo.
sw_ke: Kama uso wako uko mahali pake, tumia kifungo cha kamera {icon} hapo chini kupiga picha.

source: To take a successful photo, make sure that:
sw_ke: Kuchukua picha vizuri, hakikisha kuwa:

source: Your face is well-lit.
sw_ke: Uso wako umemulikwa vizuri.

source: Your entire face fits inside the frame.
sw_ke: Uso wako wote umetoshea kwenye fremu.

source: The photo of your face matches the photo on your ID.
sw_ke: Picha ya uso wako unalingana na picha ya Kitambulisho chako.

source: To use the current photo, select the camera button {icon}. To take another photo, select the retake button {icon}.
sw_ke: Kutumia picha yako ya sasa, chagua kifungo cha kamera {icon}. Kuchukuwa picha nyingine, chagua kifungo cha kupiga picha upya {icon}.

source: Frequently Asked Questions
sw_ke: Masuali Yaulizwayo Mara kwa mara

source: Why does %(platformName)s need my photo?
sw_ke: Kwanini ina %(platformName)s hitaji picha yangu?

source: As part of the verification process, you take a photo of both your face and a government-issued photo ID. Our authorization service confirms your identity by comparing the photo you take with the photo on your ID.
sw_ke: Kama baadhi ya shughuli za uthibitishaji, chukua picha ya sura yako na ya picha ilioko kwa Kitambulisho cha serikali. Huduma yetu ya mamlaka ina yakinisha sura yako kwa kulinganisha picha uliopiga na picha kwenye Kitambulisho chako.

source: What does %(platformName)s do with this photo?
sw_ke: Ni nini %(platformName)s inafanya na picha hii?

source: We use the highest levels of security available to encrypt your photo and send it to our authorization service for review. Your photo and information are not saved or visible anywhere on %(platformName)s after the verification process is complete.
sw_ke: Tunatumia viwango vya juu kabisa viliopo kuencrypt picha yako na kutuma kwa huduma yetu ya kuidhinisha kwa mtazamo upya. Picha yako na taarifa hazidhibitiwi au kuonekana popote kwenye %(platformName)s baada ya shughuli za kuthibitisha zimekamilika.

source: Next: %(nextStepTitle)s
sw_ke: Ifuatayo: %(nextStepTitle)s

source: Take a Photo of Your ID
sw_ke: Piga picha ya Kitambulisho chako

source: Use your webcam to take a photo of your ID. We will match this photo with the photo of your face and the name on your account.
sw_ke: Tumia webcam yako kupiga picha ya Kitambulisho chako. Tutalinganisha picha hii na picha ya sura yako pamoja na jina kwenye akaunti yako.

source: You need an ID with your name and photo. A driver's license, passport, or other government-issued IDs are all acceptable.
sw_ke: Wahitaji Kitambulisho chenye jina lako na picha. Leseni ya uendeshaji gari, pasipoti, au Vitambulisho vyengine vilivyotolewa na serikali vinakubalika.

source: Tips on taking a successful photo
sw_ke: Dokezi za kupiga picha kwa ufanisi

source: Ensure that you can see your photo and read your name
sw_ke: Hakikisha waweza kuona picha yako na kusoma jina lako

source: Make sure your ID is well-lit
sw_ke: Hakikisha Kitambulisho chako kimekulikwa sawa sawa

source: Once in position, use the camera button {icon} to capture your ID
sw_ke: Pindi kikiwa mahali pake, tumia kifungo cha kamera {icon} kuchukua Kitambulisho chako

source: Use the retake photo button if you are not pleased with your photo
sw_ke: Tumia kifungo cha kuchukua upya kama hujapendezewa na picha yako

source: Preview of uploaded image
sw_ke: Mtizamo kabla wa taswira iliopakiwa

source: Upload an image or capture one with your web or phone camera.
sw_ke: Pakia taswira au chukua moja na web yako au kamera ya simu.

source: Use your webcam to take a photo of your face. We will match this photo with the photo on your ID.
sw_ke: Tumia webcam yako kuchukua picha ya sura yako. Tutalinganisha picha hii na picha ya Kitambulisho chako.

source: Make sure your face is well-lit
sw_ke: Hakikisha sura yako imemulikwa kisawa sawa

source: Be sure your entire face is inside the frame
sw_ke: Kuwa na hakikika sura yako yote iko ndani ya fremu

source: Once in position, use the camera button {icon} to capture your photo
sw_ke: Ikiwa mahali pake, tumia kifungo cha kamera {icon} kupigia picha yako

source: Can we match the photo you took with the one on your ID?
sw_ke: Je twaweza kulinganisha picha yako na iliopo kwenye Kitambulisho chako?

source: Thanks for returning to verify your ID in: {courseName}
sw_ke: Asante kwa kurudi kuthibitisha Kitambulisho chako kwenye: {courseName}

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email. After you complete activation you can return and refresh this page.
sw_ke: Unahitaji kuamsha akaunti yako kabla uweze kujisajili katika kozi. Tizama kisanduku chako cha mapokezi ya jumbe kwa ujumbe wa kuamsha. Baada ya kukamilisha uamshaji waweza kurudi na ufungue upya ukurasa.

source: Activate Your Account
sw_ke: Amsha Akaunti Yako

source: Check Your Email
sw_ke: Angalia Barua pepe Yako

source: Photo ID
sw_ke: Picha ya KItambulisho

source: A driver's license, passport, or other government-issued ID with your name and photo
sw_ke: Leseni ya uendeshaji gari, pasipoti, au Kitambulisho kingine chochote cha kiserikali kilicho na jina lako na picha yako

source: You are enrolling in: {courseName}
sw_ke: Unajisajili kwenye: {courseName}

source: You are upgrading your enrollment for: {courseName}
sw_ke: Una boresha usajili wako kwa: {courseName}

source: You can now enter your payment information and complete your enrollment.
sw_ke: Unaweza sasa kuingiza taarifa ya malipo yako na ukamilishe usajili wako.

source: You can pay now even if you don't have the following items available, but you will need to have these by %(date)s to qualify to earn a Verified Certificate.
sw_ke: Waweza sasa kulipa hata kama huna vitu viliopo vifuatavyo, lakini utathitajika uwe na hivi kwa %(date)s ustahili kupata Cheti Kilichothibitishwa.

source: You can pay now even if you don't have the following items available, but you will need to have these to qualify to earn a Verified Certificate.
sw_ke: Sasa waweza kulipa hata kama huna vitu viliopo vifuatavyo, lakini utahitajika uwe na vitu hivi ustahili kupata Cheti Kilichothibitishwa.

source: Government-Issued Photo ID
sw_ke: Kitambulisho cha Picha kilichotolewa na serikali

source: ID-Verification is not required for this Professional Education course.
sw_ke: Ithbati ya Kitambulisho haihitajiki kwa ya kozi ya Elimu ya Weledi.

source: All professional education courses are fee-based, and require payment to complete the enrollment process.
sw_ke: Kozi zote za elimu ya weledi ni za kulipa karo, na zahitaji malipo kukamilisha shughuli za usajili.

source: You have already verified your ID!
sw_ke: Tayari umethibitisha Kitambulisho chako!

source: Your verification status is good until {verificationGoodUntil}.
sw_ke: Hali ya uthibitisho wako ni mzuri mpaka {verificationGoodUntil}.

source: price
sw_ke: Bei

source: Account Not Activated
sw_ke: Akaunti Haija Amshwa

source: Upgrade to a Verified Certificate for {courseName}
sw_ke: Boresha Uthibitishe Cheti kwa {courseName}

source: Before you upgrade to a certificate track, you must activate your account.
sw_ke: Kabla hujaboresha kwa mkokoto wa cheti, lazima uamshe akaunti yako.

source: Check your email for an activation message.
sw_ke: Angalia barua pepe yako kwa ujumbe wa kuamsha.

source: Professional Certificate for {courseName}
sw_ke: Cheti cha Weledi wa {courseName}

source: Verified Certificate for {courseName}
sw_ke: Cheti Kilicho Thibitishwa cha {courseName}

source: To receive a certificate, you must also verify your identity before %(date)s.
sw_ke: Kupokea cheti, lazima pia uthibitishe kitambulisho chako kabla %(date)s.

source: To receive a certificate, you must also verify your identity.
sw_ke: Kupokea cheti, lazima pia uthibitishe kitambulisho chako.

source: To verify your identity, you need a webcam and a government-issued photo ID.
sw_ke: Kuthibitisha kitambulisho chako, wahitaji webcam na Kitambulisho cha picha kilichotolewa na serikali.

source: Your ID must be a government-issued photo ID that clearly shows your face.
sw_ke: Kitambulisho chako lazima kiwe cha picha kilichotolewa na serikali ambacho kionyesha wazi wazi sura yako.

source: You will use your webcam to take a picture of your face and of your government-issued photo ID.
sw_ke: Utatumia webcam yako kupiga picha ya sura yako na pamoja na ya Kitambulisho cha picha kilichotolewa na serikali.

source: Thank you! We have received your payment for {courseName}.
sw_ke: Asante! Tume pokea malipo yako ya {courseName}.

source: Next Step: Confirm your identity
sw_ke: Hatua ifuatayo: Thibitisha kitambulisho chako

source: Check your email
sw_ke: Angalia barua pepe yako

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email.
sw_ke: Unahitaji kuamsha akaunti yako kabla uweze kujisajili katika kozi zako. Angalia kisanduku chako cha mapokezi kwa ujumbe wa barua pepe ya kuamsha.

source: A driver's license, passport, or government-issued ID with your name and photo.
sw_ke: Leseni ya uendeshaji gari, pasipoti, au kitambulisho ulichopewa na serikali kikiwa na jina lako na picha yako.

source: If you don't verify your identity now, you can still explore your course from your dashboard. You will receive periodic reminders from %(platformName)s to verify your identity.
sw_ke: Kama huwezi kusawazisha kitambulisho chako sasa, bado waweza kuingia kwa fanni yako kupitia Dashboard yako. Utapokea makumbusho ya baada kila muda kutoka %(platformName)s kusawazisha kitambulisho chako.

source: Identity Verification In Progress
sw_ke: Uthibitisho wa Kitambulisho Unaendelea

source: We have received your information and are verifying your identity. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days). In the meantime, you can still access all available course content.
sw_ke: Tumepokea habari zako na tunathibitisha kitambulisho chako. Utaona ujumbe kwenye dashibodi yako ikiwa shughuli za ithbati zimekamilika (usually within 1-2 days). Kwa sasa hivi, unaweza kufikia yaliyomo yanayopatikana yote ya kozi.

source: Return to Your Dashboard
sw_ke: Rudi kwa Dashibodi yako

source: Review Your Photos
sw_ke: Tizama upya Picha Zako

source: Make sure we can verify your identity with the photos and information you have provided.
sw_ke: Hakikisha waweza kuthibitisha kitambulisho chako na picha pamoja na taarifa uliotoa.

source: Photo of %(fullName)s
sw_ke: Picha ya %(fullName)s

source: Photo of %(fullName)s's ID
sw_ke: Picha ya Kitambulisho %(fullName)s's

source: Photo requirements:
sw_ke: Mahitaji ya picha:

source: Does the photo of you show your whole face?
sw_ke: Je picha yako imetowa sura yako yote?

source: Does the photo of you match your ID photo?
sw_ke: Je picha yako inalingana na picha ya Kitambulisho chako?

source: Is your name on your ID readable?
sw_ke: Je jina lako kwenye Kitambulisho chako lina someka?

source: Does the name on your ID match your account name: %(fullName)s?
sw_ke: Je jina lako kwenye Kitambulisho chako ni sawia na jina la akaunti yako: %(fullName)s?

source: Edit Your Name
sw_ke: Hariri Jina Lako

source: Make sure that the full name on your account matches the name on your ID.
sw_ke: Hakikisha ya kwamba jina lako kamili kwenye akaunti yako ni sawia na jina kwenye Kitambulisho chako.

source: Photos don't meet the requirements?
sw_ke: Picha zako hazifikii mahitaji?

source: Retake Your Photos
sw_ke: Piga upya Picha Zako

source: Before proceeding, please confirm that your details match
sw_ke: Kabla kuendelea, tafadhali thibitisha kuwa tondoti zako zinalingana

source: Don't see your picture? Make sure to allow your browser to use your camera when it asks for permission.
sw_ke: Picha yako haionekani? Hakikisha unaruhusu uvinjari wako kutumia kamera yako inapo uliza ruhusa.

source: Live view of webcam
sw_ke: Mtizamo hai wa webcam

source: Retake Photo
sw_ke: Piga upya Picha

source: Take Photo
sw_ke: Piga Picha

source: Limit Access
sw_ke: Kisia Uwezo wa Upatikanaji

source: Select a prerequisite subsection and enter a minimum score percentage to limit access to this subsection.
sw_ke: Chagua sharti kifungu kidogo na uingize asilimia ya alama ya chini kutia kikomo kwa kifungu kidogo hiki.

source: Prerequisite:
sw_ke: Sharti

source: No prerequisite
sw_ke: Hakuna sharti

source: Minimum Score:
sw_ke: Alama ya kiwango cha chini

source: The minimum score percentage must be a whole number between 0 and 100.
sw_ke: Alama ya chini kwa asili mia lazima iwe ni nambari nzima baina ya 0 na 100

source: Use as a Prerequisite
sw_ke: Tumia kama Sharti

source: Make this subsection available as a prerequisite to other content
sw_ke: Fanya kifungu kidogo hiki kipatikane kama sharti kwa mengi yaliyomo

source: Drag and drop or click here to upload video files.
sw_ke: Buruta na ubwage au bonyeza hapa kupakia faili za video

source: Active Uploads
sw_ke: Upakizi Uliomchangamfu

source: status
sw_ke: Hadhi / Hali

source: Add Component:
sw_ke: Ongeza Kipengele:

source: %(type)s Component Template Menu
sw_ke: %(type)s Orodha ya Vigezo vya Kipengele

source: Common Problem Types
sw_ke: Aina za Matatizo ya Kawaida

source: Add New Component
sw_ke: Ongeza Kipengele Kipya

source: Deprecated
sw_ke: Kulalamikia / Kupinga

source: List of uploaded files and assets in this course
sw_ke: Orodha ya faili zilizo pakiwa na mali katika kozi hii

source: - Sortable
sw_ke: Kuchagulika

source: Show All
sw_ke: Onyesha Zote

source: Other
sw_ke: Mwengine

source: You haven't added any assets to this course yet.
sw_ke: Bado hauja ongeza mali yoyote kwa fanni hii.

source: Upload your first asset
sw_ke: Pakia mali yako ya kwanza

source: close
sw_ke: Funga

source: No description available
sw_ke: Hakuna maelezo yapatikanayo

source: Open/download this file
sw_ke: Fungua/shukisha faili hii

source: Web:
sw_ke: Mtandao

source: Delete this asset
sw_ke: Futa mali hii

source: Lock this asset
sw_ke: Fungia mali hii

source: Lock/unlock file
sw_ke: Fungia/fungulia faili

source: ID
sw_ke: KITAMBULISHO

source: Certificate Details
sw_ke: Undani wa Cheti

source: Course Title
sw_ke: Kichwa cha Fanni

source: Course Title Override
sw_ke: Kichwa Tawala katika Fanni

source: Course Number
sw_ke: Nambari ya Fanni

source: Course Number Override
sw_ke: Idadi Kubwa zaidi katika Fanni

source: Certificate Signatories
sw_ke: Wasahihishi wa Cheti

source: It is strongly recommended that you include four or fewer signatories. If you include additional signatories, preview the certificate in Print View to ensure the certificate will print correctly on one page.
sw_ke: Imependekezwa kwa nguvu kuwa wawepo wanne au wasahihishi kidogo. Ukiongeza wasahihishi zaidi, tizama kabla cheti kwa Mtazamo wa Kuchapisha kuhakikisha cheti kitachapishwa sawa sawa katika ukurasa mmoja.

source: error.message
sw_ke: ujumbe wa hitlafu

source: Certificate Information
sw_ke: Maelezo ya Cheti

source: Certificate Name
sw_ke: Jina la Kwenye Cheti

source: Name of the certificate
sw_ke: Jina la cheti

source: Description of the certificate
sw_ke: Maelezo Kuhusu Cheti

source: Course title
sw_ke: Kichwa cha fanni

source: Specify an alternative to the official course title to display on certificates. Leave blank to use the official course title.
sw_ke: Fafanua namna nyingine kwa kichwa rasmi cha fanni kitakacho onnekana kwenye cheti. Acha nafasi itumike kwa kichwa rasmi cha fanni.

source: Add Additional Signatory
sw_ke: Ongeza Msahihishi wa Ziada

source: Choose mode
sw_ke: Chagua modi

source: Preview Certificate
sw_ke: Mtazamo Kabla wa Cheti

source: Activate
sw_ke: Amsha

source: Deactivate
sw_ke: Laza

source: Caution: The last published version of this unit is live. By publishing changes you will change the student experience.
sw_ke: Tahadhari: Chapisho la mwisho la kitengo hiki liko hai. Kwa kuchapisha mabadiliko utabadilisha uzoefu wa wanafunzi.

source: Cannot delete when in use by a unit
sw_ke: Haiwezi kufuta ikiwa inatumika na kitengo

source: This content group is used in:
sw_ke: Kundi hili la yaliyomo linatumika katika:
