Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: must be {0} characters or fewer
sw_ke: lazima ziwe herufi {0} au pungufu

source: Must be more complex ({0})
sw_ke: Lazima iwe ngumu zaidi ({0})

source: must contain {0} or more uppercase characters
sw_ke: lazima iwe na herufi kubwa {0} au zaidi

source: must contain {0} or more lowercase characters
sw_ke: lazima iwe na herufi ndogo {0} au zaidi

source: must contain {0} or more digits
sw_ke: lazima iwe na tarakimu {0} au zaidi

source: must contain {0} or more punctuation characters
sw_ke: lazima iwe na alama za maandishi {0} au zaidi

source: must contain {0} or more non ascii characters
sw_ke: lazima iwe na herufi {0} au zaidi zisizo za ascii

source: must contain {0} or more unique words
sw_ke: lazima iwe na {0} au maneno ya kipekee zaidi

source: Too similar to a restricted dictionary word.
sw_ke: Ina fanana sana na kamusi yenye maneno yaliowekewa vikwazo.

source: To disable the XBlock and prevent rendering in the LMS, leave "Enabled" deselected; for clarity, update XBlockStudioConfiguration support state accordingly.
sw_ke: Kuzima XBlock na kuzuia kuitoa kwenye LMS, acha "Enabled" ikiwa haijachaguliwa; kwa ufafanuzi, sasisha hali ya usaidizi ya XBlockStudioConfiguration ipasavyo.

source: Only XBlocks listed in a course's Advanced Module List can be flagged as deprecated. Remember to update XBlockStudioConfiguration support state accordingly, as deprecated does not impact whether or not new XBlock instances can be created in Studio.
sw_ke: Ni XBlocks pekee iliyoorodheshwa kwenye Orodha ya Moduli Pevu inaweza kuwekewa alama kuwa inalalamikiwa. Kumbuka kusasisha usaidizi wa XBlockStudioConfiguration ipasavyo, kama kulalamikiwa kwake hakutaathiri ikiwa matukio mapya ya XBlock yanaweza kutengenezwa kwenye Studio.

source: XBlock/template combinations that are disabled cannot be edited in Studio, regardless of support level. Remember to also check if all instances of the XBlock are disabled in XBlockConfiguration.
sw_ke: Mchanganyiko wa XBlock/template ambao umezimwa hauwezi kuhaririwa kwenye Studio, bila kujali kiwango cha msaada. Kumbuka pia kuangalia kama matukio yote ya XBlock yamezimwa kwenye XBlockConfiguration.

source: Enabled XBlock/template combinations with full or provisional support can always be created in Studio. Unsupported XBlock/template combinations require course author opt-in.
sw_ke: Mchanganyiko wa XBlock/template uliowezeshwa moja kwa moja au kwa muda mfupi kila wakati unaweza kutengenezwa kwenye Studio. Mchanganyiko wa XBlock/template usiosaidiwa unahitaji uamuzi wa mtunzi wa kozi.

source: show deprecation messaging in Studio
sw_ke: onesha ujumbe wa malalamiko kwenye Studio

source: Fully Supported
sw_ke: Yenye Usaidizi Kamilifu

source: Provisionally Supported
sw_ke: Yenye Usaidizi wa Muuda

source: Unsupported
sw_ke: Isiyo na Usaidizi

source: Cannot rescore problems with possible file submissions
sw_ke: Haiwezi kuweka alama upya kwa matatizo yaliyo na uwezekano wa uwasilishaji

source: Incorrect
sw_ke: Si sahihi

source: Correct
sw_ke: Sahihi

source: correct
sw_ke: Sahihi

source: incorrect
sw_ke: si sahihi

source: partially correct
sw_ke: sahihi kiasi

source: incomplete
sw_ke: liko pungufu

source: unanswered
sw_ke: halijajibiwa

source: submitted
sw_ke: limewasilishwa

source: processing
sw_ke: Utayarishaji

source: This answer is correct.
sw_ke: Jibu hili ni sahihi.

source: This answer is incorrect.
sw_ke: Jibu hili si sahihi.

source: This answer is partially correct.
sw_ke: Jibu hili ni sahihi kiasi.

source: This answer is being processed.
sw_ke: Jibu hili lina tayarishwa.

source: Not yet answered.
sw_ke: Haijajibiwa.

source: Select an option
sw_ke: Chagua uamuzi

source: ChoiceGroup: unexpected tag {tag_name}
sw_ke: Kundi la Chaguo: tag isotarajiwa {tag_name}

source: Answer received.
sw_ke: JIbu limepokelewa.

source: Expected a <choice> or <compoundhint> tag; got {given_tag} instead
sw_ke: Tag ya <choice> au <compoundhint> inatarajiwa; umepata {given_tag} badala yake

source: Your files have been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
sw_ke: Faili yako imefikishwa. Pindi ufikishaji wako utapewa daraja, ujumbe huu utabadilishwa kwa jibu la mtoaji daraja.

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
sw_ke: Jibu lako limefikishwa. Pindi ufikisho wako utapewa daraja, ujumbe huu utabadilishwa kwa jibu la mtoaji daraja.

source: {programming_language} editor
sw_ke: {programming_language} mhariri

source: Press ESC then TAB or click outside of the code editor to exit
sw_ke: Bonyeza ESC halafu TAB au bofya nje ya alama ya mhariri ili kutoka

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
sw_ke: Umefikisha. Pindi jibu litarudishwa, ujumbe huu utabadilishwa kwa jibu lile.

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
sw_ke: Hakuna jibu kutoka kwa Xqueue kwenye {xqueue_timeout} sekunde. Haribu.

source: Error running code.
sw_ke: Hitilafu katika kuendesha kificho.

source: Cannot connect to the queue
sw_ke: Haiwezi kuunganisha kwenye msururu / mlolongo

source: No formula specified.
sw_ke: Hakuna kanuni iliyobainishwa.

source: Couldn't parse formula: {error_msg}
sw_ke: Haikuweza kuchanganua virai vya maelezo: {error_msg}

source: Error while rendering preview
sw_ke: Hitlafu tukipeana mtazamo kabla

source: Sorry, couldn't parse formula
sw_ke: Samahani hatukuweza kuchanganua virai vya mazungumzo

source: {input_type}: unexpected tag {tag_name}
sw_ke: {input_type}: tag isiotarajiwa {tag_name}

source: Expected a {expected_tag} tag; got {given_tag} instead
sw_ke: Tag ya {expected_tag} inayotarajiwa; umepata {given_tag} badala yake

source: Question {index}
sw_ke: Swali {index}

source: Correct:
sw_ke: Sahihi

source: Incorrect:
sw_ke: Sio sahihi

source: Answer
sw_ke: Jibu

source: Error {err} in evaluating hint function {hintfn}.
sw_ke: Hitilafu {err} katika kutathmini kutoa dokezo {hintfn}.

source: (Source code line unavailable)
sw_ke: (Mstari wa kificho asili haupatikani)

source: See XML source line {sourcenum}.
sw_ke: Tizama mstari asili wa XML {sourcenum}.

source: Checkboxes
sw_ke: Visanduku vya uhakiki

source: Multiple Choice
sw_ke: Majibu Mchanganyiko

source: Do not use shuffle and answer-pool at the same time
sw_ke: Usitumie ugeuzi na dimbwi-majibu kwa wakati mmoja

source: answer-pool value should be an integer
sw_ke: tathmini ya dimbwi-majibu ina stahili kuwa nambari kamili

source: Choicegroup must include at least 1 correct and 1 incorrect choice
sw_ke: Kundi la chaguo lazima liwe na chaguo japo 1 sahihi na 1 sio sahihi

source: True/False Choice
sw_ke: Chaguo la Kweli/Si kweli

source: Dropdown
sw_ke: Angushia chini

source: Numerical Input
sw_ke: Ungizaji kwa Nambari

source: There was a problem with the staff answer to this problem.
sw_ke: Kulikuwa na shida na jibu la mfanyakazi kwa tatizo hili.

source: Could not interpret '{student_answer}' as a number.
sw_ke: Haikuweza kutafsiri '{student_answer}' kama nambari.

source: You may not use variables ({bad_variables}) in numerical problems.
sw_ke: Waweza usitumie vigeugeu ({bad_variables}) katika matatizo ya kinambari.

source: Factorial function evaluated outside its domain:'{student_answer}'
sw_ke: Swali lenye mtiririko wa namba limeingizwa pasipo sahihi:'{student_answer}'

source: Invalid math syntax: '{student_answer}'
sw_ke: hisabu za syntax batili: '{student_answer}'

source: You may not use complex numbers in range tolerance problems
sw_ke: waweza usitumie nambari mchanganyiko katika uvumilivu wa matatizo ya masafa

source: There was a problem with the staff answer to this problem: complex boundary.
sw_ke: Kulikuwa na shida kwa jibu la mfanyakazi katika tatizo hili: mipaka mchanganyiko.

source: There was a problem with the staff answer to this problem: empty boundary.
sw_ke: Kulikuwa na shida na jibu la mfanyakazi kwa tatizo hili: mipaka mitupu.

source: or
sw_ke: au

source: Text Input
sw_ke: Uingizaji wa Maandishi

source: error
sw_ke: hitilafu

source: Custom Evaluated Script
sw_ke: Desturi za Tathmini ya Waraka

source: error getting student answer from {student_answers}
sw_ke: hitilafu kupata jibu la mwanafunzi kutoka kwenye {student_answers}

source: No answer entered!
sw_ke: Hakuna jibu lililoingizwa!

source: CustomResponse: check function returned an invalid dictionary!
sw_ke: Desturi ya Ujibishaji: kazi ya kutizama ilirudisha kamusi batili!

source: Symbolic Math Input
sw_ke: Uingizaji wa Alama za Kihesabu

source: An error occurred with SymbolicResponse. The error was: {error_msg}
sw_ke: Hitlafu ilitokea na Majibisho ya Alama. Hitlafu ilikuwa: {error_msg}

source: Code Input
sw_ke: Uingizaji wa Kificho

source: No answer provided.
sw_ke: Hakuna jibu lililo tolewa.

source: Error: No grader has been set up for this problem.
sw_ke: Hitlafu: Hakuna mtowaji daraja amewekwa kwa tatizo hili.

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
sw_ke: Haikuweza kupeleka ufikishaji wako kwa mtoaji daraja (Sababu: {error_msg}). Tafadhali jaribu tena baadae.

source: Invalid grader reply. Please contact the course staff.
sw_ke: Jibu la mtoaji daraja batili: Tafadhali wasiliana na mfanyi kazi wa kozi.

source: External Grader
sw_ke: Mtoaji Daraja wa Nje

source: Math Expression Input
sw_ke: Uingizaji wa Maelezo ya Kihisabu

source: Invalid input: {bad_input} not permitted in answer.
sw_ke: Uingizaji batili: {bad_input} hairuhusiwi kwa jibu.

source: Factorial function not permitted in answer for this problem. Provided answer was: {bad_input}
sw_ke: Jibu lenye mtiririko wa namba haliruhusiwi kwenye swali hili. Jibu lililotolewa ni: {bad_input}

source: Invalid input: Could not parse '{bad_input}' as a formula.
sw_ke: Uingizaji batili: Haungeweza kuchanganua '{bad_input}' kama virai vya maelezo.

source: Invalid input: Could not parse '{bad_input}' as a formula
sw_ke: UIngizaji batili: Haungeweza kuchanganua '{bad_input}' kama virai vya maelezo

source: Circuit Schematic Builder
sw_ke: Duru ya Ujenzi wa Schematic

source: Error in evaluating SchematicResponse. The error was: {error_msg}
sw_ke: Hitlafu katika kutathmini Jibu la Schematic. Hitlafu ilikuwa: {error_msg}

source: Image Mapped Input
sw_ke: Uingizaji wa Taswira ya Ramani

source: error grading {image_input_id} (input={user_input})
sw_ke: hitlafu ya upeanaji wa daraja {image_input_id} (input={user_input})

source: Error in problem specification! Cannot parse rectangle in {sr_coords}
sw_ke: Hitlafu katika kutaja matatizo! Haiwezi kuchanganua mstatili kwenye {sr_coords}

source: Annotation Input
sw_ke: Uingizaji wa Fafanuzi

source: Checkboxes With Text Input
sw_ke: Visanduku vya kuhakikisha Na Uingizaji wa Jumbe

source: Answer not provided for {input_type}
sw_ke: Jibu halikutolewa kwa {input_type}

source: The Staff answer could not be interpreted as a number.
sw_ke: Jibu la mfanyikazi halikuweza kutafsiriwa kama nambari.

source: Could not interpret '{given_answer}' as a number.
sw_ke: Haikuweza kutafsiri '{given_answer}' kama nambari.

source: XML data for the annotation
sw_ke: Takwimu ya XML kwa fafanuzi

source: The display name for this component.
sw_ke: Jina la kizinzo kwa kipengele hiki.

source: Annotation
sw_ke: Ufafanuzi

source: Blank Advanced Problem
sw_ke: Uboreshaji wa Tatizo Mtupu

source: Number of attempts taken by the student on this problem
sw_ke: Idadi ya majaribio yaliochukuliwa na wanafunzi kwenye tatizo hili

source: Maximum Attempts
sw_ke: Majaribio ya Kiwango cha Juu Kabisa

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
sw_ke: Ina fafanua idadi ya mara kwa mwanafunzi kujaribu kujibu tatizo hili. Kama tathmini haijawekwa, majaribio yasio kikomo yanakubalika.

source: Date that this problem is due by
sw_ke: Tarehe ya mwisho ambayo tatizo hili linamalizika

source: Amount of time after the due date that submissions will be accepted
sw_ke: Kima cha wakati baada ya tarehe ya mwisho mafikisho yatakubaliwa

source: Show Results
sw_ke: Onesha matokeo

source: Defines when to show whether a learner's answer to the problem is correct. Configured on the subsection.
sw_ke: Inafafanua wazi wakati wa kuonesha ikiwa mwanafunzi amejibu swali kwa usahihi. Imesabidiwa kwenye kifungu kidogo.

source: Always
sw_ke: Daima

source: Never
sw_ke: Kamwe

source: Past Due
sw_ke: Pitisha Muda wake

source: Show Answer
sw_ke: Onesha Jibu

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
sw_ke: Inafafanua lini una onyesha majibu ya tatizo. Thamani ya kasoro inaweza kuwekwa kwa Mikakati Iliyoboreshwa.

source: Answered
sw_ke: Imejibiwa

source: Attempted
sw_ke: Imejaribiwa

source: Closed
sw_ke: Imefungwa

source: Finished
sw_ke: Imemalizika

source: Correct or Past Due
sw_ke: Sahihi au Imepita Muda Wake

source: Whether to force the save button to appear on the page
sw_ke: Ima ulazimishe kifungo cha udhibiti kitokeze katika ukurasa

source: Show Reset Button
sw_ke: Onyesha Kifungo cha Kuweka upya

source: Determines whether a 'Reset' button is shown so the user may reset their answer. A default value can be set in Advanced Settings.
sw_ke: Ina bainisha kama kifungo cha 'Kuweka Mikakti upya' kimeonyeshwa ili mtumiaji aweze kuweka upya majibu yao. Thamani ya kasoro inaweza kuwekwa kwa Mikakati iliyo Boreshwa.

source: Randomization
sw_ke: Bila mpangilio maalum

source: Defines when to randomize the variables specified in the associated Python script. For problems that do not randomize values, specify "Never".
sw_ke: Ina bainisha lini kuchukua bila ya mpangilio wa vigeugeu vilivyotajwa katika Chatu wa nyaraka. Kwa matatizo ambayo hayana thamani ya bila ya mpangilio, taja "Hapana".

source: On Reset
sw_ke: Kwa Kupanga upya

source: Per Student
sw_ke: Kwa Kila Mwanafunzi

source: XML data for the problem
sw_ke: Takwimu za XML za tatizo

source: Dictionary with the correctness of current student answers
sw_ke: Kamusi iliyo na usahihi wa majibu ya sasa ya wanafunzi

source: Dictionary for maintaining the state of inputtypes
sw_ke: Kamusi ya kudumisha hali ya aina za uingizaji

source: Dictionary with the current student responses
sw_ke: Kamusi iliyo na majibu ya sasa ya mwanafunzi

source: Whether or not the answers have been saved since last submit
sw_ke: Iwapo majibu yamehifadhiwa tangu yalipowasilishwa kwa mara ya mwisho au la

source: Whether the student has answered the problem
sw_ke: Kama mwanafunzi amejibu ya tatizo

source: Random seed for this student
sw_ke: Mbegu za kubahatisha kwa mwanafunzi huyu

source: Last submission time
sw_ke: Muda wa mwisho wa kuwasilisha

source: Timer Between Attempts
sw_ke: Wakati Baina ya Majaribio

source: Seconds a student must wait between submissions for a problem with multiple attempts.
sw_ke: Sekunde ambazo mwanafunzi lazima asubiri baina ya ufikishaji wa tatizo na majaribio mchanganyiko.

source: Problem Weight
sw_ke: Uzani wa Tatizo

source: Defines the number of points each problem is worth. If the value is not set, each response field in the problem is worth one point.
sw_ke: Ina baini idadi ya alama kwa kila tatizo lina gharimu. Ikiwa tathmini haija wekwa, kila kiwanja cha jibu katika tatizo lina gharimu alama moja.

source: Markdown source of this module
sw_ke: Weka alama ya asii ya kipimo hiki

source: Source code for LaTeX and Word problems. This feature is not well-supported.
sw_ke: Kificho asili cha LaTeX na Matatizo ya maneno. Sehemu hii haina usaidizi wa kutosha.

source: Enable LaTeX templates?
sw_ke: Wezesha vigezo vya LaTeX?

source: Matlab API key
sw_ke: Funguo ya Matlab API

source: Submit
sw_ke: Wasilisha

source: Submitting
sw_ke: Uwasilishaji

source: Warning: The problem has been reset to its initial state!
sw_ke: Onyo: Tatizo limekakatishwa tena kwa hali yake ya mwanzo!

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
sw_ke: Hali ya tatizo ilifisidishwa na ufikishaji usio halali. Ufikishaji ulijumuisha:

source: If this error persists, please contact the course staff.
sw_ke: Kama tatizo hili linaendelea, tafadhali wasiliana wafanyi kazi wa kozi.

source: Hint ({hint_num} of {hints_count}):
sw_ke: Fununu ({hint_num} ya {hints_count}):

source: Your answers were previously saved. Click '{button_name}' to grade them.
sw_ke: Majibu yako yalihifadhiwa hapo awali. Bofya '{button_name}' kuyapanga kwenye madaraja.

source: Incorrect ({progress} point)
sw_ke: Isiyo sahihi ({progress} pointi)

source: Correct ({progress} point)
sw_ke: Sahihi ({progress} pointi)

source: Partially correct ({progress} point)
sw_ke: Sahihi kiasi ({progress} pointi)

source: Partially Correct
sw_ke: Sahihi Kiasi

source: Answer submitted.
sw_ke: Jibu limewasilishwa.

source: Problem is closed.
sw_ke: Tatizo limefungwa.

source: Problem must be reset before it can be submitted again.
sw_ke: Tatizo lazima liwekwe upya kabla ya kuwasilishwa tena.

source: You must wait at least {wait} seconds between submissions.
sw_ke: Lazima usubiri kwa japo {wait} sekunde baina ya ufikishaji.

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
sw_ke: Lazima usubiri kwa japo {wait_sec} baina ya ufikishaji. {remaining_secs} zimebaki.

source: {num_hour} hour
sw_ke: {num_hour} jisaa

source: {num_minute} minute
sw_ke: {num_minute} dakika

source: {num_second} second
sw_ke: {num_second} sekunde

source: Problem needs to be reset prior to save.
sw_ke: Tatizo linahitaji kupangwa upya kabla ya kuhifadhiwa.

source: Your answers have been saved.
sw_ke: Majibu yako yamehifadhiwa.

source: Your answers have been saved but not graded. Click '{button_name}' to grade them.
sw_ke: Majibu yako yamehifadhiwawa lakini hayajapangwa katika madaraja. Bonyeza '{button_name}' kuyapanga katika madaraja.

source: You cannot select Reset for a problem that is closed.
sw_ke: Huwezi kuchagua Weka upya kwa tatizo lililofungwa.

source: You must submit an answer before you can select Reset.
sw_ke: Lazima uwasilishe jibu kabla ya kuchagua Weka upya.

source: Problem's definition does not support rescoring.
sw_ke: Ufafanuzi wa tatizo hausaidii kupata alama upya.

source: Problem must be answered before it can be graded again.
sw_ke: Tatizo lazima litatuliwe kabla ya kupangwa kwenye daraja tena.

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
sw_ke: Samahani, kulikuwa na hitilafu kwenye kushughulikia ombi lako. Tafadhali jaribu kupakia upya ukurasa wako na ujaribu tena.

source: The state of this problem has changed since you loaded this page. Please refresh your page.
sw_ke: Hali ya tatizo hili imebadilika tangu upakie ukurasa huu. Tafadhali anzisha upya ukurasa wako.

source: Conditional
sw_ke: Yenye masharti

source: List of urls of children that are references to external modules
sw_ke: Orodha ya urls za watoto ambazo ni kumbukumbu za moduli za nje

source: Source Components
sw_ke: Vipengele Chanzo

source: The component location IDs of all source components that are used to determine whether a learner is shown the content of this conditional module. Copy the component location ID of a component from its Settings dialog in Studio.
sw_ke: Kipengele cha kitambulisho cha mahali ambacho ni chanzo cha vipengele vyote vinavyotumika kuamua iwapo mwanafunzi anaoneshwa maudhui ya moduli ya sharti. Nakili kipengele cha kitambulisho cha mahali kinachotoka kwenye kidirisha cha Mitegesho kwenye Studio.

source: Conditional Attribute
sw_ke: Sifa ya Sharti

source: The attribute of the source components that determines whether a learner is shown the content of this conditional module.
sw_ke: Sifa ya vipengele vya chanzo vinavyoamua iwapo mwanafunzi anaoneshwa maudhui ya moduli ya sharti hili.

source: Conditional Value
sw_ke: Thamani ya Sharti

source: The value that the conditional attribute of the source components must match before a learner is shown the content of this conditional module.
sw_ke: Thamani ambayo sifa ya thamani ya vipengele vya chanzo lazima vilingane kabla mwanafunzi hajaoneshwa maudhui ya moduli ya sharti.

source: Blocked Content Message
sw_ke: Ujumbe wa Maudhui Uliozuiwa

source: The message that is shown to learners when not all conditions are met to show the content of this conditional module. Include {link} in the text of your message to give learners a direct link to required units. For example, 'You must complete {link} before you can access this unit'.
sw_ke: Ujumbe unaooneshwa kwa wanafunzi wakati ambapo masharti yote hayajatimizwa kuonesha moduli hii ya sharti. Weka {link} kwenye maandishi ya ujumbe wako kuwapa wanafunzi kiungo cha moja kwa moja kupata vitengo vinavyohitajika. Kwa mfano, 'Lazima ukamilishe {link} kabla ya kukifikia kitengo hiki'.

source: You must complete {link} before you can access this unit.
sw_ke: Lazima ukamilishe {link} kabla ya kukifikia kitengo hiki.

source: This component has no source components configured yet.
sw_ke: Kipengele hiki hakina vipengele chanzo vilivyosabidiwa.

source: Configure list of sources
sw_ke: Sabidi orodha ya vyanzo

source: LTI Passports
sw_ke: Pasipoti za LTI

source: Enter the passports for course LTI tools in the following format: "id:client_key:client_secret".
sw_ke: Ingiza pasipoti kwa vifaa vya LTI vya kozi katika mfumo ufuatao: "id:client_key:client_secret".

source: List of Textbook objects with (title, url) for textbooks used in this course
sw_ke: Orodha ya vitu katika Vitabu vya kiada vikiwa na (jina, url) kwa vitabu vya kiada vitumikavyo kwenye kozi hii

source: Slug that points to the wiki for this course
sw_ke: Slug inayo shiria kwa wiki kwenye kozi hii

source: Date that enrollment for this class is opened
sw_ke: Tarehe ambayo uandishi wa darasa hili utafunguliwa

source: Date that enrollment for this class is closed
sw_ke: Tarehe ambayo uandikishaji wa darasa hili utafungwa

source: Start time when this module is visible
sw_ke: Wakati ambapo hizi moduli zitaanza kuonekana

source: Date that this class ends
sw_ke: Tarehe ambayo hili darasa linamaliza

source: Cosmetic Course Display Price
sw_ke: Bei Iliyopangwa ya Uonyeshaji wa Kozi ya Kipodozi

source: The cost displayed to students for enrolling in the course. If a paid course registration price is set by an administrator in the database, that price will be displayed instead of this one.
sw_ke: Gharama inayoonyeshwa wanafunzi kwa kujisajili wa kozi hii. Ikiwa bei itatolewa kwa uandikishaji wa kozi kwa malipo na mtawala katika msingi wa takwimu, bei hiyo itaonyeshwa badala ya hii.

source: Course Advertised Start
sw_ke: Kuanza kwa Kozi Iliyotangazwa

source: Enter the text that you want to use as the advertised starting time frame for the course, such as "Winter 2018". If you enter null for this value, the start date that you have set for this course is used.
sw_ke: Ingiza maandishi unayotaka kuyatumia kwenye muundo wa muda wa kuanza kutangaza kozi, kama vile, "Majira ya Joto 2018". Kama ukitangua thamani hii, tarehe ya kuanza uliyotegesha kwa ajili ya kozi hii itatumika.

source: Pre-Requisite Courses
sw_ke: Masharti ya Awali ya Kozi

source: Pre-Requisite Course key if this course has a pre-requisite course
sw_ke: Masharti muhimu ya awali ya Kozi kama kozi hii ina masharti ya ya awali ya kozi

source: Grading policy definition for this class
sw_ke: Ufafanuzi wa sera za utoaji daraja kwenye hili darasa

source: Show Calculator
sw_ke: Onyesha Kikokotoo

source: Enter true or false. When true, students can see the calculator in the course.
sw_ke: Ingiza ni kweli au si kweli. Kamani kweli, wanafunzi wanaweza kuona kikokotoo katika kozi.
