Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: You can not move an item into itself.
sw_ke: Huwezi kupeleka kipengele hiki ndani ya chenyewe.

source: You can not move an item into it's child.
sw_ke: Huwezi kupeleka kipengele kwenye kipengele kidogo zaidi yake.

source: You can not move an item directly into content experiment.
sw_ke: Huwezi kupeleka kipengele hiki moja kwa moja kwenye sehemu ya majaribio.

source: {source_usage_key} not found in {parent_usage_key}.
sw_ke: {source_usage_key} hakikupatikana kwenye {parent_usage_key}.

source: You can not move {source_usage_key} at an invalid index ({target_index}).
sw_ke: Huwezi kupeleka {source_usage_key} katika namba batili ({target_index}).

source: You must provide target_index ({target_index}) as an integer.
sw_ke: Lazima uweke namba sahihi ({target_index}) kama vile namba kamili.

source: Duplicate of {0}
sw_ke: Nakala ya {0}

source: Duplicate of '{0}'
sw_ke: Nakala ya '{0}'

source: Students must score {score}{pct_sign} or higher to access course materials.
sw_ke: Wanafunzi lazima wapate alama {score}{pct_sign} au zaidi ilikupata nyenzo za kozi.

source: Unable to create library - missing required field '{field}'
sw_ke: Imeshindwa kutengeneza maktaba - inakosa somo husika '{field}'

source: Unable to create library '{name}'. {err}
sw_ke: Imeshindwa kutengeneza maktaba '{name}'. {err}

source: There is already a library defined with the same organization and library code. Please change your library code so that it is unique within your organization.
sw_ke: Tayari ipo maktaba iliyoelezwa na shirika hilo hilo na kificho cha maktaba hiyo hiyo. Tafadhali badilisha kificho chako cha maktaba ili iwe ya kipekee katika shirika lako.

source: Access restricted to: {list_of_groups}
sw_ke: Vile pekee unavyoweza kuvipata ni: {list_of_groups}

source: Incoming video data is empty.
sw_ke: Data ya video iingiyao ni tupu.

source: Can't find item by locator.
sw_ke: Haiwezi kupata kipengele kwa kiashiria.

source: Transcripts are supported only for "video" modules.
sw_ke: Nakala zinawezeshwa tu kwa moduli za "video".

source: Insufficient permissions
sw_ke: Ruhusa zisizo tosheleza

source: Could not find user by email address '{email}'.
sw_ke: Mtumiaji hakupatikana kwa anwani ya barua pepe ya '{email}'.

source: No `role` specified.
sw_ke: Hakuna 'jukumu' lililobainshwa.

source: User {email} has registered but has not yet activated his/her account.
sw_ke: Mtumiaji {email} amesajili lakini hajaamsha akaunti yake.

source: Invalid `role` specified.
sw_ke: Jukumu batili limebainishwa.

source: You may not remove the last Admin. Add another Admin first.
sw_ke: Waweza usiondoe Msimamizi wa mwisho. Ongeza Msimamizi mwingine kwanza.

source: Uploading
sw_ke: Kupakia maudhui

source: In Progress
sw_ke: Ina Endelea

source: Ready
sw_ke: Tayari

source: Uploaded
sw_ke: Imepakiwa

source: Failed
sw_ke: Haikufaulu

source: Cancelled
sw_ke: Imefutwa

source: Failed Duplicate
sw_ke: Nakala Iliyofeli

source: YouTube Duplicate
sw_ke: Nakala ya YouTube

source: Invalid Token
sw_ke: Namba Batili

source: Imported
sw_ke: Imepokelewa kutoka nje

source: Unknown
sw_ke: Haijulikani

source: Duration
sw_ke: Muda

source: Date Added
sw_ke: Tarehe Imewekwa

source: unrequested
sw_ke: haijaombwa

source: pending
sw_ke: Inasubiri kushughulikiwa

source: granted
sw_ke: Imepewa ruhusa

source: denied
sw_ke: Imekataliwa

source: Studio user
sw_ke: Mtumiaji studio

source: The date when state was last updated
sw_ke: Tarehe mwisho ya usasishaji wa taarifa

source: Current course creator state
sw_ke: Hali ilivyo ya sasa ya utengenezaji kozi

source: Optional notes about this user (for example, why course creation access was denied)
sw_ke: Nukuu za hiari kuhusu mtumiaji huyu (mfano, kwanini fursa ya kuandaa kozi haikutolewa)

source: Force Publish Course
sw_ke: Lazimisha Uchapishaji wa Kozi

source: Sometimes the draft and published branches of a course can get out of sync. Force publish course command resets the published branch of a course to point to the draft branch, effectively force publishing the course. This view dry runs the force publish command
sw_ke: Wakati mwingine ukurasa na kozi na matawi yake yanaweza kutoka nje ya usawazishaji. Lazimisha mitegesho mipya ya uchapishaji matawi ya kozi na lazimisha ushapishaji kozi. Kipengele hiki kinaendasha uchapishaji wa lazima

source: Please provide course id.
sw_ke: Tafadhali toa kitambulisho cha kozi.

source: Invalid course key.
sw_ke: Kibonye batili cha kozi.

source: No matching course found.
sw_ke: Kozi inayolingana na hii haipo.

source: Force publishing course is not supported with old mongo courses.
sw_ke: Ulazimishaji wakuchapisha kozi haujawezeshwa na kozi za zamani za mongo.

source: Course is already in published state.
sw_ke: Kozi ipo katika hali ya uchapishaji.

source: Incorrect format for field '{name}'. {detailed_message}
sw_ke: Fomati siyo sahihi kwenye sehemu ya kujaza '{jina}'. {detailed_message}

source: Dictionary with the available tags
sw_ke: Kamusi yenye vibandiko vinavyopatikana.

source: Page Not Found
sw_ke: Ukurasa Haupatikani

source: Page not found
sw_ke: Ukurasa haupatikani

source: Content
sw_ke: Maudhui

source: Loading
sw_ke: Kupakia ujumbe

source: Settings
sw_ke: Mitegesho

source: Course Number
sw_ke: Namba ya Kozi

source: Course Outline
sw_ke: Muhtasari wa Kozi

source: Dismiss
sw_ke: Puuza

source: Course Start Date:
sw_ke: Tarehe ya Kuanza Kozi:

source: Error:
sw_ke: Kosa:

source: Organization:
sw_ke: Shirika:

source: Course Number:
sw_ke: Namba ya Kozi:

source: Courses
sw_ke: Kozi

source: Sign In
sw_ke: Ingia Mtandaoni

source: Sign In to {studio_name}
sw_ke: Jiunge Mtandaoni kwa {studio_name}

source: Don't have a {studio_name} Account? Sign up!
sw_ke: Huna akaunti {studio_name}? Jiunge!

source: Required Information to Sign In to {studio_name}
sw_ke: Taarifa inayohitajika kuingia kwenye {studio_name}

source: E-mail
sw_ke: Barua pepe

source: example: username@domain.com
sw_ke: mfano: jina la mtumiaji@miliki.com

source: Forgot password?
sw_ke: Umesahau nywila?

source: example: Jane Doe
sw_ke: mfano: Jane Doe

source: example: JaneDoe
sw_ke: mfano: JaneDoe

source: Course End Date
sw_ke: Tarehe ya Kumaliza Kozi

source: Instructors
sw_ke: Wakufunzi

source: Requirements
sw_ke: Yanayohitajika

source: Details
sw_ke: Utondoti

source: View
sw_ke: Tazama

source: Preview Language Setting
sw_ke: Pitia Mpangilio wa Lugha

source: Reset
sw_ke: Tegesha upya

source: Legal
sw_ke: Halali

source: Choose Language
sw_ke: Chagua Lugha

source: Account
sw_ke: Akaunti

source: Help
sw_ke: Usaidizi / Msaada

source: Looking for help with {studio_name}?
sw_ke: Kutafuta msaada na {studio_name}?

source: Hide {studio_name} Help
sw_ke: Ficha Msaada wa {studio_name}

source: {studio_name} Documentation
sw_ke: Nyaraka {studio_name}

source: Access documentation on http://docs.edx.org
sw_ke: Pata waraka kwenye http://docs.edx.org

source: edX Documentation
sw_ke: Waraka wa edX

source: Enroll in edX101: Overview of Creating an edX Course
sw_ke: Jiandikishe kwenye edX101: Muhtasari wa kuunda Kozi ya edX

source: Enroll in edX101
sw_ke: Jiandikishe kwenye edX101

source: Enroll in StudioX: Creating a Course with edX Studio
sw_ke: Jiandikishe kwenye StudioX: Unda Kozi na edX Studio

source: Enroll in StudioX
sw_ke: Jiandikishe kwenye StudioX

source: Send an email to {email}
sw_ke: Tuma barua pepe kwenda {email}

source: Contact Us
sw_ke: Wasiliana Nasi

source: Usermenu
sw_ke: Menyu ya mtumiaji

source: Usermenu dropdown
sw_ke: Alama inayoangalia chini menyu ya mtumiaji

source: Sign Out
sw_ke: Toka Mtandaoni

source: Code Editor
sw_ke: Kanuni mhariri

source: Feedback Form
sw_ke: Fomu ya Mrejesho

source: Email: {email}
sw_ke: Barua pepe: {email}

source: Full Name: {realname}
sw_ke: Jina Kamili: {realname}

source: Inquiry Type: {inquiry_type}
sw_ke: Aina ya ulizo: {inquiry_type}

source: Message: {message}
sw_ke: Ujumbe: {message}

source: Tags: {tags}
sw_ke: Vitambulisho: {tags}

source: Additional Info:
sw_ke: Maelezo ya ziada:

source: Feedback from user
sw_ke: Mrejesho kutoka kwa mtumiaji

source: Add a Post
sw_ke: Ongeza chapisho

source: Discussion thread list
sw_ke: Orodha ya majadiliano

source: New topic form
sw_ke: Mfumo mpya wa mada

source: Discussion - {course_number}
sw_ke: Majadiliano - {course_number}

source: %s discussion started
sw_ke: %s uzungumzi umeanza

source: %s comment
sw_ke: %s oni

source: Discussion unavailable
sw_ke: Mjadala haupatikani

source: The discussions are currently undergoing maintenance. We'll have them back up shortly!
sw_ke: Mijadala ipo kwenye maboresho kwasasa. Itarejea hivi punde

source: Collapse Instructions
sw_ke: 'Kaidi' Maagizo

source: Guided Discussion
sw_ke: Majadiliano yenye Muongozo

source: Hide Annotations
sw_ke: Ficha nukuu

source: Bookmarked
sw_ke: Imewekwa alama

source: Bookmark this page
sw_ke: Alamisha ukurasa huu

source: You do not have access to this dependency module.
sw_ke: Huna ruhusa kwenye module hii tegemezi

source: LEARN MORE
sw_ke: JIFUNZE ZAIDI

source: Starts
sw_ke: Inaanza

source: Starts: {date}
sw_ke: Kuanza: {Tarehe}

source: View all Courses
sw_ke: Angalia Kozi zote

source: Dashboard
sw_ke: Dashibodi

source: You are not enrolled in any courses yet.
sw_ke: Bado haujasajiliwa katika kozi yoyote.

source: Explore courses
sw_ke: Tafuta kozi

source: Course-loading errors
sw_ke: Hitilafu za upakiaji kozi

source: Search Your Courses
sw_ke: Tafuta Kozi Zako

source: Clear search
sw_ke: Futa utautaji

source: Account Status Info
sw_ke: Taarifa ya Hali ya Akaunti

source: Order History
sw_ke: Historia ya maagizo

source: Email Settings for {course_number}
sw_ke: Mitegesho ya Barua pepe {course_number}

source: Receive course emails
sw_ke: Pokea barua pepe za kozi

source: Save Settings
sw_ke: Hifadhi mitegesho

source: Unenroll
sw_ke: Tengua usajili

source: View Unit in Studio
sw_ke: Tazama Kitengo ndani ya Studio

source: E-mail change failed
sw_ke: Ubadilishaji wa barua pepe haukufaulu

source: We were unable to send a confirmation email to {email}
sw_ke: Tumeshindwa kutuma barua pepe ya uthibitisho kwa {email}

source: Go back to the {link_start}home page{link_end}.
sw_ke: Rudi kwenye {link_start}ukurasa wa mwanzo{link_end}.

source: E-mail change successful!
sw_ke: Ubadilishaji wa barua pepe umefaulu!

source: You should see your new email in your {link_start}dashboard{link_end}.
sw_ke: Unapaswa kuona barua pepe yako mpya kwenye {link_start}ubao{link_end}.

source: An account with the new e-mail address already exists.
sw_ke: Akaunti yenye anwani mpya ya barua pepe tayari ipo.

source: You should Register before trying to access the Unit
sw_ke: Unastahili Ujiandikishe kabla kujaribu kuifikia 'Sura/Mada'

source: Enroll
sw_ke: Sajili

source: Don't enroll
sw_ke: Usisajili

source: Student Enrollment Form
sw_ke: Fomu ya Usajili wa Mwanafunzi

source: Course:
sw_ke: Kozi:

source: Add new students
sw_ke: Ongeza wanafunzi wapya

source: Existing students:
sw_ke: Wanafunzi waliopo

source: New students added:
sw_ke: Wanafunzi wapya wameongezwa:

source: Students rejected:
sw_ke: Wanafunzi waliokataliwa:

source: Debug:
sw_ke: Tafuta na ondoa kasoro:

source: External Authentication failed
sw_ke: Uthibitisho wa nje haukufaulu

source: Password Reset
sw_ke: Badili Nywila

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
sw_ke: Tafadhali ingiza anwani ya barua pepe hapo chini, na tutakutumia barua pepe ya maelezo ya kuweka nywila mpya.

source: Required Information
sw_ke: Taarifa Inayohitajika

source: Your E-mail Address
sw_ke: Anwani Yako ya Barua pepe

source: This is the e-mail address you used to register with {platform}
sw_ke: Hii ndiyo anwani ya barua pepe uliyokuwa ukitumia kujiandikisha kwenye {platform}

source: Reset My Password
sw_ke: Badili Nywila Yangu

source: Email is incorrect.
sw_ke: Anwani ya barua pepe sio sahihi.

source: Support
sw_ke: Msaada

source: {platform_name} Support
sw_ke: Msaada wa {platform_name}

source: For {strong_start}questions on course lectures, homework, tools, or materials for this course{strong_end}, post in the {link_start}course discussion forum{link_end}.
sw_ke: Kwa {strong_start}maswali ya mihadhara ya kozi, kazi na mazoezi, zana, au vifaa vya kozi hii{strong_end}, chapisha kwenye {link_start}jukwaa la majadiliano ya kozi{link_end}.

source: Have {strong_start}general questions about {platform_name}{strong_end}? You can find lots of helpful information in the {platform_name} {link_start}FAQ{link_end}.
sw_ke: Pata {strong_start}maswali ya kawaida kuhusu {platform_name}{strong_end}? Waweza kupata taarifa nyingi zenye kusaidia katika {platform_name} {link_start}FAQ{link_end}.

source: Have a {strong_start}question about something specific{strong_end}? You can contact the {platform_name} general support team directly:
sw_ke: Kuwa na {strong_start}maswali kuhusu kitu maalum{strong_end}? Unaweza kuwasiliana na {platform_name} moja kwa moja na timu ya msaada:

source: Report a problem
sw_ke: Toa habari za tatizo

source: Make a suggestion
sw_ke: Toa maoni

source: Ask a question
sw_ke: Uliza swali

source: Please note: The {platform_name} support team is English speaking. While we will do our best to address your inquiry in any language, our responses will be in English.
sw_ke: Tafadhali tambua: Kikosi cha msaada cha {platform_name} kinatumia Kiingereza kwa mawasiliano. Ingawa tutafanya juhudi kutafuta majibu ya maswali yako kwa kutumia lugha yoyote, majibu yetu kwako yatakua kwa Kiingereza.

source: Briefly describe your issue
sw_ke: Elezea hoja yako kwa ufupi

source: Tell us the details
sw_ke: Tueleze kwa kirefu

source: Describe what you were doing when you encountered the issue. Include any details that will help us to troubleshoot, including error messages that you saw.
sw_ke: Dadavua ulichokua ukifanya ulipopatwa na tatizo. Jumuisha kila maelezo yatakayotusaidia kutatua,jumuisha ujumbe wa kosa uliouona

source: Thank You!
sw_ke: Ahsante!

source: Thank you for your inquiry or feedback. We typically respond to a request within one business day, Monday to Friday. In the meantime, please review our {link_start}detailed FAQs{link_end} where most questions have already been answered.
sw_ke: Asante kwa ulizo lako au mrejesho. Sisi kwa kawaida tunajibu maombi ndani ya siku moja ya kazi, Jumatatu hadi Ijumaa. Kwa muda huu tafadhali pitia{link_start} maswali na majibu {link_end} ambapo maswali mengi yamejibiwa kwa kina

source: - Select -
sw_ke: -Chagua-

source: problem
sw_ke: tatizo

source: Report a Problem
sw_ke: Toa Taarifa za Tatizo

source: Brief description of the problem
sw_ke: Mukhtasari wa ufafanuzi wa tatizo

source: Details of the problem you are encountering{asterisk}
sw_ke: Maelezo ya tatizo unalokutananalo{asterisk}

source: suggestion
sw_ke: maoni

source: Make a Suggestion
sw_ke: Toa Maoni

source: Brief description of your suggestion
sw_ke: Mukhtasari wa maelezo ya maoni yako

source: question
sw_ke: swali

source: Ask a Question
sw_ke: Uliza Swali

source: Brief summary of your question
sw_ke: Mukhtasari mfupi wa swali lako

source: An error has occurred.
sw_ke: Hitilafu imetokea.

source: Please {link_start}send us e-mail{link_end}.
sw_ke: Tafadhali {link_start}tutumie barua pepe{link_end}.

source: Please try again later.
sw_ke: Tafadhali jaribu tena baadae.

source: The course has ended.
sw_ke: Kozi imeisha

source: The due date for this assignment has passed.
sw_ke: Tarehe ya mwisho kwa kazi hii imepita

source: Because the course has ended, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
sw_ke: Kwasababu kozi imeisha, kazi hii haipatikani tena.{line_break}. Kama umekamilisha kazi hii daraja lako la ufaulu linapatikana {link_start} kurasa endelevu {link_end}

source: Because the due date has passed, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
sw_ke: Kwasababu kozi imeisha, kazi hii haipatikani tena.{line_break}. Kama umekamilisha kazi hii daraja lako la ufaulu linapatikana {link_start} kurasa endelevu {link_end}

source: Note: only instructors may annotate.
sw_ke: Kumbuka: walimu tu ndiyo wanaweza kufafanua.

source: Welcome to the Open edX{registered_trademark} platform!
sw_ke: Karibu kwenye jukwaa huru la edX {registered_trademark}!

source: It works! This is the default homepage for this Open edX instance.
sw_ke: Iko sawa! Huu ndio ukurasa halisi wa mwanzo wa tovuti 'hii' ya Open edX.

source: Search for a course
sw_ke: Tafuta "kozi"

source: Invalid email change key
sw_ke: "Barua pepe" siyo sahihi badili nywila

source: This e-mail key is not valid. Please check:
sw_ke: Nywila ya hii barua pepe siyo sahihi. Tafadhali hakikisha:

source: Was this key already used? Check whether the e-mail change has already happened.
sw_ke: Nywila hii tayari imetumika? Angalia kama mabadiliko ya barua pepe yametokea.

source: Did your e-mail client break the URL into two lines?
sw_ke: Je programu yako ya kupokea barua pepe imegawa URL kwenye njia mbili?

source: The keys are valid for a limited amount of time. Has the key expired?
sw_ke: Nywila zinatumika kwa muda maalum. Je nywila zimemaliza muda wa matumizi yake?

source: Showing all matching content eligible to be added into {display_name}. Each student will be assigned {max_count} component drawn randomly from this list.
sw_ke: Kuonyesha uwiyano wa liliyomo linalo stahili kuongezwa kwa {display_name}. Kila mwanafunzi atagawiwa {max_count} kipengele kilicho chotwa kwa kubahatisha kutoka kwenye orodha.

source: Helpful Information
sw_ke: Taarifa zenye Manufaa

source: Login via OpenID
sw_ke: Ingia mtandaoni kupitia OpenID

source: You can now start learning with {platform_name} by logging in with your <a rel="external" href="http://openid.net/">OpenID account</a>.
sw_ke: Sasa unaweza kujifunza na {platform_name} kwa kuingia mtandaoni na <a rel="external" href="http://openid.net/">akaunti yako ya OpenID</a>.

source: Not Enrolled?
sw_ke: Hujasajiliwa?

source: Sign up for {platform_name} today!
sw_ke: Jiandikishe kwa {platform_name} leo!

source: Need Help?
sw_ke: Unahitaji Msaada?

source: Looking for help signing in or with your {platform_name} account?
sw_ke: Unatafuta msaada kuingia au kwa {platform_name} akaunti yako?

source: View our help section for answers to commonly asked questions.
sw_ke: 'Angalia' kipengele chetu cha msaada kwa majibu ya maswali yanayo uliziwa mara kwa mara.

source: Log into your {platform_name} Account
sw_ke: 'Ingia' kwenye Akaunti yako ya {platform_name}

source: Log into My {platform_name} Account
sw_ke: Ingia mtandaoni kwenye Akaunti Yangu ya {platform_name}

source: Access My Courses
sw_ke: Fikia Kozi Zangu

source: Processing your account information
sw_ke: Inatayarisha taarifa za 'akaunti' yako

source: Please log in
sw_ke: Tafadhali ingia mtandaoni

source: to access your account and courses
sw_ke: kupata 'akaunti' na kozi zako

source: We're Sorry, {platform_name} accounts are unavailable currently
sw_ke: Tunasikitika, {platform_name} akaunti hazipatikani kwa sasa

source: We couldn't log you in.
sw_ke: Hatukuweza kukukubali kuingia mtandaoni.

source: Your email or password is incorrect
sw_ke: Anwani ya 'barua pepe' au nywila yako si sahihi

source: An error occurred when signing you in to {platform_name}.
sw_ke: Hitilafu ilitokea wakati wakuingia kwenye {platform_name}.

source: Please provide the following information to log into your {platform_name} account. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
sw_ke: Tafadhali toa taarifa zifuatazo uweze kuingia mtandaoni kwa akaunti yako ya {platform_name} . Sehemu zinazohitajika zimenukuliwa na <strong class="indicator">maandishi manene na maandishi ya mlazo(*)</strong>.

source: Account Preferences
sw_ke: Pendekezo za Akaunti

source: Sign in with {provider_name}
sw_ke: Ingia mtandaoni na {provider_name}

source: External resource
sw_ke: Nyenzo za nje

source: {points} / {total_points} points
sw_ke: alama {points} / {total_points}

source: {total_points} points possible
sw_ke: alama ziwezekanazo {total_points}

source: View resource in a new window
sw_ke: 'Angalia' nyenzo kupitia dirisha jipya

source: Please provide launch_url. Click "Edit", and fill in the required fields.
sw_ke: Tafadhali toa uzindizi_url. Bonyeza "Hariri", na ujaze kwenye sehemu zinazohitajika.

source: Feedback on your work from the grader:
sw_ke: Majibu ya kazi yako kutoka kwa mtoaji daraja:

source: Press to Launch
sw_ke: Bonyeza Uanzishe

source: Manage student accounts
sw_ke: Tawala 'akaunti' za wanafunzi

source: Username:
sw_ke: Jina la mtumiaji:

source: Profile:
sw_ke: Wasifu:

source: Image:
sw_ke: Picha:

source: Name:
sw_ke: Jina:

source: Choose an action:
sw_ke: Chagua kitendo:

source: View Profile
sw_ke: Angalia Wasifu

source: Disable Account
sw_ke: Lemaza Akaunti

source: Reenable Account
sw_ke: Wezesha upya Akaunti

source: Remove Profile Image
sw_ke: Ondoa Picha ya 'Wasifu'

source: Students whose accounts have been disabled
sw_ke: Wanafunzi ambao akaunti zao zimenyimwa uwezo

source: (reload your page to refresh)
sw_ke: (fungua upya ukurasa wako kuonesha tena)

source: working
sw_ke: inafanya kazi

source: There has been an error on the {platform_name} servers
sw_ke: Kumekuwa na hitilafu kwenye seva za {platform_name}

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
sw_ke: Tunasikitika, moduli hii haipatikani kwa sasa. Mwalimu wetu anashughulika kurekebisha haraka iwezekanavyo. Tafadhali tutumie barua pepe kupitia {tech_support_email} kutuarifu tatizo lolote au wakati mtandao ukiwa chini.

source: Raw data:
sw_ke: Takwimu ghafi:

source: You do not have any notes.
sw_ke: Huna nukuu zozote.

source: Course View
sw_ke: Mwonekano wa Kozi

source: View this course as:
sw_ke: Tizama kozi hii kama:

source: Learner
sw_ke: Mwanafunzi

source: Specific learner
sw_ke: Mwanafunzi mahsusi

source: Learner in {content_group}
sw_ke: Mwanafunzi kwenye {content_group}

source: Username or email:
sw_ke: Jina la mtumiaji au barua pepe:

source: Set preview mode
sw_ke: Weka mtindo wa 'kutazama' ukurasa

source: You are now viewing the course as {i_start}{user_name}{i_end}.
sw_ke: Sasa Unaangalia kozi kama{i_start}{user_name}{i_end}.

source: You have used {num_used} of {num_total} attempt
sw_ke: Umetumia {num_used} ya {num_total} majaribio

source: Some problems have options such as save, reset, hints, or show answer. These options follow the Submit button.
sw_ke: Baadhi ya matatizo yana machaguzi kama hifashi, tegesha upya, dondoo au onesha jibu. Machaguzi haya hufuata kibonye cha Wasilisha.

source: Hint
sw_ke: Dokezo

source: Save
sw_ke: 'Hifadhi'

source: Save your answer
sw_ke: Hifadhi majibu yako

source: Reset your answer
sw_ke: Futa/Ondoa majibu yako

source: Next Hint
sw_ke: Dondoo zifuatazo

source: Review
sw_ke: 'Pitia upya'

source: Log In
sw_ke: Ingia Mtandaoni

source: Your username, email, and full name will be sent to {destination}, where the collection and use of this information will be governed by their terms of service and privacy policy.
sw_ke: Jina lako, barua pepe, na jina kamili zitatumwa kwa {destination}, ambapo ukusanyaji na utumizi wa habari hizi zitaongozwa na masharti ya kazi na kanuni za siri.

source: Return To %s
sw_ke: Rudi Kwenye %s
