Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: sw_ke

source: Time Sent:
sw_ke: Wakati Iliotumwa:

source: Sent To:
sw_ke: Imetumwa Kwa:

source: Message:
sw_ke: Ujumbe:

source: No tasks currently running.
sw_ke: Hakuna majukumu yanayoendelea kwa sasa.

source: File Name
sw_ke: Jina la Faili

source: Links are generated on demand and expire within 5 minutes due to the sensitive nature of student information.
sw_ke: Viunganihi vinazalishwa kwa mahitaji na vinamalizika ndani ya dakika 5 kwa sababu ya unyeti wa asili kwa taarifa ya/kwa mwanafunzi.

source: Insert Hyperlink
sw_ke: Kuingiza Hyperlink

source: e.g. 'http://google.com/'
sw_ke: Kwa mfano. 'http://google.com/'

source: Link Description
sw_ke: Maelezo ya Kiunganishi

source: e.g. 'google'
sw_ke: kwa mfano. 'google'

source: Please provide a description of the link destination.
sw_ke: Tafadhali towa maelezo ya kituo cha kiunganishi.

source: Insert Image (upload file or type URL)
sw_ke: Ingiza Picha (upload file or type URL)

source: Type in a URL or use the "Choose File" button to upload a file from your machine. (e.g. 'http://example.com/img/clouds.jpg')
sw_ke: Andika URL au tumia kifungo cha "Chagua faili" upakie faili kutoka kwa mtambo/kompyuta yako. (e.g 'http://example.com/img/clouds.jpg')

source: Image Description
sw_ke: Maelezo ya Picha/Taswira

source: Please describe this image or agree that it has no contextual value by checking the checkbox.
sw_ke: Tafadhali elezea picha hii au kubali haini thamani ya kimazingira tukitizama sanduku la utafiti.

source: e.g. 'Sky with clouds'. The description is helpful for users who cannot see the image.
sw_ke: e.g 'Mbingu na mawingu'. Mealezo yana usaidizi mkubwa kwa watumiaji wasioweza kuona taswira/picha.

source: How to create useful text alternatives.
sw_ke: Namna ya kubuni jumbe mbadala za maana kutumia.

source: This image is for decorative purposes only and does not require a description.
sw_ke: Picha hii ni ya mapambo tu wala hai hitaji maelezo.

source: Markdown Editing Help
sw_ke: Markdown Msaada wa Ukaguzi

source: Please provide a valid URL.
sw_ke: Tafadhali towa URL halali.

source: %(errorCount)s error found in form.
sw_ke: %(errorCount)s hitlafu imepatika kwenye fomu.

source: Bold (Ctrl+B)
sw_ke: Ujasiri (Ctrl+B)

source: Italic (Ctrl+I)
sw_ke: Italiki (Ctrl+I)

source: Blockquote (Ctrl+Q)
sw_ke: Blochqoute (Ctrl+Q)

source: Code Sample (Ctrl+K)
sw_ke: Sampuli ya Kificho (Ctrl+K)

source: Image (Ctrl+G)
sw_ke: Taswira/Picha (Ctrl+G)

source: Numbered List (Ctrl+O)
sw_ke: Orodha ilio na Nambari (Ctrl+O)

source: Bulleted List (Ctrl+U)
sw_ke: Orodha ilio na Vitone (Ctrl+U)

source: Heading (Ctrl+H)
sw_ke: Kichwa tangulizi (Ctrl+H)

source: Horizontal Rule (Ctrl+R)
sw_ke: Mstari tambarare/usawa (Ctrl+R)

source: Undo (Ctrl+Z)
sw_ke: Tendua (Ctrl+Z)

source: Redo (Ctrl+Y)
sw_ke: Rudia (Ctrl+Y)

source: Redo (Ctrl+Shift+Z)
sw_ke: Rudia (Ctrl+Shift+Z)

source: strong text
sw_ke: Nakala kali

source: emphasized text
sw_ke: nakala iliosisitizwa

source: enter link description here
sw_ke: ingiza maelezo ya kiunganishi hapa

source: enter code here
sw_ke: ingiza kificho hapa

source: List item
sw_ke: Orodhesha bidhaa

source: Heading
sw_ke: Kichwa

source: You have been logged out of your edX account.
sw_ke: Umetolewa katika akaunti yako ya mtandao wa edX.

source: Preview this query
sw_ke: Tizama kabla suala hili

source: An error has occurred. Please try again.
sw_ke: "Hitlafu imetokea. Tafadhali jaribu tena.

source: Click to add
sw_ke: Bonyeza uongeze

source: Click to remove
sw_ke: Bonyeza ufute

source: All subsections
sw_ke: Vifungu vidogo vyote

source: All units
sw_ke: Vitengo vyote

source: Click to change
sw_ke: Bofya kubadilisha

source: Select a chapter
sw_ke: Chagua sura

source: Save changes
sw_ke: Dhibiti mabadiliko

source: Please enter valid start date and time.
sw_ke: Tafadhali ingiza tarehe na wakati halali.

source: Due date cannot be before start date.
sw_ke: Tarehe inayo tarajiwa kumaliza haiwezi kuwa kabla ya tarehe ya kuanza.

source: Enter Due Date and Time
sw_ke: Ingiza Tarehe na Wakati wa Kumalizia.

source: Enter Start Date and Time
sw_ke: Ingiza Tarehe na Wakati wa Kuanza.

source: Student username/email field is required and can not be empty.
sw_ke: Viwanja vya jinatumishi/barua pepe ya mwanafunzi vinahitajika na haviwezi kuachwa vitupu.

source: Uploaded file issues. Click on "+" to view.
sw_ke: Pakia mambo ya faili. Bonyeza "+" kutizama.

source: learners are successfully added to exception list
sw_ke: Wanagenzi wamefaulu kuongezwa kwa orodha baguzi

source: learner is successfully added to the exception list
sw_ke: Mwanagenzi amefaulu kuongezwa katika orodha baguzi

source: records are not in correct format and not added to
sw_ke: nakala haziko katika mfumo sawa na hazijaongezewa kwa

source: record is not in correct format and not added to the exception
sw_ke: nakala haiko katika mfumo sawa na haikuongezewa kwa baguzi

source: learners do not exist in LMS and not added to the
sw_ke: wanagenzi hawapo kwenye LMS na hawakuongezewa katika

source: learner does not exist in LMS and not added to the exception list
sw_ke: mwanagenzi hayupo kwa LMS na hakuongezewa katika orodha baguzi

source: learners are already white listed and not added to
sw_ke: wanagenzi tayari wapo kwenye orodha nyeupe na hakuongezewa kwa

source: learner is already white listed and not added to the exception
sw_ke: mwanagenzi tayari yupo kwenye orodha nyeupe na hakuongezewa kwa baguzi

source: learners are not enrolled in course and not added to
sw_ke: wanagenzi hawajasajiliwa katika fanni na hawajaongezewa kwenye

source: learner is not enrolled in course and not added to the exception
sw_ke: mwanagenzi hajasajiliwa katika fanni na hajaongezewa kwenye baguzi

source: Certificate of <%= user %> has already been invalidated. Please check your spelling and retry.
sw_ke: Cheti cha <%= user %> tayari kimebatilishwa. Tafadhali tizama herufi zako na ujaribu tena.

source: Certificate has been successfully invalidated for <%= user %>.
sw_ke: Cheti kimefaulu kubatilishwa kwa <%= user %>.

source: Server Error, Please refresh the page and try again.
sw_ke: Hitlafu ya Sava, Tafadhali burudisha ukurasa na ujaribu tena.

source: The certificate for this learner has been re-validated and the system is re-running the grade for this learner.
sw_ke: Cheti cha mwanagenzi huyu kime halalishwa tena na ratiba inajipanga tena kutowa daraja ya mwanagenzi huyu.

source: Could not find Certificate Invalidation in the list. Please refresh the page and try again
sw_ke: Haikuweza kupata Batili ya Cheti katika orodha. Tafadhali rudia upya ukurasa na jaribu tena.

source: Student Removed from certificate white list successfully.
sw_ke: Mwanafunzi alifanikiwa Kuondolewa katika cheti cha orodha nyeupe.

source: Could not find Certificate Exception in white list. Please refresh the page and try again
sw_ke: Haikuweza kupata Cheti Baguzi katika orodha nyeupe. Tafadhali rudia upya ukurasa na ujaribu tena.

source: <%= user %> already in exception list.
sw_ke: <%= user %> tayari iko katika orodha baguzi.

source: <%= user %> has been successfully added to the exception list. Click Generate Exception Certificate below to send the certificate.
sw_ke: <%= user %> amefaulu kuongezewa katika orodha baguzi. Bonyeza Zalisha Cheti Baguzi chini kutuma cheti.

source: There has been an error processing your survey.
sw_ke: Kumekuwa na hitlafu kutayarisha utafiti wako.

source: Less
sw_ke: Pungufu

source: Please enter a valid donation amount.
sw_ke: Tafadhali ingiza kimma halali cha mchango.

source: Your donation could not be submitted.
sw_ke: Mchango wako haukuweza kufikishwa.

source: An error occurred. Please try again later.
sw_ke: Hitlafu imetokea. Tafadhali jaribu tena baadae.

source: Viewing %s course
sw_ke: Kutizama kozi %s

source: We couldn't find any results for "%s".
sw_ke: Hatungeweza kupata majibu yoyote kwa "%s".

source: There was an error, try searching again.
sw_ke: Kulikuwa na hitlafu, jaribu kutafuta tena.

source: Focus grabber
sw_ke: Unyakuzi wa lengo

source: An error has occurred. Make sure that you are connected to the Internet, and then try refreshing the page.
sw_ke: Hitlafu imetokea. Hakikisha kuwa umeunganishwa kwa mtandao, na kisha jaribu kurudia upya ukurasa.

source: Hide notes
sw_ke: Ficha nukuu

source: Notes visible
sw_ke: Nukuu zinazoonekana

source: Show notes
sw_ke: Onyesha nukuu

source: Notes hidden
sw_ke: Nukuu zilizofichwa

source: Please enter a term in the %(anchor_start)s search field%(anchor_end)s.
sw_ke: Tafadhali ingiza neno katika %(anchor_start)s kiwanja cha utafiti%(anchor_end)s.

source: Current tab
sw_ke: Tab ya hivi sasa

source: Location in Course
sw_ke: Eneo katika Fanni

source: Recent Activity
sw_ke: Tukio la hivi Punde

source: No results found for "%(query_string)s". Please try searching again.
sw_ke: Hakuna majibu yaliyo patikana kwa "%(query_sstring)s". Tafadhali jaribu kutafuta tena.

source: Choose one
sw_ke: Chagua moja

source: An error has occurred. Check your Internet connection and try again.
sw_ke: Hitlafu imetokea. Tizama kiunganishi cha mtandao wako na ujaribu tena.

source: We've encountered an error. Refresh your browser and then try again.
sw_ke: Tumekumbana na hitlafu.Rudia upya uvinjari wako na kisha jaribu tena.

source: Selected tab
sw_ke: Tab iliyochaguliwa

source: Saved cohort
sw_ke: Ufangamano uliyodhibitiwa

source: Error adding students.
sw_ke: Hitlafu kuongezea wanafunzi.

source: Enter a username or email.
sw_ke: Ingiza jinatumishi au barua pepe.

source: {numUsersAdded} student has been added to this cohort
sw_ke: {numUsersAdded} mwanafunzi ameongezwa katika ufungamano huu

source: {numMoved} student was removed from {oldCohort}
sw_ke: {numMoved} mwanafunzi aliondolewa kutoka kwa {oldCohort}

source: {numPresent} student was already in the cohort
sw_ke: {numPresent} mwanafunzi tayari alikuwa kwenye ufungamano

source: Unknown user: {user}
sw_ke: Mtumiaji asiyejulikana: {user}

source: There was an error when trying to add students:
sw_ke: Kulikwa na hitlafu nikijaribu kuongeza mwanafunzi:

source: View all errors
sw_ke: Tizama hitlafu zote

source: You must specify a name for the cohort
sw_ke: Lazima bainishe jina la cohort

source: You did not select a content group
sw_ke: Hukuchagua kundi la yaliyomo

source: The selected content group does not exist
sw_ke: Kundi la yaliyomo lililo chaguliwa halipo

source: The cohort cannot be saved
sw_ke: Ufungamano hauwezi kudhibitiwa

source: The cohort cannot be added
sw_ke: Ufungamano hauwezi kuongezewa

source: You currently have no cohorts configured
sw_ke: Kwa sasa hivi huna mpangilio wa ufungamano

source: Add Cohort
sw_ke: Ongeza Kundi lenye ufungamano

source: The {cohortGroupName} cohort has been created. You can manually add students to this cohort below.
sw_ke: {cohortGroupName} ufungamano umebuniwa. Unaweza kuongeza wanafunzi kwa mkono kwa ufungamano huu hapo chini.

source: Assign students to cohorts by uploading a CSV file.
sw_ke: Wapatie wanafunzi ufungamano kwa kupakia faili ya CSV.

source: Choose a .csv file
sw_ke: Chagua faili ya .csv

source: Only properly formatted .csv files will be accepted.
sw_ke: Faili zilizo na mfumo sawa sawa za .csv ndio zitakubalika.

source: Upload File and Assign Students
sw_ke: Pakia Faili na Kabidhi Jukumu kwa Wanafunzi

source: Your file '{file}' has been uploaded. Allow a few minutes for processing.
sw_ke: Faili yako '{file}' imepakiwa. Ruhusu dakika chache za matayarisho.

source: Cohorts Enabled
sw_ke: Ufungamano Umewezeshwa

source: Cohorts Disabled
sw_ke: Ufungamano Umelemazwa

source: Allow students to generate certificates for this course?
sw_ke: Ruhusu wanafunzi kuzalisha vyeti vya fanni hii?

source: Prevent students from generating certificates in this course?
sw_ke: Epusha wanafunzi kutokana na kuzalisha vyeti katika fanni hii?

source: Start generating certificates for all students in this course?
sw_ke: Anza kuzalisha vyeti kwa wanafunzi wote wa fanni hii?

source: Error while generating certificates. Please try again.
sw_ke: Hitlafu tukizalisha vyeti. Tafadhali jaribu tena.

source: Start regenerating certificates for students in this course?
sw_ke: Anza kuzalisha upya vyeti kwa wanafunzi wote katika fanni hii?

source: Error while regenerating certificates. Please try again.
sw_ke: Hitlafu tukizalisha upya vyeti. Tafadhali jaribu tena.

source: There was a problem creating the report. Select "Create Executive Summary" to try again.
sw_ke: Kulikuwa na tatizo kubuni taarifa. Chagua "Create Executive Summary" kujaribu tena.

source: Enter the enrollment code.
sw_ke: Ingiza kificho cha usajili.

source: Cancel enrollment code
sw_ke: Futa kificho cha usajili

source: Restore enrollment code
sw_ke: Regesha kificho cha usajili

source: Mark enrollment code as unused
sw_ke: Weka alama ya kificho cha usajili kama haijatumika

source: %s result
sw_ke: %s matokeo

source: Unknown Error Occurred.
sw_ke: Hitlafu Isiyojulikana Imetokea.

source: Successfully reset the attempts for user {user}
sw_ke: Kwa ufanisi rudia mikakati ya majaribio kwa mtumiaji {user}

source: Failed to reset attempts.
sw_ke: Haikufaulu kurudisha mikakati ya majaribio.

source: Successfully deleted student state for user {user}
sw_ke: Kwa ufanisi imefuta hali ya mwanafunzi kwa mtumiaji {user}

source: Failed to delete student state.
sw_ke: Haikufaulu kufuta hali ya mwanafunzi.

source: Successfully rescored problem for user {user}
sw_ke: Imefaulu kurudisha alama ya tatizo la mtumiaji {user}

source: Failed to rescore problem.
sw_ke: Haikufaulu kurudisha alama ya tatizo.

source: The data could not be saved.
sw_ke: Taarifa haikuweza kudhibitiwa.

source: Please enter a valid email address
sw_ke: Tafadhali ingiza anwani halali ya barua pepe / inayotumika

source: Please enter a valid password
sw_ke: Tafadhali ingiza nenofunguo halisi / halali / inayotumika

source: Password reset email sent. Follow the link in the email to change your password.
sw_ke: Barua pepe ya mikakati mipya ya nenofunguo imetumwa. Fuata kiunganishi katika barua pepe kubadilisha nenofunguo lako.

source: We weren't able to send you a password reset email.
sw_ke: Hatukuweza kukutumia barua pepe ya mikakati mipya ya nywila yako.

source: Please check your email to confirm the change
sw_ke: Tafadhali angalia barua pepe yako uhakikishe mabadiliko

source: Saving your email preference
sw_ke: Dhibiti upendeleo wa barua pepe yako

source: Enrolling you in the selected course
sw_ke: Kukusajili katika fanni uliyochagua

source: Adding the selected course to your cart
sw_ke: Kuongezea chaguo lako la mtihani wa jaribio katika fanni

source: Loading your courses
sw_ke: Upakiaji wa fanni zako

source: An error has occurred. Try refreshing the page, or check your Internet connection.
sw_ke: Hitlafu imetokea. Jaribu kurudia tena upya ukurasa, au tizama uunganishi wa Mtandao wako.

source: Basic Account Information (required)
sw_ke: Taarifa Msingi za Akaunti (required)

source: The name that identifies you throughout {platform_name}. You cannot change your username.
sw_ke: Jina linalo kutambuwa mfululizo {platform_name}. Huwezi kubalisha jinatumishi lako.

source: Full Name
sw_ke: Jina Kamili

source: The name that is used for ID verification and appears on your certificates. Other learners never see your full name. Make sure to enter your name exactly as it appears on your government-issued photo ID, including any non-Roman characters.
sw_ke: Jina linalo tumika kwa usawazishi wa Kitambulisho na litokeze kwa vyeti vyako. Wanagenzi wengine hawaoni kabisa jina lako kamili. Hakikisha kuingiza jina lako kikamilifu kama linavyo tokea kwenye picha/taswira yako iliotolewa na serikali, zikiwemo herufi zozote ambazo sio za Kirumi.

source: Email Address
sw_ke: Anwani Barua pepe

source: The email address you use to sign in. Communications from {platform_name} and your courses are sent to this address.
sw_ke: Anwani barua pepe unayo ingia nayo mtandaoni. Mawasiliano kutoka {platform_name} na fanni zako zimetumwa kwa anwani hii.

source: Password
sw_ke: Nywila

source: Reset your Password
sw_ke: Rudia upya mikakati ya Nywila yako

source: Reset Password
sw_ke: Rudia tena mikakati ya Nywila

source: When you click "Reset Password", a message will be sent to your email address. Click the link in the message to reset your password.
sw_ke: Unapo bonyeza "Reset Password", ujumbe utatumwa kwa anwani yako ya barua pepe. Bonyeza kiunganishi kwenye ujumbe urudie nywila yako.

source: The language used throughout this site. This site is currently available in a limited number of languages.
sw_ke: Lugha iliyotumika katika tovuti hii yote. Tovuti hii inapatikana kiasi hivi sasa kwa lugha nyingine tofauti tofauti.

source: Country or Region
sw_ke: Nchi / Taifa au Jimbo

source: Additional Information (optional)
sw_ke: Taarifa za Ziada (optional)

source: Education Completed
sw_ke: Elimu Imekamilishwa

source: Gender
sw_ke: Jinsia

source: Year of Birth
sw_ke: Mwaka wa Kuzaliwa

source: Preferred Language
sw_ke: Lugha Iliyopendekezwa

source: Connected Accounts
sw_ke: Akaunti za Kushikamana

source: Connect your {accountName} account
sw_ke: Unganisha akaunti yako {accountName}

source: We've sent a confirmation message to {new_email_address}. Click the link in the message to update your email address.
sw_ke: Tumetuma ujumbe wa kuthibitisha kwa {new_email-address}. Bonyeza kiunganishi katika ujumbe kukamilisha anwani yako ya barua pepe.

source: You must sign out and sign back in before your language changes take effect.
sw_ke: Lazima utoke mtandaoni na uingie tena kabla mabadiliko yako yawe na athari.

source: We've sent a message to {email_address}. Click the link in the message to reset your password.
sw_ke: Tumetuma ujumbe kwa {email_address}. Bonyeza kiunganishi katika ujumbe kurudia upya mikakati ya nywila yako.

source: Unlink
sw_ke: Tenganisha

source: Link
sw_ke: Unganisha

source: Unlinking
sw_ke: Utenganishaji

source: Linking
sw_ke: Uunganishaji

source: Successfully unlinked.
sw_ke: Utenganishaji Umefaulu.

source: Accomplishments Pagination
sw_ke: Mafanikio ya kutoa nambari kwa Kurasa

source: {platform_name} learners can see my:
sw_ke: {platform_name} wanagenzi waweza kuona:

source: Limited Profile
sw_ke: Wasifu Mdogo

source: Full Profile
sw_ke: Wasifu Kamili

source: Add Country
sw_ke: Ungezea Nchi / Taifa

source: Add language
sw_ke: Ongeza Lugha

source: About me
sw_ke: Kuhusu mimi

source: Tell other learners a little about yourself: where you live, what your interests are, why you're taking courses, or what you hope to learn.
sw_ke: Waeleze kidogo wengine kuhusu wewe binafsi: unapo ishi, unapendelea yapi, kwanini unajifunzi fanni zako, au unatarajia kujifunza nini.

source: Account Settings page.
sw_ke: Ukurasa wa Mikakati ya Akaunti.

source: You must specify your birth year before you can share your full profile. To specify your birth year, go to the {account_settings_page_link}
sw_ke: Lazima ubainishe mwaka wako wa kuzaliwa kabla kushirikisha wasifu wako kamili. Kubainisha mwaka wako wakuzaliwa, nenda kwa {account_settings_page_link}

source: You must be over 13 to share a full profile. If you are over 13, make sure that you have specified a birth year on the {account_settings_page_link}
sw_ke: Lazima uwe na umri zaidi ya miaka 13 kushirikisha wasifu kamili. Kama umepita 13,hakikisha kuwa umebainisha mwaka wa kuzaliwa kwenye {account_settings_page_link}

source: Profile Image
sw_ke: Wasifu wa Taswira / Picha

source: Profile image for {username}
sw_ke: Wasifu wa taswira / picha ya {username}

source: About Me
sw_ke: Kuhusu Mimi

source: Accomplishments
sw_ke: Matekelezo

source: Profile
sw_ke: Wasifu

source: Image Upload Error
sw_ke: Hitlafu ya Upakiaji wa Taswira / Picha

source: Please verify that you have uploaded a valid image (PNG and JPEG).
sw_ke: Tafadhali sawazisha kuwa umepakia taswira halisi (PNG and JPEG).

source: An error has occurred. Please try again later.
sw_ke: Hitlafu imetokea. Tafadhali jaribu tena baadae.

source: Could not submit photos
sw_ke: Haikuweza kufikisha picha

source: Professional Education Verified Certificate
sw_ke: Cheti kilicho Sawazishwa cha Elimu ya Kitaaluma

source: Professional Education
sw_ke: Elimu ya taaluma maalum

source: Verified Certificate upgrade
sw_ke: Uboreshaji wa Cheti kilicho Sawazishwa

source: Verified Certificate
sw_ke: Cheti kilicho hakikishwa

source: Checkout
sw_ke: Angalia / Kutoka nje

source: Checkout with PayPal
sw_ke: Angalia na PayPal

source: Checkout with {processor}
sw_ke: Angalia na {processor}

source: All payment options are currently unavailable.
sw_ke: Chaguo zote za malipo hazipatikani kwa sasa.

source: Try the transaction again in a few minutes.
sw_ke: Jaribu tena transaction baada ya dakika chache.

source: Could not submit order
sw_ke: Haikuweza kufikisha agizo.

source: Could not retrieve payment information
sw_ke: Haikuweza kutoa taarifa ya malipo

source: Take a photo of your ID
sw_ke: Piga picha ya Kitambulisho chako

source: Review your info
sw_ke: Isome tena taarifa yako

source: An error has occurred. Please try reloading the page.
sw_ke: Hitlafu imetokea. Tafadhali jaribu kupakia upya ukurasa.

source: Video Capture Error
sw_ke: Uchukuaji wa Video Unahitlafu

source: Please verify that your webcam is connected and that you have allowed your browser to access it.
sw_ke: Tafadhali sawazisha kuwa webcam yako imeunganishwa na kwamba umeruhusu uvinjari kuipata.

source: No Webcam Detected
sw_ke: Hamna Webcam Iliyogunduliwa

source: You don't seem to have a webcam connected.
sw_ke: Huonekani kuwa na webcam iliounganishwa.

source: Double-check that your webcam is connected and working to continue.
sw_ke: Tizama mara mbili kwamba webcam yako imeunganishwa na kazi iendelee.

source: Photo Captured successfully.
sw_ke: Picha imechukuliwa kwa ufanisi.

source: No Flash Detected
sw_ke: Muanga wa Picha Haukuonekana

source: You don't seem to have Flash installed. Get Flash to continue your verification.
sw_ke: Yaonesha hukuweka muanga wa picha. Weka muanga uendelee na usawazishaji.

source: Editable
sw_ke: Kagulika

source: Validation Error
sw_ke: Hitlafu ya Uhalalishaji

source: In Progress
sw_ke: Ina Endelea

source: Placeholder
sw_ke: Mshikiliaji wa pahali

source: Your upload of '{file}' succeeded.
sw_ke: Upakiaji wako wa '{file}' ulifaulu.

source: Your upload of '{file}' failed.
sw_ke: Upakiaji wako wa '{file}' haukufaulu.

source: Upload an image
sw_ke: Pakia taswira

source: Change image
sw_ke: Geuza taswira

source: Removing
sw_ke: Kuondoa

source: An error has occurred. Refresh the page, and then try again.
sw_ke: Hitlafu imetokea. Rudia upya ukurasa, na kisha jaribu tena.

source: The file must be at least {size} in size.
sw_ke: Faili lazima iwe japo {size} kwa kipimo.

source: The file must be smaller than {size} in size.
sw_ke: Lazima faili iwe ndogo kuliko {size} kwa kipimo.

source: Upload is in progress. To avoid errors, stay on this page until the process is complete.
sw_ke: Upakiaji unaendelea. Kuepuka hitlafu, bakia kwenye ukurasa huu mpaka matayarisho yakamilike.

source: Removal is in progress. To avoid errors, stay on this page until the process is complete.
sw_ke: Uondoaji unaendelea. Kuepuka hitlafu, bakia katika ukurasa huu mpaka matayarisho yakamilike.

source: bytes
sw_ke: baiti

source: Unable to retrieve data, please try again later.
sw_ke: Imeshindwa kutoa taarifa, tafadhali jaribu tena.

source: %(num_students)s student opened Subsection
sw_ke: %(num_students)s mwanafunzi aliefungua Kifungu kidogo

source: %(num_students)s student
sw_ke: %(num_students)s mwanafunzi

source: %(num_questions)s question
sw_ke: %(num_questions)s suali

source: Number of Students
sw_ke: Idadi ya Wanafunzi
