Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: {platform_name} and the {platform_name} Participants reserve the right at any time in their sole discretion to cancel, delay, reschedule or alter the format of any API or API Content offered through {platform_name}, or to cease providing any part or all of the APIs or API Content or related services, and you agree that neither {platform_name} nor any of the {platform_name} Participants will have any liability to you for such an action.
sw_ke: {platform_name} na {platform_name} Wahusika wana haki kwa wakati wowote katika hiari yao kufutilia, chelewesha, ratibisha upya au geuza mfumo wa API yoyote au yaliyomo ya API yaliotolewa kupitia {platform_name}, au kuacha kutoa sehemu yoyote au APIs zote au yaliyomo ya API au huduma ihusianayo, na ukubali kuwa sio {platform_name} au kati ya {platform_name} Wahusika watakuwa na dhamana kwako kwa kitendo kama hicho.

source: Upon any termination of the Terms or discontinuation of your access to an API for any reason, your right to use any API and API Content will immediately cease. You will immediately stop using the APIs and delete any cached or stored API Content. All provisions of the Terms that by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, and limitation of liability. Termination of your access to and use of the APIs and API Content shall not relieve you of any obligations arising or accrusing prior to such termination or limit any liability that you otherwise may have to {platform_name}, including without limitation any indemnification obligations contained herein.
sw_ke: Baada ya usitishwaji wa Vipengele vya mkataba au usitishwaji wa wa kuipta API kwa sababu yoyote ile, haki yako ya kutumia API na Maudhui ya API itasimama mara moja. Utasimamishwa kutumia APIs na kufutiwa Maudhui ya API yaliyohifadhiwa. Vipengele vyote vya Makubaliano ambavyo kwa asili yake haviwezi kusimamishwa vitaendelea kupatikana, ikiwemo, utumiaji bila mipaka, vipengele vya umiliki, mipaka ya madeni. Usitishwaji wako katika kutumia APIs na Maudhui ya API hautakupunguzia majuku yoyote yanayojitokeza kabla ya usitishwaji au wakuzuia madeni ambayo kwa vyovyote ulikuwa nayo kwenye, {platform_name}, ikiwemo utekelezaji wa majukumu bila mipaka kwa yale yaliyomo humu.

source: Edit {catalog_name}
sw_ke: Hariri {catalog_name}

source: Download CSV
sw_ke: Pakua CSV

source: Delete this catalog
sw_ke: Futa hii katalogi

source: Update Catalog
sw_ke: Sasisha Katalogi

source: Catalogs for {username}
sw_ke: Katalogi kwa ajili ya {username}

source: Create new catalog:
sw_ke: Tengeneza katalogi mpya:

source: Create Catalog
sw_ke: Tengeneza Katalogi

source: Catalog search
sw_ke: Tafuta Katalogi

source: Catalog Search
sw_ke: Tafuta Katalogi

source: Enter a username to view catalogs belonging to that user.
sw_ke: Ingiza jina la mtumiaji kutazama katalogi zinazomilikiwa na mtumiaji.

source: Open Calculator
sw_ke: Fungua Kikokotoo

source: Enter equation
sw_ke: Ingiza mlinganyo

source: Calculator Input Field
sw_ke: Sehemu ya Kujaza Kikokotoo

source: Hints
sw_ke: Dondoo

source: Use the arrow keys to navigate the tips or use the tab key to return to the calculator
sw_ke: Tumia mishale funguo kuabiri dokezi au tumia funguo za tab kurudi kwa kikokotoo

source: For detailed information, see {math_link_start}Entering Mathematical and Scientific Expressions{math_link_end} in the {guide_link_start}edX Guide for Students{guide_link_end}.
sw_ke: Kwa habari za utondoti, tizama {math_link_start}Uingizaji wa Maelezo ya Kihesabu na Sayansi{math_link_end} katika {guide_link_started} Muongozo wa edX kwa wanafunzi{guide_link_end}.

source: Tips
sw_ke: Dondoo

source: Use parentheses () to make expressions clear. You can use parentheses inside other parentheses.
sw_ke: Tumia mabano () kuweka wazi maelezo. Unaweza kutumia mabano ndani mabano mengine.

source: Do not use spaces in expressions.
sw_ke: Usiache nafasi katika maelezo.

source: For constants, indicate multiplication explicitly (example: 5*c).
sw_ke: Kwa usawa, onyesha umaradufu kikweli (example: 5*c).

source: For affixes, type the number and affix without a space (example: 5c).
sw_ke: Kwa vigandishi/ viambishi, andika idadi ya namba na kiambishi bila kuacha nafasi ('kwa mfano': 5c).

source: For functions, type the name of the function, then the expression in parentheses.
sw_ke: Kwa shughuli, andika 'jina' la shughuli, kisha maelezo kwenye mabano.

source: To Use
sw_ke: 'Kutumia'

source: Type
sw_ke: Aina

source: Examples
sw_ke: Mifano

source: Numbers
sw_ke: Namba

source: Integers
sw_ke: Nambari kamili

source: Fractions
sw_ke: Sehemu

source: Decimals
sw_ke: Desimali

source: Operators
sw_ke: Waendeshaji

source: + - * / (add, subtract, multiply, divide)
sw_ke: + - * / (jumlisha, toa, zidisha, gawanya)

source: ^ (raise to a power)
sw_ke: ^ (pata mamlaka)

source: || (parallel resistors)
sw_ke: || (mistari kingamo)

source: Constants
sw_ke: Tabia zisizobadilika

source: Affixes
sw_ke: Vibandiko / Vigandisho

source: Percent sign (%) and metric affixes (d, c, m, u, n, p, k, M, G, T)
sw_ke: Alama ya asilimia (%) na vigandisho vya kimetriki (d, c, m, u, n, p, k, M, G, T)

source: Basic functions
sw_ke: Shughuli za Msingi

source: Trigonometric functions
sw_ke: Shughuli za Trigonometria

source: Scientific notation
sw_ke: Nukuu za kisayansi

source: 10^ and the exponent
sw_ke: 10^ na mfasiri

source: e notation
sw_ke: nukuu ya e

source: 1e and the exponent
sw_ke: 1e na mfasiri

source: Calculate
sw_ke: Kokotoa

source: Result
sw_ke: Matokeo

source: CCX Coach Dashboard
sw_ke: Dashibodi ya Mkufunzi wa 'CCX'

source: Name your CCX
sw_ke: Ipe jina CCX yako

source: Create a new Custom Course for edX
sw_ke: 'Tengeneza' Kozi mpya ya Mteja wa edX

source: Grading Policy
sw_ke: 'Sera ya Utoaji wa Madaraja'

source: Batch Enrollment
sw_ke: 'Uandikishaji wa kundi'

source: Student Grades
sw_ke: 'Madaraja ya Mwanafunzi'

source: Please enter a valid CCX name.
sw_ke: Tafadhali ingiza jina lhalali la CCX.

source: Email Addresses/Usernames
sw_ke: 'Anwani' za barua pepe/ Jina la mtumiaji

source: Enter email addresses and/or usernames separated by new lines or commas.
sw_ke: Ingiza anwani ya barua pepe na/au majina ya watumiaji yalitenganishwa kwa mistari mipya au koma.

source: You will not get notification for emails that bounce, so please double-check spelling.
sw_ke: Hutapata ilani kwa barua pepe zinazorudi, kwa hivyo tafadhali tizama tena herufi.

source: Auto Enroll
sw_ke: Usajili Wakiwenyewe

source: If this option is {em_start}checked{em_end}, users who have not yet registered for {platform_name} will be automatically enrolled.
sw_ke: Kama chaguo hili {em_start}lime angaliwa{em_end}, watumiaji ambao bado hawajajiorodhesha kwa{platform_name} watasajiliwa kiwenyewe.

source: If this option is left {em_start}unchecked{em_end}, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
sw_ke: Kama chaguo hili litaachwa {em_start} bila kuangaliwa{em_end}, watumiaji ambao bado hawajajiandikisha kwa {platform_name} hawatasajiliwa, lakini wataruhusiwa kujisajili pindi watapata akaunti.

source: Checking this box has no effect if 'Unenroll' is selected.
sw_ke: Uangaliaji wa sanduku hili hakuna athari ikiwa 'Tengua usajili' itachaguliwa.

source: Notify users by email
sw_ke: Mjulishe mtumiaji kwa barua pepe

source: If this option is {em_start}checked{em_end}, users will receive an email notification.
sw_ke: Kama chaguo hili {em_start}limeangaliwa{em_end}, watumiaji watapokea barua pepe za kuwajulisha.

source: Student List Management
sw_ke: Kumudu Orodha ya Wanafunzi

source: CCX student list management response message
sw_ke: Ujumbe wa majibu ya orodha ya kumudu wanafunzi wa CCX

source: Revoke access
sw_ke: Batilisha ruhusa

source: Enter username or email
sw_ke: Ingiza jina la mtumiaji au barua pepe

source: Checking this box has no effect if 'Revoke' is clicked.
sw_ke: Kutizama kisanduku hiki hakuna athari kama 'Kataa' imebofywa.

source: WARNING
sw_ke: ONYO

source: For advanced users only. Errors in the grading policy can lead to the course failing to display. This form does not check the validity of the policy before saving.
sw_ke: Kwa watumiaji wenye ujuzi wa juu pekee. Hitilafu katika kanuni za daraja zinaweza kusababisha kozi kutokuonekana. Fomu hii haiangalii uhalali wa kanuni kabla ya kuhifadhi.

source: Most coaches should not need to make changes to the grading policy.
sw_ke: Makocha wengi hawastahili kafanya mabadiliko kwenye kanuni za daraja.

source: Save Grading Policy
sw_ke: Hifadhi Kanuni za Utoaji Daraja

source: Date format four digit year dash two digit month dash two digit day
sw_ke: Mfumo wa tarehe tarakimu nne za mwaka pengo tarakimu mbili za mwezi pengo tarakimu mbili za siku

source: Time format two digit hours colon two digit minutes
sw_ke: Mfumo wa wakati tarakimu mbili masaa nukta pacha tarakimu mbili dakika

source: Time
sw_ke: Muda

source: Set date
sw_ke: Weka tarehe

source: You have unsaved changes.
sw_ke: Una mabadiliko ambayo hayajahifadhiwa.

source: There was an error saving changes.
sw_ke: Kulikuwa na hitilafu katika kuhifadhi mabadiliko.

source: Schedule a Unit
sw_ke: Panga Sura

source: Start Date
sw_ke: Tarehe ya Kuanza

source: format four digit year dash two digit month dash two digit day
sw_ke: Weka mfumo wa tarakimu nne za mwaka pengo tarakimu mbili za mwezi pengo tarakimu mbili za siku

source: yyyy-mm-dd
sw_ke: mwaka-mwezi-siku

source: Start time format two digit hours colon two digit minutes
sw_ke: Anzisha mfumo wa tarakimu mbili saa nukta pacha tarakimu mbili dakika

source: time
sw_ke: muda

source: (Optional)
sw_ke: (Hiari)

source: Due Time format two digit hours colon two digit minutes
sw_ke: Mfumo wa Wakati tarakimu mbili saa nukta pacha tarakimu mbili dakika

source: Add Unit
sw_ke: Ongeza Kitengo

source: Add All Units
sw_ke: Ongeza Vitengo Vyote

source: All units have been added.
sw_ke: Sura zote vimewekwa

source: View gradebook
sw_ke: Tizama kitabu cha daraja

source: Download student grades
sw_ke: 'Pakua mtandaoni' madaraja ya mwanafunzi

source: Print or share your certificate:
sw_ke: Chapisha au tuma cheti chako:

source: Click the link to see my certificate.
sw_ke: Bofya kiungo-wavuti uone cheti changu.

source: Post on Facebook
sw_ke: Bandika kwenye Facebook

source: Share on Twitter
sw_ke: Bandika chapisho kwenye Twitter

source: Tweet this Accomplishment. Pop up window.
sw_ke: Toa taarifa ya Kukamilisha kazi kwenye Tweeter. Onesha dirisha jipya.

source: Add to LinkedIn Profile
sw_ke: Ongeza kwenye Wasifu wa Linkedln

source: Add to Mozilla Backpack
sw_ke: Ongezea kwenye Mozilla Backpack

source: Print Certificate
sw_ke: Chapisha Cheti

source: {platform_name} Home
sw_ke: {platform_name} Ukurasa wa Nyumbani

source: Noted by
sw_ke: Imenukuliwa na

source: Supported by the following organizations
sw_ke: Imewezeshwa na mashirika yafuatayo

source: Cannot Find Certificate
sw_ke: Cheti Hakipatikani

source: We cannot find a certificate with this URL or ID number. If you are trying to validate a certificate, make sure that the URL or ID number is correct. If you are sure that the URL or ID number is correct, contact support.
sw_ke: Hatuwezi kupata cheti kwa URL hii au namba ya Kitambulisho. Kama unajaribu kuhalalisha cheti, hakikisha kuwa URL au Kitambulisho ni sahihi. Kama una hakika ya kwamba URL au Kitambulisho ni sahihi,wasiliana na kitengo cha msaada.

source: Invalid Certificate Configuration.
sw_ke: Usabidi batili wa Cheti.

source: There is a problem with this certificate.
sw_ke: Cheti hiki kina matatizo.

source: To resolve the problem, your partner manager should verify that the following information is correct.
sw_ke: Kutatua tatizo, msimamizi mwenza athibitishe taarifa ifuatayo kama ni sahihi.

source: The institution&#39;s logo.
sw_ke: Nembo ya Taasisi &#39;s

source: The institution that is linked to the course.
sw_ke: Taasisi ambayo imeunganishwa na kozi.

source: The course information in the Course Administration tool.
sw_ke: Taarifa za kozi katika kifaa cha Utawala wa Kozi.

source: If all of the information is correct and the problem persists, contact technical support.
sw_ke: Kama taarifa yote iko sawa na tatizo linaendelea, wasiliana na kitengo cha msaada wa kiufundi.

source: Checkout Cancelled
sw_ke: Utokaji Batilisha

source: Your transaction has been cancelled. If you feel an error has occurred, contact {email}.
sw_ke: Muamala wako umebatilishwa. Ukihisi kuna hitilafu iliyotokea, wasiliana na {email}.

source: Checkout Error
sw_ke: Hitilafu ya Utokaji

source: An error has occurred with your payment. <b>You have not been charged.</b> Please try to submit your payment again. If this problem persists, contact {email}.
sw_ke: Hitilafu imetokea kwenye malipo yako. <b>hujalipishwa/hujatozwa.</b> Tafadhali jaribu kufikisha malipo yako tena. Tatizo hili likiendelea, wasiliana na {email}.

source: Loading Order Data...
sw_ke: Upakiaji wa maelezo ya uagizishaji

source: Please wait while we retrieve your order details.
sw_ke: Tafadhali subiri tukiwa tunarudisha uagizaji wako.

source: Enroll In {course_name} | Choose Your Track
sw_ke: Sajili kwenye {course_name} | Chagua Mtindo Wako

source: Sorry, there was an error when trying to enroll you
sw_ke: Samahani, kulikuwa na hitilafu wakati wa kukusajili

source: Pursue Academic Credit with a Verified Certificate
sw_ke: Fuatilia Mkopo wa Kusoma na Cheti Kilicho Thibitishwa

source: Become eligible for academic credit and highlight your new skills and knowledge with a verified certificate. Use this valuable credential to qualify for academic credit, advance your career, or strengthen your school applications.
sw_ke: Stahiki kupata mkopo wa masomo na uangazie ujuzi wako mpya na elimu kwa cheti kilicho thibitishwa. Tumia sifa hii ya thamani ufaulu kwa mkopo wa masomo, boresha kazi yako, au jadidisha maombi yako ya shule.

source: Benefits of a Verified Certificate
sw_ke: Faida za Cheti Kilichothibitishwa

source: {b_start}Eligible for credit:{b_end} Receive academic credit after successfully completing the course
sw_ke: {b_start}Mstahiki wa mkopo:{b_end} Pokea mkopo wa kusoma baada ya kufaulu kukamilisha kozi

source: {b_start}Official:{b_end} Receive an instructor-signed certificate with the institution's logo
sw_ke: {b_start}Rasmi:{b_end} Pokea cheti kilichosainiwa na mkufunzi kilicho na nembo ya taasisi

source: {b_start}Easily shareable:{b_end} Add the certificate to your CV or resume, or post it directly on LinkedIn
sw_ke: {b_start}Ni rahisi kuituma kwa wengine:{b_end} Weka cheti katika CV yako au anza tena, au chapisha makala moja kwa moja kwenye Linkedln

source: Pursue a Verified Certificate
sw_ke: Tafuta Cheti Kilichothibitishwa

source: Highlight your new knowledge and skills with a verified certificate. Use this valuable credential to improve your job prospects and advance your career, or highlight your certificate in school applications.
sw_ke: Angazia elimu yako mpya na ujuzi kwa cheti kilicho thibitishwa. Tumia sifa hii ya thamani kuboresha matarajio yako ya kazi na uboreshe kazi yako, au angazia cheti chako kwenye maombi ya shule.

source: {b_start}Official: {b_end}Receive an instructor-signed certificate with the institution's logo
sw_ke: {b_start}Rasmi: {b_end}Pokea cheti kilicho sainiwa na mwalimu chenye nembo ya taasisi

source: {b_start}Easily shareable: {b_end}Add the certificate to your CV or resume, or post it directly on LinkedIn
sw_ke: {b_start}Ni rahisi kuituma kwa wengine: {b_end} Weka cheti kwenye CV yako au anza tena, au chapisha makala moja kwa moja katika Linkedln

source: {b_start}Motivating: {b_end}Give yourself an additional incentive to complete the course
sw_ke: {b_start}Hamasisha: {b_end}Jipe nyongeza ya kichocheo kukamilisha kozi

source: Audit This Course
sw_ke: Kagua Kozi Hii

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums.
sw_ke: Kagua kozi hii bure na upate ufikiaji kamili kwa nyenzo zote za kozi, mazoezi, majaribio na majukwaa.

source: Audit This Course (No Certificate)
sw_ke: Kagua Kozi Hii (Hakuna Cheti)

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums. {b_start}Please note that this track does not offer a certificate for learners who earn a passing grade.{b_end}
sw_ke: Kagua kozi hii bila malipo na uweze kufikia kikamilifu nyenzo zote za kozi, mazoezi,mitihani ya majaribio, na majukwaa. {b_start}Tafadhali tambua kuwa mfumo huu hautoi cheti kwa wanafunzi ambao wamepata daraja za kufaulu.{b_end}

source: {chapter} current chapter
sw_ke: {chapter} sura ya sasa

source: {span_start}current section{span_end}
sw_ke: {span_start}kifungu cha sasa{span_end}

source: due {date}
sw_ke: Tarehe husika {date}

source: {section_format} due {{date}}
sw_ke: {section_format} inatazamiwa {{date}}

source: This content is graded
sw_ke: Maudhui haya yamepangwa kwenye madaraja

source: An error occurred. Please try again later.
sw_ke: Hitilafu imetokea. Tafadhali jaribu tena baadae.

source: The currently logged-in user account does not have permission to enroll in this course. You may need to {start_logout_tag}log out{end_tag} then try the enroll button again. Please visit the {start_help_tag}help page{end_tag} for a possible solution.
sw_ke: Akaunti ya mtumiaji alie ingia mtandaoni sasa hivi haina ruhusa kujisajili kwenye kozi hii. Ungependa {start_logout_tag} kutoka mtandaoni{end_tag} Kisha jaribu kifungo cha kusajili tena. Tafadhali tembelea {start_help_tag} ukurasa wa usaidizi{end_tag} kwa suluhisho liwezekanalo.

source: You are enrolled in this course
sw_ke: Umesajiliwa katika kozi hii

source: View Course
sw_ke: Angalia Kozi

source: This course is in your <a href="{cart_link}">cart</a>.
sw_ke: Kozi hii iko kwenye <a href="{cart_link}">hazina</a> yako.

source: Course is full
sw_ke: Kozi imejaa wanafunzi

source: Enrollment in this course is by invitation only
sw_ke: Usajili katika kozi hii ni kwa ukaribisho pekee

source: Enrollment is Closed
sw_ke: Usajili Umefungwa

source: Add {course_name} to Cart <span>({price} USD)</span>
sw_ke: Ongeza {course_name} kwenye Kapu <span>({price} USD)</span>

source: Enroll in {course_name}
sw_ke: Sajili kwenye {course_name}

source: View About Page in studio
sw_ke: Tizama Ukurasa wa Mwanzo katika studio

source: Classes Start
sw_ke: Masomo Yanaanza

source: Classes End
sw_ke: Masomo Yanamalizika

source: Estimated Effort
sw_ke: Makisio ya Juhudi

source: Prerequisites
sw_ke: Masharti

source: You must successfully complete {link_start}{prc_display}{link_end} before you begin this course.
sw_ke: Lazima ufaulu kukamilisha {link_start}{prc_display}{link_end} kabla ya kuanza kozi hii.

source: Additional Resources
sw_ke: Nyenzo za Ziada

source: enroll
sw_ke: Sajili

source: Share with friends and family!
sw_ke: Tuma kwa marafiki na jamii

source: I just enrolled in {number} {title} through {account}: {url}
sw_ke: Nimejisajili katika {number} {title} kupitia {account}: {url}

source: Take a course with {platform} online
sw_ke: Chukua kozi mtandaoni kwa {platform}

source: I just enrolled in {number} {title} through {platform} {url}
sw_ke: Nimejisajili katika {number} {title} kupitia {platform} {url}

source: Tweet that you've enrolled in this course
sw_ke: Chapisha ujumbe kwenye Twitter kuwa umesajili katika kozi hii

source: Post a Facebook message to say you've enrolled in this course
sw_ke: Chapisha ujumbe kwenye Facebook kusema umejisajili katika kozi hii

source: Email someone to say you've enrolled in this course
sw_ke: Mtumie mtu barua pepe kusema umejisajili katika kozi hii

source: Course Material
sw_ke: Vifaa vya Kozi

source: Hide
sw_ke: Ficha

source: Show
sw_ke: Onesha

source: Show Earlier Course Updates
sw_ke: Onesha Masasisho ya Mbeleni ya Kozi

source: List of Courses
sw_ke: Orodha ya Kozi

source: Refine Your Search
sw_ke: Rekebisha Utafutaji Wako

source: {course_number} Courseware
sw_ke: {course_number} Maudhui ya kozi

source: Course Utilities
sw_ke: Utumizi wa Kozi

source: Courseware
sw_ke: Maudhui ya kozi

source: Course Search
sw_ke: Utafutaji Kozi

source: No content has been added to this course
sw_ke: Hamna maudhui yaliyoongezwa katika kozi hii

source: To access course materials, you must score {required_score}% or higher on this exam. Your current score is {current_score}%.
sw_ke: Ili kuzifikia nyenzo za kozi, lazima upate alama {required_score} % au zaidi kwenye mtihani huu. Alama ulizopata ni {current_score}%.

source: Your score is {current_score}%. You have passed the entrance exam.
sw_ke: Alama ulizopata ni %{current-score}. Umefaulu mtihani wa kujiunga.

source: Gradebook
sw_ke: Kitabu cha madaraja

source: Search students
sw_ke: Tafuta wanafunzi

source: previous page
sw_ke: Ukurasa uliopita

source: of
sw_ke: ya / kwa / cha

source: next page
sw_ke: Ukurasa unaofuata

source: {course_number} Course Info
sw_ke: Habari za Kozi ya {course_number}

source: You are not enrolled yet
sw_ke: Bado hujasajiliwa

source: Welcome to {org}'s {course_name}!
sw_ke: Karibu kwenye {org}'s {course_name}!

source: Resume Course
sw_ke: Anza tena Kozi

source: View Updates in Studio
sw_ke: Tizama Masasisho katika Studio

source: Course Updates and News
sw_ke: Taarifa mpya za kozi

source: Handout Navigation
sw_ke: Uabiri wa Vitini

source: Course Tools
sw_ke: Mpangilio wa Kozi

source: News - MITx 6.002x
sw_ke: Habari - MITx 6.002x

source: Updates to Discussion Posts You Follow
sw_ke: Masasisho ya Machapisho ya Majadiliano Unayofuatilia

source: Play
sw_ke: Chezesha

source: {course_number} Progress
sw_ke: Maendeleo{course_number}

source: View Grading in studio
sw_ke: Tizama Utoaji Daraja katika studio

source: Course Progress for Student '{username}' ({email})
sw_ke: Maendeleo ya Kozi kwa Mwanafunzi '{username}' ({email})

source: View Certificate
sw_ke: Angalia Cheti

source: Opens in a new browser window
sw_ke: Inafunguka kwenye dirisha jipya la kivinjari

source: Download Your Certificate
sw_ke: Pakua Cheti Chako

source: Request Certificate
sw_ke: Omba Cheti

source: Requirements for Course Credit
sw_ke: Mahitaji ya Mkopo wa Kozi

source: {student_name}, you are no longer eligible for credit in this course.
sw_ke: {student_name}, hustahili kupata mkopo katika kozi hii.

source: {student_name}, you have met the requirements for credit in this course. {a_start}Go to your dashboard{a_end} to purchase course credit.
sw_ke: {student_name}, umefikia vigezo vya kupata alama kwenye kozi hii. {a_start}Nenda kwenye dashbodi yako{a_end} upate alama za kozi.

source: {student_name}, you have not yet met the requirements for credit.
sw_ke: {student_name}, bado hujatimiza mahitaji kupata mkopo.

source: Information about course credit requirements
sw_ke: Taarifa kuhusu mahitaji ya mkopo wa kozi

source: display_name
sw_ke: onesha_jina

source: Verification Submitted
sw_ke: Uhakiki Umewasilishwa

source: Verification Failed
sw_ke: Uhakiki Haukufaulu

source: Verification Declined
sw_ke: Uhakiki Umekataliwa

source: Completed by {date}
sw_ke: Ikamilike ifikapo {date}

source: Upcoming
sw_ke: Inayokuja

source: Less
sw_ke: Pungufu

source: Details for each chapter
sw_ke: Maelezo ya kila sura

source: {earned} of {total} possible points
sw_ke: {earned} kwa {total} alama zinazotarajiwa

source: Problem Scores:
sw_ke: Matokeo ya Swali:

source: Practice Scores:
sw_ke: Matokeo ya mazoezi:

source: Problem scores are hidden until the due date.
sw_ke: Matokeo ya swali yamefichwa mpaka tarehe husika.

source: Practice scores are hidden until the due date.
sw_ke: Matokeo ya zoezi yamefichwa mpaka tarehe husika.

source: Problem scores are hidden.
sw_ke: Matokeo ya swali yamefichwa.
