Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Enter the name of the course as it should appear in the edX.org course list.
sw_ke: Ingiza jina la kozi kama linavyojitokeza kwenye orodha ya kozi ya edX.org

source: Course Display Name
sw_ke: Jina la Kozi Linavyoonekana

source: Course Editor
sw_ke: Mhariri wa Kozi

source: Enter the method by which this course is edited ("XML" or "Studio").
sw_ke: Ingiza njia ambayo itahariri kozi ("XML" or "Studio").

source: Course Survey URL
sw_ke: Utafiti wa Kozi ya URL

source: Enter the URL for the end-of-course survey. If your course does not have a survey, enter null.
sw_ke: Ingiza URL mwisho wa utafiti wa kozi. Kama kozi yako haina utafiti, ingiza batili.

source: Discussion Blackout Dates
sw_ke: Tarehe za Kuzuiwa Majadiliano

source: Discussion Topic Mapping
sw_ke: Upangaji Mada ya Majadiliano

source: Discussion Sorting Alphabetical
sw_ke: Majadiliano ya Kupanga Herufi za Alfabeti

source: Enter true or false. If true, discussion categories and subcategories are sorted alphabetically. If false, they are sorted chronologically by creation date and time.
sw_ke: Ingiza kweli au uwongo. Kama kweli, tabaka za mazungumzo na tabaka ndgo zina chaguliwa ki alfabeti. Kama uwongo, zina chaguliwa kimchanganyiko kwa kubuni tarehe na wakati.

source: Course Announcement Date
sw_ke: Tarehe ya Kutangaza Kozi

source: Enter the date to announce your course.
sw_ke: Ingiza tarehe ya Kutangaza kozi yako.

source: Cohort Configuration
sw_ke: Mpangilio wa 'Makundi'

source: Enter policy keys and values to enable the cohort feature, define automated student assignment to groups, or identify any course-wide discussion topics as private to cohort members.
sw_ke: Ingiza kanuni muhimu na tathmini kuwezesha sehemu za ufungamano, bainisha makundi ya kuwajibika mwanafunzi la kiwenyewe, au tambua mazungumzo mapana ya kozi kama ya siri kwa wanachama wa ufungamano.

source: Course Is New
sw_ke: Kozi ni Mpya

source: Enter true or false. If true, the course appears in the list of new courses on edx.org, and a New! badge temporarily appears next to the course image.
sw_ke: Ingiza ni kweli au uwongo. Kama ni kweli, kozi inatokea katika orodha ya kozi mpya katika edx.org, na Mpya! beji kwa muda inatokea baada ya taswira ya kozi.

source: Mobile Course Available
sw_ke: Kozi Zinazoendeshwa kwa Njia ya Simu Zinapatikana

source: Enter true or false. If true, the course will be available to mobile devices.
sw_ke: Ingiza kweli au si kweli. Kama kweli kozi itatokea kwenye simu yako.

source: Video Upload Credentials
sw_ke: Sifa za upakiaji wa video.

source: Enter the unique identifier for your course's video files provided by edX.
sw_ke: Ingiza utambuzi wakipekee wa faili za video ya kozi yako iliyo tolewa na edX.

source: Course Not Graded
sw_ke: Kozi Hazijapewa Daraja.

source: Enter true or false. If true, the course will not be graded.
sw_ke: Ingiza kweli au si kweli. Kama kweli, kozi haitapangwa katika daraja.

source: Disable Progress Graph
sw_ke: Lemaza Grafu ya Maendeleo

source: Enter true or false. If true, students cannot view the progress graph.
sw_ke: Ingiza kweli au si kweli. Kama kweli, wanafunzi hawawezi kutazama grafu ya maendeleo.

source: PDF Textbooks
sw_ke: Vitabu vya Kiada vya PDF

source: List of dictionaries containing pdf_textbook configuration
sw_ke: Orodha ya kamusi zilizo na mpangilio wa vitabu vya kiada_pdf

source: HTML Textbooks
sw_ke: Vitabu vya kiada vya HTML

source: Remote Gradebook
sw_ke: Kitabu cha Kiada cha Mbali

source: Enter the remote gradebook mapping. Only use this setting when REMOTE_GRADEBOOK_URL has been specified.
sw_ke: Ingiza ramani ya kitabu cha daraja cha mbali. Tumia mkakati huu pekee ikiwa REMOTE_GRADEBOOK_URL imetajwa.

source: Enable CCX
sw_ke: Wezesha CCX

source: Allow course instructors to assign CCX Coach roles, and allow coaches to manage Custom Courses on edX. When false, Custom Courses cannot be created, but existing Custom Courses will be preserved.
sw_ke: Ruhusu waalimu wa kozi kutoa CCX majukumu ya Kufundisha, na ruhusu makocha kumudu kozi za Desturi kwenye edX. Ikiwa uwongo, Desturi za Kozi haziwezi kubuniwa, lakini Desturi za Kozi ziliopo zitadhibitiwa.

source: CCX Connector URL
sw_ke: Muunganisho wa URL ya CCX

source: URL for CCX Connector application for managing creation of CCXs. (optional). Ignored unless 'Enable CCX' is set to 'true'.
sw_ke: Utumizi wa Uunganishi wa URL ya CCX kwa kumudu ubuni wa CCXs. (optional). Puuza labda 'Wezesha CCX' imeweka kwa 'kweli'.

source: Allow Anonymous Discussion Posts
sw_ke: Ruhusu Majadiliano ya Makala Zisizojulikana

source: Enter true or false. If true, students can create discussion posts that are anonymous to all users.
sw_ke: Ingiza kweli au si kweli. Kama kweli, wanafunzi wanaweza kutengeneza mazungumzo ya makala ambayo haijulikani kwa watumiaji.

source: Allow Anonymous Discussion Posts to Peers
sw_ke: Ruhusu Mazungumzo ya Wasiojulikana kwa Warika

source: Enter true or false. If true, students can create discussion posts that are anonymous to other students. This setting does not make posts anonymous to course staff.
sw_ke: Ingiza kweli au uwongo. Kama kweli, wanafunzi waweza kubuni makala ya mazungumzo ambayo hayajulikani kwa wanafunzi wengine. Mkakati huu haufanyi makala ya wasiojulikana kwa wafanyi kazi wa kozi.

source: Advanced Module List
sw_ke: Ongeza Orodha ya Moduli

source: Enter the names of the advanced modules to use in your course.
sw_ke: Ingiza majina ya moduli peva/za juu utakazotumia kwenye kozi yako.

source: Course Home Sidebar Name
sw_ke: JIna la Ukanda wa kando nyumbani ya Kozi

source: Enter the heading that you want students to see above your course handouts on the Course Home page. Your course handouts appear in the right panel of the page.
sw_ke: Ingiza kichwa ambacho unahitaji wanafunzi kuona juu ya machapisho ya kutoa kwa mkono ya kozi yako kwenye ukurasa wa nyumbani wa kozi. Machapisho ya kutowa kwa mkono ya kozi yako yanatokea katika paneli ya kulia kwenye ukurasa.

source: Course Handouts
sw_ke: Kitini cha Kozi

source: True if timezones should be shown on dates in the course. Deprecated in favor of due_date_display_format.
sw_ke: Kweli kama wakati wa zoni unastahili kuonyeshwa kwa tarehe katika kozi. Lalamikiwa kwa kusaidia due_date_display_format.

source: Due Date Display Format
sw_ke: Mfumo wa Kuonesha Tarehe ya Kumaliza

source: External Login Domain
sw_ke: Kiwanja cha Nje cha Kuingia mtandaoni

source: Enter the external login method students can use for the course.
sw_ke: Ingiza njia ya nje ya kuingia mtandaoni wanafunzi waweza kutumia kwa kozi hii.

source: Certificates Downloadable Before End
sw_ke: Vyeti vinavyoweza Kupakuliwa Kabla ya Kufikia Mwisho

source: Enter true or false. If true, students can download certificates before the course ends, if they've met certificate requirements.
sw_ke: Ingiza kweli au si kweli. Kama kweli, wanafunzi waweza kupakua vyeti kabla kozi kumalizika, kama wametimiza masharti ya cheti.

source: Certificates Display Behavior
sw_ke: Mtindo wa Kuonyesha Vyeti

source: Course About Page Image
sw_ke: Kozi Kuhusiana na Picha ya Ukurasa

source: Edit the name of the course image file. You must upload this file on the Files & Uploads page. You can also set the course image on the Settings & Details page.
sw_ke: Hariri jina la faili ya taswira ya kozi. Lazima upakie faili hii kwenye ukurasa wa faili & Mapakizi. Unaweza pia kuweka taswira ya kozi kwenye ukurasa wa Mikakati & Tondoti.

source: Course Banner Image
sw_ke: 'Picha' ya Bango la Kozi

source: Edit the name of the banner image file. You can set the banner image on the Settings & Details page.
sw_ke: Hariri jina la faili ya picha ya bango. Unaweza kuweka picha ya bango katika Mikakati & Ukurasa wa Tondoti.

source: Course Video Thumbnail Image
sw_ke: Taswira ya Kucha kidole Gumba kwenye Video ya Kozi

source: Edit the name of the video thumbnail image file. You can set the video thumbnail image on the Settings & Details page.
sw_ke: Hariri jina la faili ya taswira ya video ya Kucha ya Kidole cha Gumba. Unaweza kuweka video ya taswira ya kucha ya kidole gumba katika Mikakati & Ukurasa wa tondoti.

source: Issue Open Badges
sw_ke: Towa Beji za Wazi

source: Issue Open Badges badges for this course. Badges are generated when certificates are created.
sw_ke: Towa Beji za Beji Wazi kwa kozi hii. Beji zinazalishwa vyeti vikibuniwa.

source: Certificate Name (Short)
sw_ke: Jina la Cheti (Kwa kifupi)

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the long name of the type of certificate that students receive when they complete the course. For instance, "Certificate of Achievement".
sw_ke: Tumia mkakati huu ukizalisha vyeti vya PDF pekee. Baina ya alama za kuashiria mazungumzo yalio semwa na mtu mwengine, ingiza jina refu la aina ya cheti ambacho wanafunzi wanapokea wakimaliza kozi. Kwa mfano, "Certificate of Achievement".

source: Certificate Name (Long)
sw_ke: Jina la Cheti (Kwa Kirefu)

source: Certificate Web/HTML View Enabled
sw_ke: Mtazamo umewezeshwa kwa Cheti cha Web/HTML

source: If true, certificate Web/HTML views are enabled for the course.
sw_ke: Kama ni kweli, mitazamo ya cheti cha Web/HTML imewezeshwa kwa kozi.

source: Certificate Web/HTML View Overrides
sw_ke: Mitazamo ya kupita kwa Cheti cha Web/HTML

source: Enter course-specific overrides for the Web/HTML template parameters here (JSON format)
sw_ke: Ingiza majina mapito ya kozi kwa dori ya vigezo vya Web/HTML hapa(JSON format)

source: Certificate Configuration
sw_ke: Mpangilio wa Cheti

source: Enter course-specific configuration information here (JSON format)
sw_ke: Ingiza habari za mpangilio wa majina ya kozi (JSON mfumo) hapa

source: CSS Class for Course Reruns
sw_ke: Darasa la CSS kwa Uendeshaji upya wa Kozi

source: Allows courses to share the same css class across runs even if they have different numbers.
sw_ke: Inaruhusu kozi kushirikiana kwa darasa sawa la css kupitia maendeshaji yote ikiwa ziko na nambari tofauti.

source: Discussion Forum External Link
sw_ke: Uunganishi wa Kongamano la Mazungumzo ya Nje

source: Allows specification of an external link to replace discussion forums.
sw_ke: Inaruhusu maelezo ya kina ya uunganishi wa nje kubadiisha makongamano ya mazungumzo.

source: Hide Progress Tab
sw_ke: Ficha Maendeleo ya Tab

source: Allows hiding of the progress tab.
sw_ke: Inaruhusu ufichaji wa maendeleo ya tab.

source: Course Organization Display String
sw_ke: Matayarisho ya Mstari ya Kuonyesha Kozi

source: Enter the course organization that you want to appear in the course. This setting overrides the organization that you entered when you created the course. To use the organization that you entered when you created the course, enter null.
sw_ke: Ingiza mpangilio wa kozi unao taka utokee kwa kozi. Mkakati huu unapita mpango ambao uliingiza ukibuni kozi. Kutumia mpango huu ambao umeingiza ukibuni kozi, ingiza batili.

source: Course Number Display String
sw_ke: Mstari wa kuonyesha Nambari ya Kozi

source: Enter the course number that you want to appear in the course. This setting overrides the course number that you entered when you created the course. To use the course number that you entered when you created the course, enter null.
sw_ke: Ingiza nambari ya kozi ambayo unataka utokee kwenye kozi. Mkakati huu unapita nambari ya kozi ulioingza ukibuni kozi. Kutumia nambari ya kozi ambayo umeingiza ukibuni kozi, ingiza batii.

source: Course Maximum Student Enrollment
sw_ke: 'Kiwango' cha juu kabisa cha Uandikishaji wa Wanafunzi katika Kozi

source: Enter the maximum number of students that can enroll in the course. To allow an unlimited number of students, enter null.
sw_ke: Ingiza idadi ya kiwango cha juu cha 'wanafunzi' wanaoweza kujiandikisha katika kozi. Kuruhusu idadi kubwa ya wanafunzi, ingiza batili.

source: Allow Public Wiki Access
sw_ke: Ruhusu Ufikiaji wa Umma katika Wiki

source: Enter true or false. If true, edX users can view the course wiki even if they're not enrolled in the course.
sw_ke: Ingiza kweli au si kweli. Kama kweli, watumiaji wa edX wanaweza kuona wiki ya kozi hata kama hawajaandikishwa katika kozi.

source: Invitation Only
sw_ke: Mwaliko 'Pekee'

source: Whether to restrict enrollment to invitation by the course staff.
sw_ke: Kama ni kuwekea vikwazo usajili kwa ukaribishaji kwa wafanyi kazi wa kozi.

source: Pre-Course Survey Name
sw_ke: Jina la Utafiti wa Kozi Kabla

source: Name of SurveyForm to display as a pre-course survey to the user.
sw_ke: Jina la namna ya Utafiti kuoneshwa kama utafiti wa kozi kabla kwa mtumiaji.

source: Pre-Course Survey Required
sw_ke: 'Utafiti wa Awali wa Kozi' Unahitajika

source: Specify whether students must complete a survey before they can view your course content. If you set this value to true, you must add a name for the survey to the Course Survey Name setting above.
sw_ke: Taja kama wanafunzi lazima wamalize utafiti kabla waweze kutizama yaliyomo ya kozi yako. Kama umeweka hii kwa kweli, lazima uongeze jina kwa utafiti kwa mkakati wa Jina la Utafiti wa Kozi hapo juu.

source: Course Visibility In Catalog
sw_ke: Muonekano wa 'Kozi' 'katika' Katalogi

source: Defines the access permissions for showing the course in the course catalog. This can be set to one of three values: 'both' (show in catalog and allow access to about page), 'about' (only allow access to about page), 'none' (do not show in catalog and do not allow access to an about page).
sw_ke: Eleza ruhusa ya ufikiaji kwa kuonyesha kozi katika katalogi ya kozi. Hii inaweza kuwa moja kati ya tathmini tatu: 'zote' (show in catalog and allow access to about page), 'kuhusu' (only allow access to about a page), 'hamna' (do not show in catalog na do not allow access to an about a page).

source: Both
sw_ke: Zote

source: About
sw_ke: Kuhusu

source: None
sw_ke: Hakuna

source: Entrance Exam Enabled
sw_ke: Kiingilio Mtihani Kimewezeshwa

source: Specify whether students must complete an entrance exam before they can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
sw_ke: 'Bainisha' kama wanafunzi lazima wakamilishe alama za kuingilia kwenye mtihani kabla hawajaweza kutazama maudhui ya kozi. Kumbuka, lazima uwezeshe alama za Kuingilia kwenye Mitihani wa kozi hii kutumika.

source: Entrance Exam Minimum Score (%)
sw_ke: Alama ya Chini Kabisa ya Kuingilia kwenye Mtihani (%)

source: Specify a minimum percentage score for an entrance exam before students can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
sw_ke: Taja kiwango cha chini cha alama kwa asilimia kwa ajili ya kuingia kwenye mtihani kabla wanafunzi hawajatazama maudhui. Kumbuka, lazima uwezeshe alama za Kuingia kwenye Mtihani wa hii kozi kutumika

source: Entrance Exam ID
sw_ke: 'Kitambulisho cha Kuingilia kwenye Mtihani'

source: Content module identifier (location) of entrance exam.
sw_ke: Kipimo cha kitambulishi cha Yaliyomo (location) kwa kiingilio mtihani.

source: Social Media Sharing URL
sw_ke: Idhaa ya jamii Kushirikiana na URL

source: If dashboard social sharing and custom course URLs are enabled, you can provide a URL (such as the URL to a course About page) that social media sites can link to. URLs must be fully qualified. For example: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
sw_ke: Kama utumiaji wa dashibodi ya jamii na desturi za kozi URLs zimewezeshwa, unaweza kutoa URL (such as the URL to a course About page) ambayo tovuti ya idhaa ya jamii, unaweza kuunganisha. URLs lazima zihitimu kikamilifu. Kwa mfano: http://www.edx.org/course/Introduction-to- MOOCs-ITM001

source: Course Language
sw_ke: Lugha ya kufundishia Kozi

source: Specify the language of your course.
sw_ke: Bainisha lugha ya kozi yako.

source: Teams Configuration
sw_ke: Mpangilio wa 'Timu'

source: Enable Proctored Exams
sw_ke: Wezesha Mtihani wa Ulezi

source: Enter true or false. If this value is true, proctored exams are enabled in your course. Note that enabling proctored exams will also enable timed exams.
sw_ke: Ingiza kweli au uwongo. Kama tathmini ni kweli, mitihani wa ulezi inawezeshwa katika kozi yako. Tambua kuwa kuwezesha mitahini ya ulezi pia itawezesha mitihani ya wakati.

source: Allow Opting Out of Proctored Exams
sw_ke: Chagua kujiondoa kwenye Mitihani Inayosimamiwa

source: Enter true or false. If this value is true, learners can choose to take proctored exams without proctoring. If this value is false, all learners must take the exam with proctoring. This setting only applies if proctored exams are enabled for the course.
sw_ke: Ingiza kweli au uongo. Kama thamani hii ni kweli, wanafunzi wanaweza kuchagua kufanya mitihani inayosimamiwa bila kusimamiwa. Kama thamani hii ni uongo, wanafunzi wote lazima wafanye mitihani kwa kusimamiwa. Muundo huu unahusika tu kama mitihani inayosimamiwa inahusika kwenye kozi.

source: Create Zendesk Tickets For Suspicious Proctored Exam Attempts
sw_ke: Tengeneza Tiketi za Zendesk kuzuia majaribio yenye kutiliwa shaka kwenye mitihani inayosimamiwa

source: Enter true or false. If this value is true, a Zendesk ticket will be created for suspicious attempts.
sw_ke: Ingiza kweli au uongo. Kama thamani hii ni kweli, tiketi ya Zendesk itatengenezwa kwa ajili ya majaribio yenye kutiliwa shaka.

source: Enable Timed Exams
sw_ke: Wezesha Mitihani Unaosimamiwa

source: Enter true or false. If this value is true, timed exams are enabled in your course. Regardless of this setting, timed exams are enabled if Enable Proctored Exams is set to true.
sw_ke: Ingiza kweli au si kweli. Kama thamani hii ni kweli, mitihani ya muda maalum inapatika kwenye kozi yako. Bila kujali mpangilio huu, mitihani ya muda maalum inapatikana kama kipengele cha Wezesha Mitihani ya Kusimamiwa kimechaguliwa kuwa ni kweli.

source: Minimum Grade for Credit
sw_ke: Kiwango cha chini cha Daraja kwa Mkopo

source: The minimum grade that a learner must earn to receive credit in the course, as a decimal between 0.0 and 1.0. For example, for 75%, enter 0.75.
sw_ke: Kiwango cha daraja ya chini ambayo mwanafunzi lazima ajipatie kupokea mkopo katika kozi, kama sehemu ya kumi 0.0 na 1.0. Kwa mfano, kwa 75%, ingiza 0.75.

source: Self Paced
sw_ke: Nyanda za Kibinafsi

source: Set this to "true" to mark this course as self-paced. Self-paced courses do not have due dates for assignments, and students can progress through the course at any rate before the course ends.
sw_ke: Weka hii kwa "kweli" kuweka alama ya kozi hii kama nyanda ya binafsi. Kozi za nyanda ya binafsi hazina tarehe za kuwadia kwa ugawaji, na wanafunzi waweza kuendelea kupitia kozi kwa kiwango chochote kabla kozi kuisha.

source: Bypass Course Home
sw_ke: Pitia Kozi ya Nyumbani

source: Bypass the course home tab when students arrive from the dashboard, sending them directly to course content.
sw_ke: Pitia tab ya kozi nyumbani ikiwa wanafunzi wamewasili kutoka kwa dashibodi, ukiwatuma moja kwa moja kwa yaliyomo ya kozi.

source: Enable Subsection Prerequisites
sw_ke: Wezesha Masharti ya Kifungu kidogo

source: Enter true or false. If this value is true, you can hide a subsection until learners earn a minimum score in another, prerequisite subsection.
sw_ke: Ingiza kweli au uwongo. Kama tathmini ni kweli, unaweza kuficha kifungu kidogo mpaka wanafunzi wajipatie alama za chini katika masharti ya vifungu vidogo vyengine.

source: Course Learning Information
sw_ke: Taarifa za Mafunzo ya Kozi

source: Specify what student can learn from the course.
sw_ke: Taja mwanafunzi aweza kujifunza nini kutokana na kozi.

source: Course Instructor
sw_ke: Mkufunzi wa Kozi

source: Enter the details for Course Instructor
sw_ke: Ingiza maelezo ya Mkufunzi wa Kozi

source: Add Unsupported Problems and Tools
sw_ke: Ongeza Maswali yasiyo na Majibu na Zana

source: Enter true or false. If true, you can add unsupported problems and tools to your course in Studio. Unsupported problems and tools are not recommended for use in courses due to non-compliance with one or more of the base requirements, such as testing, accessibility, internationalization, and documentation.
sw_ke: Ingiza kweli au si kweli. Kama kweli, unaweza kuongeza maswali na zana kwenye kozi yako kwenye Studio. Maswali yasiyo na majibu pamoja na zana hayapendekezwi kutumiwa kwenye kozi kwasababu ya kutoendana na moja ya mahitaji ya msingi kama vile utungaji mitihani, upatikanaji, utaifa na uwekaji kumbukumbu.

source: General
sw_ke: Jumla

source: Text
sw_ke: Maandishi

source: Html contents to display for this module
sw_ke: Uonyeshaji wa kipimo cha yaliyomo ya Html

source: Source code for LaTeX documents. This feature is not well-supported.
sw_ke: Asili ya kificho cha nyaraka za LaTeX. Sehemu hii haija saidiwa vya kutosha.

source: Select Visual to enter content and have the editor automatically create the HTML. Select Raw to edit HTML directly. If you change this setting, you must save the component and then re-open it for editing.
sw_ke: Chagua Uonaji kuingiza yaliyomo na mhariri kiwenyewe abuni HTML. Chagua Ghafi kuhariri HTML moja kwa moja. Kama unabadilisha mkakati huu, lazima udhibiti vipengele na kisha uifungue upya kwa uhariri.

source: Editor
sw_ke: Mhariri

source: Visual
sw_ke: Kuonyesha

source: Raw
sw_ke: Ghafi

source: Hide Page From Learners
sw_ke: Ficha Ukurasa Usionekane na Wanafunzi

source: If you select this option, only course team members with the Staff or Admin role see this page.
sw_ke: Ukichagua kipengele hiki, ni washirika wa kozi pekee pamoja na Wafanyakazi au Wasimamizi wa kozi wataona ukurasa huu.

source: HTML for the additional pages
sw_ke: HTML kwa nyongeza za kurasa

source: List of course update items
sw_ke: Orodha ya bidhaa za ukamilishaji wa kozi

source: Image Annotation
sw_ke: Fafanuzi za Taswira

source: Tags for Assignments
sw_ke: Tags kwa Majaribo/Mazoezi

source: Add tags that automatically highlight in a certain color using the comma-separated form, i.e. imagery:red,parallelism:blue
sw_ke: Ongeza tabs ambazo zinaangazia kiwenyewe kwa rangi kutumia mtindo utenganisho wa comma, hivyo kwamba imagery:red,parallelism:blue

source: Location of Annotation backend
sw_ke: Eneo la Fafanuzi wa mwishoni

source: Url for Annotation Storage
sw_ke: Url kwa Uhifadhi wa Fafanuzi

source: Secret string for annotation storage
sw_ke: Mstari wa siri kwa uhifadhi wa fafanuzi

source: Secret Token String for Annotation
sw_ke: Ishara za Siri za Mstari kwa Fafanuzi

source: Default Annotations Tab
sw_ke: Tab za Fafanuzi Kombo

source: Select which tab will be the default in the annotations table: myNotes, Instructor, or Public.
sw_ke: Chagua ni tab ipi itakuwa kombo katika ratiba ya fafanuzi: Nukuu zangu, Mwalimu, au Umma.

source: Email for 'Instructor' Annotations
sw_ke: Fafanuzi za Barua pepe kwa 'Mwalimu'

source: Email of the user that will be attached to all annotations that will be found in 'Instructor' tab.
sw_ke: Barua pepe kwa mwalimu ambae atashikishwa kwa fafanuzi zote zitakazo patikana kwenye tab 'Mwalimu'.

source: Mode for Annotation Tool
sw_ke: Mtindo wa Vifaa vya Fafanuzi

source: Type in number corresponding to following modes: 'instructor' or 'everyone'
sw_ke: Andika nambari vinazo wiyana na mitindo ifuatayo: 'mwalimu' au 'kila mtu'

source: No email address found.
sw_ke: Hakuna anwani ya barua pepe iliyopatikana.

source: Any Type
sw_ke: Aina Yoyote

source: Library
sw_ke: Maktaba

source: Select the library from which you want to draw content.
sw_ke: Chagua maktaba kutoka kwa ipi unayotaka kutoa yaliyomo.

source: Library Version
sw_ke: Tafsiri ya Maktaba

source: Determines how content is drawn from the library
sw_ke: Ina baini vipi yaliyomo yatatolewa kutoka kwa maktaba

source: Choose n at random
sw_ke: Chagua n kwa kubahatisha

source: Count
sw_ke: Hesabu
