Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: sw_ke

source: Status
sw_ke: Hali ilivyo

source: Large
sw_ke: Kubwa

source: Zoom In
sw_ke: Kutazama kwa udogo/ndani

source: Zoom Out
sw_ke: Kutazama kwa ukubwa/nje

source: Page number out of %(total_pages)s
sw_ke: Nambari ya ukurasa kati ya %(total_pages)s

source: Enter the page number you'd like to quickly navigate to.
sw_ke: Weka nambari ya ukurasa ambao wahitaji kuupitia kwa haraka.

source: Sorted by
sw_ke: Chaguliwa kwa

source: Clear search
sw_ke: Tafuta kwa uwazi/Futa utafiti

source: DISCUSSION HOME:
sw_ke: MAHALI PA MAZUNGUMZO:

source: How to use %(platform_name)s discussions
sw_ke: Namna ya kutumia %(platform_name)s mazungumzo

source: Find discussions
sw_ke: Tafuta mazungumzo

source: Use the Discussion Topics menu to find specific topics.
sw_ke: Tumia menu/orodha ya vichwa kutafuta vichwa maalum.

source: Search all posts
sw_ke: Tafuta makala yote

source: Filter and sort topics
sw_ke: Chuja na uchague vichwa

source: Engage with posts
sw_ke: Makala muhimu husika

source: Vote for good posts and responses
sw_ke: Pigia kura kwa makala mazuri na majibu

source: Report abuse, topics, and responses
sw_ke: Toa habari ya utumizi m'baya, vichwa, na majibu

source: Follow or unfollow posts
sw_ke: Fuatilia au usifuatilie makala

source: Receive updates
sw_ke: Pokea ukamilisho wa mambo

source: Toggle Notifications Setting
sw_ke: Matayarisho ya arafa za uhamiaji

source: Check this box to receive an email digest once a day notifying you about new, unread activity from posts you are following.
sw_ke: Angalia kisanduku hii kupokea barua pepe mara moja kwa siku kukujulisha kuhusu makala mapya ambayo hayajasomwa kwenye nguzo uzifuatiliazo.

source: Mark as Answer
sw_ke: Weka alama kukubali ni jibu

source: Unmark as Answer
sw_ke: Imekatalika kuwa jibu kwa alama

source: Open
sw_ke: Fungua/Wazi

source: Endorse
sw_ke: Maandishi yakuongezea kwenye nakala

source: Unendorse
sw_ke: Kuondoa maandishi maongezi kwenye nakala

source: Follow
sw_ke: Fuata

source: Unfollow
sw_ke: Usifuate

source: Pin
sw_ke: Kudunga/kubandika ilani kwa Msumari

source: Unpin
sw_ke: Kubandua ilani iliobandikwa kwa Msumari

source: Report abuse
sw_ke: Toa ahabari ya utumizi m'baya

source: Report
sw_ke: Toa habari

source: Unreport
sw_ke: Usitoe habari

source: Vote for this post,
sw_ke: Pigia kura makala haya,

source: Visible To:
sw_ke: Onekana na:

source: All Groups
sw_ke: Makundi yote

source: Discussion admins, moderators, and TAs can make their posts visible to all students or specify a single cohort.
sw_ke: Watawala, wasimamizi, na TAs waweza kufanya nakala za mazungumzo yao zionekane kwa wanafunzi wote au kwa waliofungamano maalum.

source: Title:
sw_ke: Kichwa

source: Add a clear and descriptive title to encourage participation.
sw_ke: Ongezea kichwa kilicho wazi na ufafanuzi bora kushajihisha uhusikaji.

source: Enter your question or comment
sw_ke: Ingiza suala au maoni yako

source: follow this post
sw_ke: Fuatilia makala haya

source: post anonymously
sw_ke: Makala jumuia

source: post anonymously to classmates
sw_ke: Makala jumuia kwa wanadarasa moja

source: Add Post
sw_ke: Ongeza Makala

source: Community TA
sw_ke: Jamii TA

source: This thread is closed.
sw_ke: Uzi huu umefungwa.

source: View discussion
sw_ke: Tizama mazungumzo

source: Editing comment
sw_ke: Kukagua maoni

source: Update comment
sw_ke: Kamilisha maoni

source: posted %(time_ago)s by %(author)s
sw_ke: Makala %(time_ago)s na %(author)s

source: Reported
sw_ke: Tolea habari

source: Editing post
sw_ke: Kagua makala

source: Edit post title
sw_ke: Kagua kichwa cha makala

source: Update post
sw_ke: Kamilisha makala

source: discussion
sw_ke: mazungumzo

source: answered question
sw_ke: suali lililojibiwa

source: unanswered question
sw_ke: suali halijajibiwa

source: Pinned
sw_ke: Kudunga msumari

source: Following
sw_ke: Kufuatia

source: By: Staff
sw_ke: Na: Mfanyi kazi

source: By: Community TA
sw_ke: Na: Jamii TA

source: %(comments_count)s %(span_sr_open)scomments (%(unread_comments_count)s unread comments)%(span_close)s
sw_ke: %(comments_count)s %(span_sr_open)smaoni (%(unread_comments_count)s unread comments)%(span_close)s

source: %(comments_count)s %(span_sr_open)scomments %(span_close)s
sw_ke: %(comments_count)s %(span_sr_open)smaoni %(span_close)s

source: Editing response
sw_ke: Kagua majibisho

source: Update response
sw_ke: Kamilisha majibisho

source: marked as answer %(time_ago)s by %(user)s
sw_ke: imekubalika kuwa jibu kwa alama %(time_ago)s na %(user)s

source: marked as answer %(time_ago)s
sw_ke: imekubalika kuwa jibu kwa alama %(time_ago)s

source: endorsed %(time_ago)s by %(user)s
sw_ke: ongezea kwa umuhimu %(time_ago)s na %(user)s

source: endorsed %(time_ago)s
sw_ke: ongezea kwa umuhimu %(time_ago)s

source: Show Comment (%(num_comments)s)
sw_ke: Onyesha Oni (%(num_comments)s)

source: Add a comment
sw_ke: Ongeza oni

source: Submit
sw_ke: Fikisha

source: %(post_type)s posted %(time_ago)s by %(author)s
sw_ke: %(post_type)s makala %(time_ago)s na %(author)s

source: Closed
sw_ke: Imefungwa

source: Related to: %(courseware_title_linked)s
sw_ke: Husiana na: %(courseware_title_linked)s

source: This post is visible only to %(group_name)s.
sw_ke: Makala haya yanaoneshwa kwa %(group_name)s.

source: This post is visible to everyone.
sw_ke: Makala haya yanaonekana na watu wote.

source: Post type:
sw_ke: Aina ya makala:

source: Question
sw_ke: Suali

source: Discussion
sw_ke: Mazungumzo

source: Questions raise issues that need answers. Discussions share ideas and start conversations.
sw_ke: Masuali yaleta mambo yanayohitaji majibu. Mazungumzo ni kupeana fikra na mwanzo wa majadiliano.

source: Add a Response
sw_ke: Ongezea Majibisho

source: Post a response:
sw_ke: Makala ya majibisho:

source: Expand discussion
sw_ke: Refusha mazungumzo

source: Collapse discussion
sw_ke: Fupisha mazungumzo

source: Topic Area:
sw_ke: Maeneo ya kichwa cha mjadala:

source: Discussion topics; currently listing:
sw_ke: Vichwa vya mazungumzo; kwa orodha inayotumika hivi sasa:

source: Filter topics
sw_ke: Chuja vichwa

source: Add your post to a relevant topic to help others find it.
sw_ke: Ongezea makala yako kwa kichwa husika kusaidia wengine kuipata.

source: Active Threads
sw_ke: Nyuzi Chachamavu

source: username or email
sw_ke: jinatumishi au barua pepe

source: course id
sw_ke: kitambulisho cha fanni

source: No results
sw_ke: Hakuna matokeo

source: Course Key
sw_ke: Ufunguo wa Fanni

source: Download URL
sw_ke: Shukihsa URL

source: Grade
sw_ke: Kiwango cha ubora

source: Last Updated
sw_ke: Mwisho Kukamilishwa

source: Download the user's certificate
sw_ke: Shukisha cheti cha mtumiaji

source: Not available
sw_ke: Haipatikanai

source: Regenerate
sw_ke: Tengeneza tena

source: Regenerate the user's certificate
sw_ke: Tengeneza tena cheti cha mtumiaji

source: Generate
sw_ke: Tengeneza

source: Generate the user's certificate
sw_ke: Tengeneza cheti cha mtumiaji

source: Current enrollment mode:
sw_ke: Mtindo unaoendelea hivi sasa wa usajili:

source: New enrollment mode:
sw_ke: Mtindo mpya wa usajili:

source: Reason for change:
sw_ke: Sababau ya kubadilisha:

source: Choose One
sw_ke: Chagua Moja

source: Explain if other.
sw_ke: Elezea kama kuna nyingine.

source: Submit enrollment change
sw_ke: Fikisha mabadiliko ya usajili

source: Username or email address
sw_ke: Jinatumishi au barua pepe

source: Course ID
sw_ke: Kitambulisho cha Fanni

source: Course Start
sw_ke: Kuanza kwa Fanni

source: Course End
sw_ke: Kumalizika kwa Fanni

source: Upgrade Deadline
sw_ke: Kamilisha Mwisho Utarajiwao

source: Verification Deadline
sw_ke: Mwisho wa uhakikishaji

source: Enrollment Date
sw_ke: Tarehe ya Usajili

source: Enrollment Mode
sw_ke: Mtindo wa Usajili

source: Verified mode price
sw_ke: Bei ya Mtindo Iliosawazishwa

source: Reason
sw_ke: Sababu

source: Last modified by
sw_ke: Mwisho kuboreshwa na

source: N/A
sw_ke: Haiambatani

source: Change Enrollment
sw_ke: Badilisha Usajili

source: Your team could not be created.
sw_ke: Kikosi chako hakikutengenezwa.

source: Your team could not be updated.
sw_ke: Kikosi chako hakikukamilishwa.

source: Enter information to describe your team. You cannot change these details after you create the team.
sw_ke: Ingiza habari kuelezea kikosi chako. Huwezi kubadilisha maelezo haya baada ya kutengeneza kikosi.

source: Optional Characteristics
sw_ke: Desturi za Hiari

source: Help other learners decide whether to join your team by specifying some characteristics for your team. Choose carefully, because fewer people might be interested in joining your team if it seems too restrictive.
sw_ke: Saidia wanaojifunza wengine kuamua kama aunge kikosi kwa kufafanua desturiza kikosi chako. Chagua kwa makini, sababu watu wachache waweza kupendelea kujiunga na kikosi chako kikionesha kuwa na kanuni kali mno.

source: Create team.
sw_ke: Unda kikosi

source: Update team.
sw_ke: Kamilisha kikosi.

source: Cancel team creating.
sw_ke: Futilia mbali uundaji wa kikosi.

source: Cancel team updating.
sw_ke: Futilia mbali ukamilishaji wa kikosi.

source: Instructor tools
sw_ke: Vifaa vya mkufunzi

source: Delete Team
sw_ke: Futa kikosi

source: Edit Membership
sw_ke: Kagua Uwanachama

source: Are you having trouble finding a team to join?
sw_ke: Je, una pata shida kutafuta kikosi kujiunga?

source: Join Team
sw_ke: Ungana na Kikosi

source: New Post
sw_ke: Makala Mapya

source: Team Details
sw_ke: Maelezo zaidi ya Kikosi

source: You are a member of this team.
sw_ke: Wewe ni mwanachama wa kikosi hiki.

source: Team member profiles
sw_ke: Maelezo ya mwanakikosi

source: Team capacity
sw_ke: Kiwango cha juu cha kikosi kwa idadi

source: country
sw_ke: Nchi/Taifa

source: language
sw_ke: Lugha

source: Leave Team
sw_ke: Acha Kikosi

source: Donate
sw_ke: Changia

source: There was an error retrieving preview results for this catalog. Please check that your query is correct and try again.
sw_ke: Kulikuwa na hitlafu kung'oa majibu ya mtazamo kabla ya katalogi hii. Tafadhali tizama kuwa suali lako ni sawa na ujaribu tena.

source: This catalog's courses:
sw_ke: Hii ni katalogi ya kozi:

source: My Bookmarks
sw_ke: Alama za kitabu changu

source: Bookmarked on
sw_ke: Kitabu kina alama ya kuwakisha

source: You have not bookmarked any courseware pages yet.
sw_ke: Hujakuwa na alama yoyote ya kitabu kwa fanni yoyote bado.

source: Use bookmarks to help you easily return to courseware pages. To bookmark a page, select Bookmark in the upper right corner of that page. To see a list of all your bookmarks, select Bookmarks in the upper left corner of any courseware page.
sw_ke: Tumia alama zikusaidie kurudia ukurasa wa mtandao kwa urahisi.Kueka alama kwenye ukurasa, chagua katika kona ya juu kulia ya ukurasa huo.Kuona orodha ya alama zote ulizo weka, chagua alama katika kona ya juu kushoto ya ukurasa wa mtandao.

source: Expand All
sw_ke: Refusha Zote

source: Collapse All
sw_ke: Fupisha Zote

source: Start Date
sw_ke: Tarehe ya Kuanza

source: Due Date
sw_ke: Tarehe inayoTarajiwa

source: remove all
sw_ke: Ondoa Zote

source: Section
sw_ke: Kitengo

source: Remove chapter %(chapterDisplayName)s
sw_ke: Ondoa kichwa toto %(chapterDisplayName)s

source: remove
sw_ke: ondoa

source: Subsection
sw_ke: Kitengo toto

source: Remove subsection %(subsectionDisplayName)s
sw_ke: Ondoa kichwa toto %(subsectionDisplayName)s

source: Remove unit %(unitName)s
sw_ke: Ondoa unit %(unitName)s

source: You still need to visit the %(display_name)s website to complete the credit process.
sw_ke: Bado wahitaji kutemebelea %(display_name)s mtandao wa web kukamilisha shughuli za mkopo.

source: To finalize course credit, %(display_name)s requires %(platform_name)s learners to submit a credit request.
sw_ke: Kumalizia mkopo wa fanni,%(display_name)s ya hitaji %(platform_name)s wanaojifunza kufikisha maombi ya mkopo.

source: Get Credit
sw_ke: Pata Mkopo

source: Thank you! We have received your payment for %(course_name)s.
sw_ke: Asante! tumepokea malipo yako ya %(course_name)s.

source: Please print this page for your records; it serves as your receipt. You will also receive an email with the same information.
sw_ke: Tafadhali chapisha ukurasa huu kwa nukuu zako; inahudumu kama risiti. pia utapokea barua pepe na ujumbe huu huu.

source: Order No.
sw_ke: Nambari ya Mahitaji.

source: Amount
sw_ke: Kima

source: Total
sw_ke: Jumla

source: Please Note
sw_ke: Tafadhali Tambua

source: Crossed out items have been refunded.
sw_ke: Vitu vilivyo kataliwa kwenye orodha vimerudishiwa pesa zake.

source: Billed to
sw_ke: Kwa mlipiaji

source: No receipt available
sw_ke: Hakuna risiti anayotolewa

source: Go to Dashboard
sw_ke: Nenda kwa Dashboard

source: Want to confirm your identity later?
sw_ke: Unahitaji kuhakikisha kitambulisho chako baadae?

source: Verify Now
sw_ke: Sawazisha Sasa

source: Mark Exam As Completed
sw_ke: Eka Alama Kukamilika kwa Mtihani

source: timed
sw_ke: kwa wakati maalum

source: To receive credit on a problem, you must click "Check" or "Final Check" on it before you select "End My Exam".
sw_ke: Kupata mkopo kwa tatizo, lazima ubofye \"Check\" au \"Final Check\" katika tatizo hilo kabla kuchagua \"End My Exam\".

source: End My Exam
sw_ke: Maliza Mtihani Wangu

source: LEARN MORE
sw_ke: JIFUNZE ZAIDI

source: Starts: %(start_date)s
sw_ke: Inaanza: %(start_date)s

source: Starts
sw_ke: Inaanza

source: Clear All
sw_ke: Ondosha/Safisha Zote

source: Highlighted text
sw_ke: Ujumbe ulioangaziwa

source: Note
sw_ke: Ilani/Ujulisho/Ujumbe/Arafa

source: You commented...
sw_ke: Uligusia...

source: Noted in:
sw_ke: Kunukuliwa

source: Last Edited:
sw_ke: Mwisho kukaguliwa:

source: Clear search results
sw_ke: Ondoa matokeo ya utafiti

source: Click to edit
sw_ke: Bofya kukagua

source: title
sw_ke: kichwa

source: Financial Assistance Application
sw_ke: Ombi la kuwa Naibu Mhasibu

source: Unable to submit application
sw_ke: Haiwezi kufikisha ombi

source: About You
sw_ke: Kuhusu Wewe

source: The following information is already a part of your {platform} profile. We\'ve included it here for your application.
sw_ke: Maelezo yanayo fuata tayari ni baadhi ya {platform} profile yako. Tu\\ me jumuisha hapa kwa ombi lako.

source: Email address
sw_ke: Anwani barua pepe

source: Legal name
sw_ke: Jina halali

source: Country of residence
sw_ke: Nchi unayo ishi

source: Back to {platform} FAQs
sw_ke: Rudi kwa {platform} FAQs

source: Submit Application
sw_ke: Fikisha Ombi

source: Thank you for submitting your financial assistance application for {course_name}! You can expect a response in 2-4 business days.
sw_ke: Asante kwa kufikisha ombi lako la naibu mhasibu kwa {course_name}! Waweza kukubali majibisho kati ya siku 2-4 za kazi.

source: Bulk Exceptions
sw_ke: Makubwa Yasiokawaida

source: Upload a comma separated values (.csv) file that contains the usernames or email addresses of learners who have been given exceptions. Include the username or email address in the first comma separated field. You can include an optional note describing the reason for the exception in the second comma separated field.
sw_ke: Pakia tathmini ya faili za utenganishi wa koma (.csv) ambazo zina jinatumishi au anwani za barua pepe za wanagenzi ambao wamepewa ruhusa kinyume cha kanuni. Pamoja na jinatumishi au anwani barua pepe katika kiwanja cha utenganishi wa koma ya kwanza. Unaweza kuongeza nukuu ya hiari inayoeleza sababu za ruhusa kinyume cha kanuni katika kiwanja cha pili cha koma ya utenganishi.

source: Browse
sw_ke: Kuvinjari

source: Add to Exception List
sw_ke: Ongezea kwa Ordha ya Wakubalika

source: To invalidate a certificate for a particular learner, add the username or email address below.
sw_ke: Kubatilisha Cheti cha mwanagenzi maalum,ongezea jinatumishi au barua pepe kwa hapo chini

source: Add notes about this learner
sw_ke: Ongezea arafa kuhusu mwanagenzi huyu

source: Invalidate Certificate
sw_ke: Batilisha Cheti

source: Student
sw_ke: Mwanafunzi

source: Invalidated By
sw_ke: Imebatilishwa Na

source: Invalidated
sw_ke: Imebatilishwa

source: Notes
sw_ke: Arafa

source: Action
sw_ke: Kitendo

source: Remove from Invalidation Table
sw_ke: Ondoa kutoka Kwa Meza/Orodha ya Ubatilishaji

source: Individual Exceptions
sw_ke: Kubalika Kibinafsi

source: Enter the username or email address of each learner that you want to add as an exception.
sw_ke: Ingiza jinatumishi au barua pepe ya kila mwanagenzi unaetaka kumuongezea kama mkubalika.

source: Generate Exception Certificates
sw_ke: Tengeneza Vyeti vya Wakubalika

source: Generate certificates for all users on the Exception list who do not yet have a certificate
sw_ke: Zalisha vyeti kwa watumiaji wote katika orodha ya wasiokawaida ambao bado hawana vyeti

source: Generate a Certificate for all users on the Exception list
sw_ke: Tengeneza Cheti kwa watumiaji wote kwenye ordha ya Wakubilika

source: User Email
sw_ke: Barua pepe ya Mtumiaji

source: Exception Granted
sw_ke: Ukubalikaji umeRidhiwa

source: Certificate Generated
sw_ke: Cheti Kimetengenezwa

source: Remove from List
sw_ke: Ondoa kwenye Orodha

source: Specify whether discussion topics are divided by cohort
sw_ke: Elezea kwa kina kama vichwa vya mjadala vimegawanyika kwa mashabiki wapinzani

source: Course-Wide Discussion Topics
sw_ke: Fanni-Pana Vichwa Vya Mjadala

source: Select the course-wide discussion topics that you want to divide by cohort.
sw_ke: Chagua Vichwa Vya mjadala wa fanni-pana unavyo pendelea ugawanye kwa ushabiki pinzani.

source: Content-Specific Discussion Topics
sw_ke: Vichwa vya Mjadala wa Maudhui-Kwa Kina

source: Specify whether content-specific discussion topics are divided by cohort.
sw_ke: Elezea kwa ukamilifu vichwa vya maudhui-kwa kina vimegawanywa kwa upinzani.

source: Always cohort content-specific discussion topics
sw_ke: Kawaida mjadala wa maudhui-kwa kina yana pingamizi

source: Cohort selected content-specific discussion topics
sw_ke: Upinzani ulichagua vichwa vya maudhui-kwa kina

source: No content-specific discussion topics exist.
sw_ke: Hamna mjadala wa vichwa vya maudhui-kwa kina.

source: Cohorted
sw_ke: Shabikia kwa upingaji

source: Manage Students
sw_ke: Kumudu wanafunzi

source: Add students to this cohort
sw_ke: Ongezea wanafunzi kwa ushabiki huu

source: Note: Students can be in only one cohort. Adding students to this group overrides any previous group assignment.
sw_ke: Arafa: Wanafunzi wanaweza kushabikia mara moja. Kuongezea wanafunzi kwa kundi hili inatosheleza kwa mtihani toto uliopita wa kundi.

source: Enter email addresses and/or usernames, separated by new lines or commas, for the students you want to add. *
sw_ke: Ingiza barua pepe na/au majinatumishi, tenganisha kwa mistari mipya au commas, kwa wanafunzi upendao kuongezea.

source: e.g. johndoe@example.com, JaneDoe, joeydoe@example.com
sw_ke: kwa mfano johndoe@example.com, janeDoe joeydoe@example.com

source: You will not receive notification for emails that bounce, so double-check your spelling.
sw_ke: Hutapokea arafa kwa barua pepe zitakazo dunda, kwa hiyo hakikisha herufi zako mara mbili.

source: Add Students
sw_ke: Ongezea Wanafunzi

source: Add a New Cohort
sw_ke: Ongezea Upinzani Mpya

source: Enter the name of the cohort
sw_ke: Ingiza jina la upinzani

source: Cohort Name
sw_ke: Jina la Ufungamano wa kundi

source: Cohort Assignment Method
sw_ke: Njia ya Mazoezi ya Waliofungamana

source: Automatic
sw_ke: Kujiendesha kiwenyewe

source: Manual
sw_ke: Kitabu cha mwongozo / Kitabu cha kiada.

source: There must be one cohort to which students can automatically be assigned.
sw_ke: Lazima kuwe na ufungamano mmoja ambao wanafunzi waweza kupewa mazoezi/majukuma.

source: Associated Content Group
sw_ke: Kundi la Yaliyomo lenye Kuhusishwa

source: No Content Group
sw_ke: Hakuna Kundi la Yaliyomo

source: Select a Content Group
sw_ke: Chagua Kundi la Yaliyomo

source: Choose a content group to associate
sw_ke: Chagua kundi la yaliyomo kulihusisha

source: Not selected
sw_ke: Haiku chaguliwa

source: Deleted Content Group
sw_ke: Futa Kundi La Yaliyomo

source: {screen_reader_start}Warning:{screen_reader_end} The previously selected content group was deleted. Select another content group.
sw_ke: {screen_reader_start}Onyo:{screen_reader_end} Kundi lililochaguliwa mbeleni la yaliyomo limefutwa. Chagua kundi jingine la yaliyomo.

source: {screen_reader_start}Warning:{screen_reader_end} No content groups exist.
sw_ke: {screen_reader_start}Onyo:{screen_reader_end} Hakuna kundi la yaliyomo liliopo.

source: Create a content group
sw_ke: Buni kundi la yaliyomo

source: (contains %(student_count)s student)
sw_ke: (ina mwanafunzi %(student_count)s)

source: Learners are added to this cohort only when you provide their email addresses or usernames on this page.
sw_ke: Wanagenzi wanaongezwa kwa ufungamano huu ikiwa tu utatoa anwani zao za barua pepe au majinatumishi kwenye ukurasa huu.

source: What does this mean?
sw_ke: Hii ina maanisha nini?

source: Learners are added to this cohort automatically.
sw_ke: Wanagenzi wanaongezwa kwa ufungamano huu kiwenyewe.

source: Select a cohort
sw_ke: Chagua kundi la ufungamano

source: Enable Cohorts
sw_ke: Wezesha Makundi ya mafungamano

source: Select a cohort to manage
sw_ke: Chagua kundi la ufungamano kumudu

source: View Cohort
sw_ke: Tizama Ufungamano

source: Assign students to cohorts by uploading a CSV file
sw_ke: Wagawe wanafunzi katika makundi ya mafungamano kwa kupakia faili ya CSV

source: To review student cohort assignments or see the results of uploading a CSV file, download course profile information or cohort results on {link_start} the Data Download page. {link_end}
sw_ke: Kutizama upya mgao wa wanafunzi kwa makundi ya mafungamano au kuangalia majibu ya upakiaji wa faili ya CSV,shukisha/shusha habari za wasifu wa kozi au majibu ya kundi la ufungamano kwenye {link_start} Ukurasa wa Kushusha Habari. {link_end}

source: Used
sw_ke: Kimetumika

source: Valid
sw_ke: Halali

source: XSeries Program Certificates
sw_ke: Vyeti vya Ratiba ya XSeries

source: certificate.credential_url
sw_ke: cheti/hati.sifa_url

source: certificate.display_name
sw_ke: hati/cheti.onyesha_jina

source: You are not enrolled in any XSeries Programs yet.
sw_ke: Bado hujasajiliwa kwenye Ratiba yoyote ya XSeries.

source: Explore XSeries Programs
sw_ke: Talii Ratiba za XSeries

source: Browse recently launched courses and see what\'s new in your favorite subjects
sw_ke: Vinjari kozi zilizozinduliwa karibuni na uone yapi mapya katika masomo uyapendayo zaidi

source: Explore New XSeries
sw_ke: Talii XSeries Mpya

source: type
sw_ke: aina

source: You have earned certificates in %(completed_courses)s of the %(total_courses)s courses so far.
sw_ke: Umechuma vyeti katika %(completed_courses)s kati ya %(total_courses)s kozi zote.

source: Load next %(num_items)s result
sw_ke: Pakia %(num_items)s jibu lifuatalo

source: Sorry, no results were found.
sw_ke: Samahani/Twaomba radhi, hakuna majibu yoyote yaliyopatikana.

source: Back to Dashboard
sw_ke: Rudi kwa Dashibodi

source: New Address
sw_ke: Anwani Mpya

source: Change My Email Address
sw_ke: Badilisha Anwani Yangu ya Barua pepe

source: Account Settings
sw_ke: Mikakati ya Akaunti

source: These settings include basic information about your account. You can also specify additional information and see your linked social accounts on this page.
sw_ke: Mikakati hii ni pamoja na habari msingi za akaunti yako. Waweza pia kutaja habari za nyongeza na uone akaunti zako za kijamii zilizounganishwa katika ukurasa huu.

source: section.title
sw_ke: kifungu.kichwa

source: An error occurred. Please reload the page.
sw_ke: Kuna hitlafu imetokea. Tafadhali pakia upya ukurasa.

source: Forgot password?
sw_ke: Umesahau nywila?

source: Sign in
sw_ke: Kujiandikisha / Kuweka sahihi
