Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Discussion
sw_ke: Majadiliano

source: Problem
sw_ke: Tatizo

source: Advanced
sw_ke: Iliyoboreshwa

source: Entrance Exam
sw_ke: Mtihani wa Kujiunga na masomo

source: Section
sw_ke: Kifungu

source: Subsection
sw_ke: Kifungu kidogo

source: Unit
sw_ke: Kitengo

source: Name
sw_ke: Jina

source: Video ID
sw_ke: Kitambulisho cha Video

source: Status
sw_ke: Hali ilivyo

source: Pending
sw_ke: Inasubiri huduma

source: Mode
sw_ke: Mtindo / Namna

source: Verification Deadline
sw_ke: Mwisho wa uthibitishaji

source: OPTIONAL: After this date/time, users will no longer be able to submit photos for verification. This appies ONLY to modes that require verification.
sw_ke: NI KWA HIARI:Baada ya tarehe/wakati huu, watumiaji hawataweza tena kuwasilisha picha kwa uthibitishaji. Hii inahusu TU kwa namna zinazohitaji uthibitishaji.

source: Your verification is pending
sw_ke: Uthibitisho wako una subirir maamuzi

source: Verified: Pending Verification
sw_ke: Imethibitishwa: Uthibitishaji unasubiri

source: ID verification pending
sw_ke: Uthibitishaji wa Kitambulisho unasubiri maamuzi

source: You're enrolled as a verified student
sw_ke: Umesajiliwa kama mwanafunzi aliyethibitishwa

source: Verified
sw_ke: Imethibitishwa

source: ID Verified Ribbon/Badge
sw_ke: Utepe/Beji ya Kitambulisho Kilichothibitishwa

source: You're enrolled as an honor code student
sw_ke: Umesajiliwa kama mwanafunzi wa kifcho cha heshima

source: Honor Code
sw_ke: Kanuni ya kimaadili

source: You're enrolled as a professional education student
sw_ke: Umesajiliwa kama mwanafunzi wa elimu ya fani maalum

source: Professional Ed
sw_ke: Mtaalamu wa Elimu

source: Course
sw_ke: Kozi

source: Display Name
sw_ke: Onesha Jina

source: Price
sw_ke: Bei

source: Upgrade Deadline
sw_ke: Andika upya Muda wa Mwisho

source: OPTIONAL: After this date/time, users will no longer be able to enroll in this mode. Leave this blank if users can enroll in this mode until enrollment closes for the course.
sw_ke: HIARI: Baada ya tarehe/wakati huu, watumiaji hawataweza tena kusajili katika mtindo huu. Acha hii wazi kama watumiaji wanaweza kusajili katika mtindo huu mpaka usajili wa kozi ufungwe.

source: OPTIONAL: This is the SKU (stock keeping unit) of this mode in the external ecommerce service. Leave this blank if the course has not yet been migrated to the ecommerce service.
sw_ke: HIARI: Hii ni SKU (stock keeping unit) ya mtindo huu katika huduma ya nje ya ecommerce. Acha hii wazi kama kozi bado haija hamishwa kwenda kwenye huduma ya ecommerce.

source: This is the bulk SKU (stock keeping unit) of this mode in the external ecommerce service.
sw_ke: Hii ni SKU nyingi/nono (stock keeping unit) ya mtindo huu katika huduma ya ecommerce ya nje.

source: Honor
sw_ke: Heshima

source: Professional education modes are not allowed to have expiration_datetime set.
sw_ke: Mitindo ya elimu ya taaluma hairuhusiwi kuwa na muda wa mwisho_urekebishaji tarehe na wakati.

source: Verified modes cannot be free.
sw_ke: Mitindo iliyo thibitishwa/hakikiwa haiwezi kuwa huru.

source: Free
sw_ke: Bure / Huru

source: The time period before a course ends in which a course mode will expire
sw_ke: Kipindi cha muda kabla ya kumalizika kwa kozi ambapo muda wa mtindo wa kozi utamalizika.

source: Congratulations! You are now enrolled in {course_name}
sw_ke: Hongera! Sasa umesajiliwa kwenye {course_name}

source: Enrollment is closed
sw_ke: Usajili umefungwa

source: Enrollment mode not supported
sw_ke: Mtindo wa usajili haujawezeshwa

source: Invalid amount selected.
sw_ke: Kiasi batili kimechaguliwa.

source: No selected price or selected price is too low.
sw_ke: Hakuna bei iliyochaguliwa au bei iliyochaguliwa ni ndogo sana.

source: Administrator
sw_ke: Msimamizi/Mtawala

source: Moderator
sw_ke: Msimamizi

source: Community TA
sw_ke: Jamii TA

source: Student
sw_ke: Mwanafunzi

source: User profile
sw_ke: Wasifu wa Mtumiaji

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
sw_ke: Anwani ile ya barua pepe haina akaunti inayohusiana nayo. Je, una hakika umejiandikisha?

source: The user account associated with this e-mail address cannot reset the password.
sw_ke: Akaunti ya mtumiaji inayohusiana na anwani ya barua pepe hii haiwezi kuunda upya nywila.

source: A properly formatted e-mail is required
sw_ke: Anwani ya barua pepe iliyo na mfumo sahihi inahitajika

source: A valid password is required
sw_ke: Nywila halali inahitajika

source: Your legal name must be a minimum of two characters long
sw_ke: Jina lako halali kwa uchache liwe na urefu wa herufi mbili

source: Email cannot be more than %(limit_value)s characters long
sw_ke: Barua pepe haiwezi kuwa na urefu wa zaidi ya herufi %(limit_value)s

source: You must accept the terms of service.
sw_ke: Lazima ukabali mashrti ya huduma.

source: A level of education is required
sw_ke: Kiwango cha elimu kinahitajika

source: Your gender is required
sw_ke: Jinsia yako inahitajika

source: Your year of birth is required
sw_ke: Mwaka wako wa kuzaliwa unahitajika

source: Your mailing address is required
sw_ke: Anwani yako ya barua pepe inahitajika

source: A description of your goals is required
sw_ke: Maelezo ya malengo yako yanahitajika

source: A city is required
sw_ke: Jina la mji linahitajika

source: A country is required
sw_ke: Jina la nchi linahitajika

source: To enroll, you must follow the honor code.
sw_ke: Kusajili, lazima ufuate kanuni za maadili ya taaluma.

source: You are missing one or more required fields
sw_ke: Hujajaza moja au zaidi ya vipengele vinavyohitajika

source: Username and password fields cannot match
sw_ke: Jina la mtumiaji na nywila havilingani

source: Password:
sw_ke: Nywila:

source: Unauthorized email address.
sw_ke: Anwani ya barua pepe isiyoidhinishwa/kubalika.

source: It looks like {email} belongs to an existing account. Try again with a different email address.
sw_ke: Ni kama {email} inatumiwa na mtu mwingine. Jaribu tena kwakutumia anwani ya barua pepe tofauti.

source: Removed group: "{}"
sw_ke: Kundi lililoondolewa: "{}"

source: Did not find a group with name "{}" - skipping.
sw_ke: Haikuweza kupata kundi lenye jina "{}" - kurukaruka.

source: Invalid group name: "{group_name}". {messages}
sw_ke: Jina batili la kundi: "{group_name}". {messages}

source: Created new group: "{}"
sw_ke: Imebuni kundi jipya: "{}"

source: Found existing group: "{}"
sw_ke: Imepata kundi lililopo: "{}"

source: Adding {codenames} permissions to group "{group}"
sw_ke: Kuongeza {codenames} ruhusa/idhini kwenye kundi "{group}"

source: Removing {codenames} permissions from group "{group}"
sw_ke: Kuondoa {codenames} ruhusa kutoka kwenye kundi "{group}"

source: Invalid permission option: "{}". Please specify permissions using the format: app_label:model_name:permission_codename.
sw_ke: Kipengele batili cha ruhusa: "{}". Tafadhali bainisha/taja ruhusa kutumia mfumo: programu-tumishi_utambulisho:mtindo_jina:ruhusa_mficho/msimbo wa jina.

source: Invalid permission codename: "{codename}". No such permission exists for the model {module}.{model_name}.
sw_ke: Msimbojina batili wa ruhusa: "{codename}". Ruhusa kama hiyo haipo kwenye mtindo {module}.{model_name}.

source: Setting {attribute} for user "{username}" to "{new_value}"
sw_ke: Mpangilio {attribute} kwa ajili ya mtumiaji "{username}" kwa "{new_value}"

source: Skipping user "{}" because the specified and existing email addresses do not match.
sw_ke: Kurukaruka mtumiaji "{}" kwasababu anwani iliyotajwa hailingani na anwani za barua pepe zilizopo.

source: Did not find a user with username "{}" - skipping.
sw_ke: Haikupata mtumiaji mwenye jina la mtumiaji "{}" - kurukaruka.

source: Removing user: "{}"
sw_ke: Kuondoa mtumiaji: "{}"

source: Created new user: "{}"
sw_ke: Imebuni mtumiaji mpya: "{}"

source: Found existing user: "{}"
sw_ke: Imempata mtumiaji aliyepo: "{}"

source: Setting unusable password for user "{}"
sw_ke: Kupanga nenosiri lisilotumika kwa ajili ya mtumiaji "{}"

source: Created new profile for user: "{}"
sw_ke: Imebuni wasifu mpya kwa ajili ya mtumiaji: "{}"

source: Could not find a group named "{}" - skipping.
sw_ke: Haikuweza kupata kundi linaloitwa "{}" - kurukaruka.

source: Adding user "{username}" to groups {group_names}
sw_ke: Kuongeza mtumiaji "{username}" kwenye makundi {group_names}

source: Removing user "{username}" from groups {group_names}
sw_ke: Kumuondoa mtumiaji "{username}" kwenye makundi {group_names}

source: Your account has been disabled. If you believe this was done in error, please contact us at {support_email}
sw_ke: Akaunti yako imelemazwa. Kama unaamini hili lilifanyika kwa makosa, tafadhali wasiliana nasi kupitia {support_email}

source: Disabled Account
sw_ke: Akaunti Iliyolemazwa

source: Male
sw_ke: Mwanamume

source: Female
sw_ke: Mwanamke

source: Other/Prefer Not to Say
sw_ke: Mengine/Napendelea kutokusema

source: Doctorate
sw_ke: Shahada ya Udaktari

source: Master's or professional degree
sw_ke: Shahada ya uzamili au shahada ya kitaaluma

source: Bachelor's degree
sw_ke: Shahada ya kwanza

source: Associate degree
sw_ke: Shahada shirikishi

source: Secondary/high school
sw_ke: Shule ya sekondari

source: Junior secondary/junior high/middle school
sw_ke: Shule ya sekondari ya mwanzo/upili wa daraja la juu /shule ya kati

source: Elementary/primary school
sw_ke: Shule ya Chekechea / Shule ya msingi

source: No formal education
sw_ke: Hakuna elimu rasmi

source: Other education
sw_ke: Elimu nyingine

source: {platform_name} Honor Code Certificate for {course_name}
sw_ke: {platform_name} Cheti cha Maadili ya Kitaaluma kwa ajili ya {course_name}

source: {platform_name} Verified Certificate for {course_name}
sw_ke: {platform_name} Cheti Kilichothibitishwa kwa ajili ya {course_name}

source: {platform_name} Professional Certificate for {course_name}
sw_ke: {platform_name}Cheti cha Kitaaluma kwa ajili ya {course_name}

source: The company identifier for the LinkedIn Add-to-Profile button e.g 0_0dPSPyS070e0HsE9HNz_13_d11_
sw_ke: KItambulisho cha kampuni kwa Linkedln kifungo cha Ongeza-kwenye-Wasifu mfano 0_0dPSPyS070e0HsE9HNz_13_d11_

source: Short identifier for the LinkedIn partner used in the tracking code. (Example: 'edx') If no value is provided, tracking codes will not be sent to LinkedIn.
sw_ke: Mtambuaji wa muda mfupi wa Linkeln aliyetumika katika kificho cha mkokoto. (Example: 'edx') Kama hakuna tathmini iliyotolewa, vificho vya mkokoto havitatumwa kwenye Linkedln.

source: {platform_name} Certificate for {course_name}
sw_ke: {platform_name} Cheti kwa ajili ya {course_name}

source: The ISO 639-1 language code for this language.
sw_ke: Kificho hiki cha lugha ISO 639-1 ni kwa ajili ya lugha hii.

source: Namespace of enrollment attribute
sw_ke: Nafasi ya kuweka jina kwa ajili ya kujiandikisha

source: Name of the enrollment attribute
sw_ke: Jina la mwenye sifa ya kujiandikisha

source: Value of the enrollment attribute
sw_ke: Namba ya sababu ya udahili

source: The window of time after enrolling during which users can be granted a refund, represented in microseconds. The default is 14 days.
sw_ke: Dirisha la wakati baada ya kusajili ambapo mtumiaji yupi anaweza kupewa ridhaa ya makubaliano, imewakilishwa kwa sekunde ndogo. Kosa hili ni kwa siku 14

source: Name of the UTM cookie
sw_ke: Jina la vidakuzi vya UTM

source: Name of the affiliate cookie
sw_ke: Jina la vidakuzi shirikishi

source: Name of this user attribute.
sw_ke: Jina la huyu mtumiaji.

source: Value of this user attribute.
sw_ke: Namba ya huyu mtumiaji.

source: The course you are looking for does not start until {date}.
sw_ke: Kozi unayoitafuta inaanza tarehe {date}.

source: The course you are looking for is closed for enrollment as of {date}.
sw_ke: Kozi unayoitafuta usajili umefungwa tangu {tarehe}.

source: and
sw_ke: na

source: Course id not specified
sw_ke: Kitambulisho cha kozi hakijatajwa

source: Invalid course id
sw_ke: Kitambulisho batili cha kozi

source: Course id is invalid
sw_ke: Kitambulisho cha kozi ni batili

source: Could not enroll
sw_ke: Haikuweza kusajili

source: You are not enrolled in this course
sw_ke: Hujasajiliwa kwenye kozi hii

source: Your certificate prevents you from unenrolling from this course
sw_ke: "Hati" yako inakuzuia kutangua usajili wako katika kozi hii

source: Enrollment action is invalid
sw_ke: Kitendo cha kujisajili ni batili

source: In order to sign in, you need to activate your account.<br /><br />We just sent an activation link to <strong>{email}</strong>. If you do not receive an email, check your spam folders or <a href="{support_url}">contact {platform} Support</a>.
sw_ke: Ili kuingia mtandaoni, unahitaji kuamsha akaunti yako.<br /><br />Tumetuma kiungo-wavuti cha kuamsha akaunti yako kwenye <strong>{email}</strong>. Kama hupokei barua pepe, angalia jalada lako la barua taka au <a href="{support_url}">wasiliana na {platform} Msaada</a>.

source: You've successfully logged into your {provider_name} account, but this account isn't linked with an {platform_name} account yet.
sw_ke: Umefaulu kuingia kwenye {provider_name} akaunti yako, lakini akaunti hii badohaijaunganishwa na akaunti {platform_name}.

source: Use your {platform_name} username and password to log into {platform_name} below, and then link your {platform_name} account with {provider_name} from your dashboard.
sw_ke: Tumia {platform_name} jinatumishi lako na nywila kuingia mtandaoni {platform_name} hapo chini, kisha unganisha akaunti yako {platform_name} na {provider_name} kutoka kwa dashibodi yako.

source: If you don't have an {platform_name} account yet, click <strong>Register</strong> at the top of the page.
sw_ke: Kama bado huna akaunti ya {platform_name}, bonyeza<strong>Andkisha</strong> juu katika ukurasa.

source: There was an error receiving your login information. Please email us.
sw_ke: Kulikuwa na hitilafu kupokea taarifa ya kuingia kwako mtandaoni. Tafadhali tutumie barua pepe.

source: This account has been temporarily locked due to excessive login failures. Try again later.
sw_ke: Akaunti hii imefungwa kwa muda kwasababu ya kutofaulu majaribio mengi ya kuingia mtandaoni. Jaribu tena baadae.

source: Your password has expired due to password policy on this account. You must reset your password before you can log in again. Please click the "Forgot Password" link on this page to reset your password before logging in again.
sw_ke: Nywila yako imemaliza muda kwa sababu ya kanuni za nywila katika akaunti hii. Lazima uiunde upya kabla ya kuingia tena mtandaoni. Tafadhali bonyeza kiungo cha "Nimesahau Nywila" katika ukurasa kuipa kuiunda upya nywila yako kabla ya kuingia tena mtandaoni.

source: Too many failed login attempts. Try again later.
sw_ke: Majaribio mengi ya kuingia mtandaoni hayakufaulu. Tafadhali jaribu tena baadae.

source: Email or password is incorrect.
sw_ke: Barua pepe au nywila si sahihi.

source: Please enter a username
sw_ke: Tafadhali ingiza jina la mtumiaji

source: Please choose an option
sw_ke: Tafadhali chagua kipengele

source: User with username {} does not exist
sw_ke: Mtumiaji mwenye jina la mtumiaji {} hayupo

source: Successfully disabled {}'s account
sw_ke: Akaunti ya {} imefanikiwa kulemazwa

source: Successfully reenabled {}'s account
sw_ke: Akaunti ya {} imefanikiwa kuwezeshwa upya

source: Unexpected account status
sw_ke: Hali isiyo tarajiwa ya akaunti

source: An account with the Public Username '{username}' already exists.
sw_ke: Akaunti yenye Jina la Mtumiaji {username} tayari ipo.

source: An account with the Email '{email}' already exists.
sw_ke: Akaunti yenye anwani ya barua pepe '{email}' tayari ipo.

source: Registration using {provider} has timed out.
sw_ke: Usajili kwa kutumia {provider} umepitwa na muda.

source: An access_token is required when passing value ({}) for provider.
sw_ke: Alama_ya kukuwezesha kuingia mtandaoni inahitajika wakati wa kupitisha tathmini ({})kwa mtoaji.

source: The provided access_token is already associated with another user.
sw_ke: Alama_ya kuingia mtandaoni iliyoteolwa tayari inahusishwa na mtumiaji mwengine.

source: The provided access_token is not valid.
sw_ke: Alama_ya kuingia mtandaoni iliyotolewa ni batili.

source: Account creation not allowed.
sw_ke: Utengenezaji wa akaunti hauruhusiwi.

source: You are re-using a password that you have used recently. You must have {num} distinct password before reusing a previous password.
sw_ke: Unatumia upya nywila ambayo umetumia karibuni. Lazima uwe na {num} ya nywila tafautitafauti kabla kutumia upya nwyila ya mbeleni.

source: You are resetting passwords too frequently. Due to security policies, {num} day must elapse between password resets.
sw_ke: Unabadilisha nywila haraka sana. Kulingana na kanuni za usalama, {num} siku lazima zimalizike baina ya uwekaji wa nywila moja hadi nyengine.

source: Password reset unsuccessful
sw_ke: Uwekaji upya wa nywila haukufaulu

source: Error in resetting your password. Please try again.
sw_ke: Hitilafu katika kurekebisha nenosiri lako. Tafadhali jaribu tena.

source: No inactive user with this e-mail exists
sw_ke: Hakuna mtumiaji asiye hai mwenye hii "barua pepe" anayeonekana

source: Unable to send reactivation email
sw_ke: Imeshindikana kutuma "barua pepe" ya kuwezesha tena

source: Valid e-mail address required.
sw_ke: Anwani ya barua pepe halali inahitajika.

source: Old email is the same as the new email.
sw_ke: Barua pepe ya zamani ni sawa na "barua pepe" mpya.

source: An account with this e-mail already exists.
sw_ke: "Akaunti" yenye barua pepe hii tayari ipo.

source: Unable to send email activation link. Please try again later.
sw_ke: Haikuweza kutuma kiungo-wavuti cha kuamsha barua pepe. Tafadhali jaribu tena baadae.

source: Authentication with {} is currently unavailable.
sw_ke: Uthibitisho wa {} kwa sasa hivi haupatikani.

source: Secondary providers are displayed less prominently, in a separate list of "Institution" login providers.
sw_ke: Watowaji wa pili wanaonyeshwa sio kwa umaarufu sana, kwenye orodha kando ya "Taasisi" kuingia kwa watowaji.

source: The Site that this provider configuration belongs to.
sw_ke: Tovuti ambayo mgavi wa usanidi huu anaimiliki.

source: If this option is enabled, users that visit a "TPA hinted" URL for this provider (e.g. a URL ending with `?tpa_hint=[provider_name]`) will be forwarded directly to the login URL of the provider instead of being first prompted with a login dialog.
sw_ke: Kama kipengele hiki kinafanya kazi, watumiaji wanaotembelea anwani ya tovuti yenye kipengele cha "TPA " chenye kuonesha mtumiaji huyu ( mfano. anwani inaishia na `?tpa_hint=[provider_name]`) kitatumwa moja kwa moja kwenye anwani ya kuingia mtandaoni ya mtumiaji badala ya kutumwa hatua za kuingia mtandaoni kwanza.

source: If this option is enabled, users will not be asked to confirm their details (name, email, etc.) during the registration process. Only select this option for trusted providers that are known to provide accurate user information.
sw_ke: Hiari hii ikiwezeshwa, watumiaji hawataulizwa kuthibitisha tondoti zao (jina, anwani za barua pepe, n.k.) wakati wa harakati za uandikishaji. Chagua hiari hii kwa watowaji wakuaminika wanaojulikana kutoa taarifa za watumiaji kisawa sawa.

source: If this option is selected, users will not be required to confirm their email, and their account will be activated immediately upon registration.
sw_ke: Kama hiari hii imechaguliwa, watumiaji hawatahitajika kuthibitisha anwani za barua pepe zao, na akaunti zao zitaamshwa haraka sana pindi wanapojiandikisha.

source: If this option is not selected, users will not be presented with the provider as an option to authenticate with on the login screen, but manual authentication using the correct link is still possible.
sw_ke: Kama chaguo hili litaachwa, watumiaji hawataweza kuchagua nani anaweza kuingia kwenye skirini ya kuingilia, lakini bado wataweza kuruhusiwa kwa kutumia kiungo sahihi moja kwa moja.

source: Whether to drop an existing session when accessing a view decorated with third_party_auth.decorators.tpa_hint_ends_existing_session when a tpa_hint URL query parameter mapping to this provider is included in the request.
sw_ke: Ikiwa ni kuachia kipindi kilichopo wakati wa kupata mwonekano unao onekana hivi third_party_auth.decorators.tpa_hint_ends_existing_session endapo suala la kigezo cha upangaji wa a tpa_hint URL wa mtoaji huyu amejumuishwa kwenye ombi.

source: If this option is set, then users logging in using this SSO provider will have their session length limited to no longer than this value. If set to 0 (zero), the session will expire upon the user closing their browser. If left blank, the Django platform session default length will be used.
sw_ke: Kama kipengele hiki kimetegeshwa, hivyo watumiaji wanaiongia mtandaoni kutumia SSO mtoaji ataongezewa muda wa kipindi usiozidi thamani hii. Kama imetegeshwa kwenye 0 (sifuri), muda wa kipindi utaisha wakati mtumiaji anapofunga kivinjari chake. Kama ikiwachwa wazi, muda wa wa ukomo wa jukwaa la Django utatumika.

source: The Site that this SAML configuration belongs to.
sw_ke: Tovuti ambayo inamiliki usanidi huu wa SAML.

source: Please wait
sw_ke: Tafadhali subiri

source: TIME_FORMAT
sw_ke: MFUMO_WAKATI

# am/pm indicator
source: AM
sw_ke: ASUBUHI

# am/pm indicator
source: PM
sw_ke: "MCHANA"

# weekday name
source: Monday
sw_ke: Jumatatu

# weekday name
source: Tuesday
sw_ke: Jumanne

# weekday name
source: Wednesday
sw_ke: Jumatano

# weekday name
source: Thursday
sw_ke: Alhamisi

# weekday name
source: Friday
sw_ke: Ijumaa

# weekday name
source: Saturday
sw_ke: Jumamosi

# weekday name
source: Sunday
sw_ke: Jumapili

# abbreviated weekday name
source: Mon
sw_ke: Jumatatu

# abbreviated weekday name
source: Tue
sw_ke: Jumanne

# abbreviated weekday name
source: Wed
sw_ke: Jumatano

# abbreviated weekday name
source: Thu
sw_ke: Alhamisi

# abbreviated weekday name
source: Fri
sw_ke: Ijumaa

# abbreviated weekday name
source: Sat
sw_ke: Jumamosi

# abbreviated weekday name
source: Sun
sw_ke: Jumapili

# abbreviated month name
source: Jan
sw_ke: Januari

# abbreviated month name
source: Feb
sw_ke: Februari

# abbreviated month name
source: Mar
sw_ke: Machi

# abbreviated month name
source: Apr
sw_ke: Aprili

# abbreviated month name
source: May
sw_ke: Mei

# abbreviated month name
source: Jun
sw_ke: Juni

# abbreviated month name
source: Jul
sw_ke: Julai

# abbreviated month name
source: Aug
sw_ke: Agosti

# abbreviated month name
source: Sep
sw_ke: Septemba

# abbreviated month name
source: Oct
sw_ke: Oktoba

# abbreviated month name
source: Nov
sw_ke: Novemba

# abbreviated month name
source: Dec
sw_ke: Disemba

# month name
source: January
sw_ke: Januari

# month name
source: February
sw_ke: Februari

# month name
source: March
sw_ke: Machi

# month name
source: April
sw_ke: Aprili

# month name
source: May
sw_ke: Mei

# month name
source: June
sw_ke: Juni

# month name
source: July
sw_ke: Julai

# month name
source: August
sw_ke: Agosti

# month name
source: September
sw_ke: Septemba

# month name
source: October
sw_ke: Oktoba

# month name
source: November
sw_ke: Novemba

# month name
source: December
sw_ke: Disemba

source: The file must end with the extension '{file_types}'.
sw_ke: Faili lazima imalizikie na uongezi / urefushaji '{file_types}.'

source: Maximum upload file size is {file_size} bytes.
sw_ke: Kiwango cha juu cha upakiaji wa faili ni {file_size} baiti.

source: Course {course_id} requires {prerequisite_course_id}
sw_ke: Kozi {course_id} inahitaji {prerequisite_course_id}

source: System defined milestone
sw_ke: Mpango umefasiri wazi wazi jiwe la maili

source: Invalid Length ({0})
sw_ke: Urefu Usio Halali ({0})

source: must be {0} characters or more
sw_ke: lazima ziwe herufi {0} au zaidi
