Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: If you haven't verified your identity yet, please start the verification process ({verification_url}).
sw_ke: Kama bado huja thibitisha kitambulisho chako, tafadhali anza matayarisho ya uthibitishaji ({verification_url}).

source: You can unenroll in the course and receive a full refund for 2 days after the course start date.
sw_ke: Unaweza kutengua usajili wako katika kozi na upokee malipo yako kamili ndani ya siku 2 baada ya tarehe ya kuanza kozi.

source: Could not find a course with the ID '{course_id}'
sw_ke: Haikuweza kupata kozi kwa Kitambulisho hiki '{course_id}'

source: Donation for {course}
sw_ke: Mchango kwa ajili ya {course}

source: Donation for {platform_name}
sw_ke: Mchango kwa {platform_name}

source: Page {page_number} of {page_count}
sw_ke: Ukurasa {page_number} ya {page_count}

source: Invoice
sw_ke: Ankara

source: Order
sw_ke: Mpangilio / Amri / Kutaka huduma

source: Date: {date}
sw_ke: Tarehe: {tarehe}

source: Quantity
sw_ke: Idadi

source: List Price per item
sw_ke: Orodha ya Bei kwa kila bidhaa

source: Discount per item
sw_ke: Aheri kwa kila bidhaa

source: Amount
sw_ke: Kima

source: Total
sw_ke: Jumla

source: Payment Received
sw_ke: Malipo yaliyo pokelewa

source: Balance
sw_ke: Baki

source: Billing Address
sw_ke: Mahali deni litakapotumwa

source: Disclaimer
sw_ke: Onyo

source: TERMS AND CONDITIONS
sw_ke: SHERIA NA MASHARTI

source: The payment processor did not return a required parameter: {0}
sw_ke: Utayarishaji wa malipo hauku rudisha parameta ihitajikayo: {0}

source: The payment processor returned a badly-typed value {0} for param {1}.
sw_ke: Utayarishaji wa malipo ulirudisha tathmini iliyo andikwa vibaya {0} ya parameta {1}.

source: The payment processor accepted an order whose number is not in our system.
sw_ke: Utayarishaji malipo ulikubali uagizaji ambao nambari yake haipo kwenye mfumo wetu.

source: The amount charged by the processor {0} {1} is different than the total cost of the order {2} {3}.
sw_ke: Kila kilicho tozwa na utayarishaji {0} {1} ni tafauti kuliko jumla ya gharama ya uagizaji {2} {3}.

source: Successful transaction.
sw_ke: Maendeshaji ya shughuli yamefaulu.

source: The request is missing one or more required fields.
sw_ke: Ombi linakosa moja au zaidi ya viwanja vinavyohitajika.

source: One or more fields in the request contains invalid data.
sw_ke: Moja au zaidi ya viwanja katika maombi ina takwimu batili.

source: The issuing bank has questions about the request. Possible fix: retry with another form of payment
sw_ke: Benki inayotoa ina masuali kuhusu maombi. Hatua iwezekanayo: jaribu upya na mfumo mwengine wa malipo

source: Insufficient funds in the account. Possible fix: retry with another form of payment
sw_ke: Hakuna pesa zakutosha kwenye akaunti. Uerkebishi uwezekanao: jaribu na mfumo mwengine wa malipo

source: Unknown reason
sw_ke: Sababu Isiyojulikana

source: Issuing bank unavailable. Possible fix: retry again after a few minutes
sw_ke: Benki ya kutoa haipo. Urekebishi uwezekanao: jaribu upya tena baada ya dakika chache

source: The card has reached the credit limit. Possible fix: retry with another form of payment
sw_ke: Kadi imefikisha kiwango cha mwisho wa kukopa. Urekebishi Uwezekanao: jaribu upya na mfumo mwengine wa malipo

source: Invalid card verification number. Possible fix: retry with another form of payment
sw_ke: Nambari ya uthibitishaji batili wa kadi. Urekebishaji uwezekanao: jaribu upya na mfumo mwengine wa malipo

source: Invalid account number. Possible fix: retry with another form of payment
sw_ke: Nambari ya akaunti batili: Urekeshaji Uwezekanao: jaribu upya mfumo mwengine wa malipo

source: The requested amount exceeds the originally authorized amount.
sw_ke: KIma kilicho ombwa kimepita kiwango asili kilicho idhinishwa.

source: Processor Failure. Possible fix: retry the payment
sw_ke: Kutofaulu kwa Mtayarishi. Urekebishaji Uwezekanao: jaribu upya malipo

source: The authorization has already been captured
sw_ke: Uidhinishaji tayari umenaswa

source: The request ID is invalid.
sw_ke: Kitambulisho kilichoombwa sio halali.

source: You requested a credit for a capture that was previously voided
sw_ke: Uliomba mkopo kwa mnaso ambao ulibatilishwa mbeleni

source: UNKNOWN REASON
sw_ke: SABABU ISIOJULIKANA

source: The payment processor did not return a required parameter: {parameter}
sw_ke: Mtayarishaji wa malipo hakurudisha paramita inayohitajika: {parameter}

source: Only a partial amount was approved.
sw_ke: Ni baadhi ya kima kilicho idhinishwa.

source: General system failure.
sw_ke: Kutofaulu kwa mpangilio wote.

source: The request was received, but a service did not finish running in time.
sw_ke: Ombi lilipokelewa, lakini huduma haikumaliza kuendelea kwa wakati.

source: Insufficient funds in the account. Possible action: retry with another form of payment.
sw_ke: Pesa hazitoshi katika akaunti. Hatua iwezekanayo: jaribu upya kwa mfumo wa malipo mwengine.

source: Stolen or lost card.
sw_ke: Kadi imeibiwa au imepotea.

source: Issuing bank unavailable. Possible action: retry again after a few minutes.
sw_ke: Benki inayotoa haipo. Hatua iwezekanayo: jaribu upya baada ya dakika chache.

source: CVN did not match.
sw_ke: CVN haijalingana.

source: The card has reached the credit limit. Possible action: retry with another form of payment.
sw_ke: Kadi imefikia kiwango cha mwisho wa kukopa. Hatua IWezekanayo: jaribu upya kwa mfumo mwengine wa malipo.

source: Invalid card verification number (CVN). Possible action: retry with another form of payment.
sw_ke: Nambari batili ya uthibitisho wa kadi(CVN). Hatua Iwezekanayo: jaribu upya kwa mfumo mwengine wa malipo.

source: Account frozen. Possible action: retry with another form of payment.
sw_ke: Akaunti imelemazwa: Hatua Iwezekanayo: jaribu upya kwa mfumo mwengine wa malipo.

source: Invalid account number. Possible action: retry with another form of payment.
sw_ke: Nambari ya Akaunti ni batili. Hatua Iwezekanayo: jaribu upya kwa mfumo mwengine wa malipo.

source: The card type is not accepted by the payment processor. Possible action: retry with another form of payment.
sw_ke: Aina ya kadi haikubaliwi na mtayarishaji malipo. Unachoweza kufanya: jaribu upya kwa kutumia mfumo mwingine wa malipo.

source: General decline by the processor. Possible action: retry with another form of payment.
sw_ke: General decline by the processor. Unachoweza kufanya: jaribu upya kwa kutumia mfumo mwingine wa malipo.

source: There is a problem with the information in your CyberSource account. Please let us know at {0}
sw_ke: Kuna tatizo na taarifa katika akaunti ya chanzo cha cybre yako. Tafadhali tujulishe kupitia {0}

source: The requested capture amount exceeds the originally authorized amount.
sw_ke: Kma kilicho ombwa kilicho naswa kimezidi kima kilicho idhinishwa asili.

source: Processor Failure. Possible action: retry the payment
sw_ke: Kutofaulu kwa Mtayarishi: Unachoweza kufanya: jaribu upya kufanya malipo

source: The authorization has already been reversed.
sw_ke: Uidhinishaji tayari umetenguliwa.

source: The authorization has already been captured.
sw_ke: Uidhinishaji tayari umenaswa.

source: The card type sent is invalid or does not correlate with the credit card number. Possible action: retry with the same card or another form of payment.
sw_ke: Aina ya kadi uliyotuma ni batili au hailinganiana na namba ya kadi ya mkopo. Unachoweza kufanya: jaribu tena kwa kutumia kadi ileile au fomu nyingine ya malipo.

source: You requested a credit for a capture that was previously voided.
sw_ke: Uliomba mkopo kwa unasaji ambao mbeleni ulikaliwa.

source: The request was received, but there was a timeout at the payment processor.
sw_ke: Ombi lilipokelewa, lakini kulikuwa na mwisho wa wakati kwa utayarishaji wa malipo.

source: Stand-alone credits are not allowed.
sw_ke: Mikopo wa simama-pekeyako hairuhusiwi.

source: The cardholder is enrolled for payer authentication
sw_ke: Mmiliki wa kadi amesajiliwa kwa usawawizishi wa mlipaji

source: Payer authentication could not be authenticated
sw_ke: Usawazishi wa mlipaji haukuweza kusawazishwa

source: The authorization request was approved by the issuing bank but declined by CyberSource based on your legacy Smart Authorization settings. Possible action: retry with a different form of payment.
sw_ke: Ombi la uidhinishaji lilikubaliwa na benk husika lakini lilikataliwa na Chanzo cha Mawasiliano ya Mtandao kulingana na Utaratibu wa Mitegesho yako ya Uidhinishaji. Unachoweza kufanya: jaribu tena kwa kutumia fomu nyingine ya malipo.

source: Order Number
sw_ke: Nambari ya Uagizaji

source: Customer Name
sw_ke: Jina la Mteja

source: Date of Original Transaction
sw_ke: Tarehe ya Muamala Asili

source: Date of Refund
sw_ke: Tarehe ya Marejesho ya fedha

source: Amount of Refund
sw_ke: Kima cha Malipo ya Marejesho

source: Service Fees (if any)
sw_ke: Malipo ya Huduma (kama wapo)

source: Purchase Time
sw_ke: Wakati wa Ununuzi

source: Order ID
sw_ke: Agiza 'Kitambulisho'

source: Unit Cost
sw_ke: Gharama ya Kitu kimoja

source: Total Cost
sw_ke: Jumla ya Gharama

source: Currency
sw_ke: Sarafu

source: Comments
sw_ke: Maoni

source: University
sw_ke: Chuo kikuu

source: Course Announce Date
sw_ke: Tarehe ya Kutangaza Kozi

source: Course Start Date
sw_ke: Tarehe ya Kuanza Kozi

source: Course Registration Close Date
sw_ke: Tarehe ya Kufunga Usajili wa Kozi

source: Course Registration Period
sw_ke: Kipindi cha Usajili wa Kozi

source: Total Enrolled
sw_ke: Jumla ya Waliosajiliwa

source: Audit Enrollment
sw_ke: Kagua Usajili

source: Honor Code Enrollment
sw_ke: Kificho cha Heshima cha Usajili

source: Verified Enrollment
sw_ke: 'Hakiki' Usajili

source: Gross Revenue
sw_ke: Mapato Kamili

source: Gross Revenue over the Minimum
sw_ke: Mapato Kamili juu ya Kidogo kabisa

source: Number of Verified Students Contributing More than the Minimum
sw_ke: Idadi ya Wanafunzi Waliothibitishwa Kuchangia zaidi kuliko Idadi ya chini kabisa

source: Number of Refunds
sw_ke: Idadi ya Malipo ya Marejesho

source: Dollars Refunded
sw_ke: Dola zilizolipwa kwa Marejesho

source: Number of Transactions
sw_ke: Idadi ya Miamala

source: Total Payments Collected
sw_ke: Jumla ya Malipo Yaliyokusanywa

source: Number of Successful Refunds
sw_ke: Idadi ya Marejesho ya fedha Yaliyofaulu

source: Total Amount of Refunds
sw_ke: Jumla ya kima cha Marejesho ya fedha

source: You must be logged-in to add to a shopping cart
sw_ke: Lazima uingie mtandaoni kuongezwa kwa gari la kufanya ununzi

source: The course you requested does not exist.
sw_ke: Kozi uliyoomba haipo.

source: The course {course_id} is already in your cart.
sw_ke: Kozi {course_id} tayari kwenye kapu lako.

source: You are already registered in course {course_id}.
sw_ke: Tayari umesajiliwa katika kozi {course_id}.

source: Course added to cart.
sw_ke: Kozi iliyoongezwa kwenye kapu la kozi.

source: Discount does not exist against code '{code}'.
sw_ke: Punguzo la bei halipo dhidi ya namba '{code}'.

source: This enrollment code ({enrollment_code}) is no longer valid.
sw_ke: Namba hii ya usajili ({enrollment_code}) sio halali tena.

source: This enrollment code ({enrollment_code}) is not valid.
sw_ke: Namba hii ya usajili ({enrollment_code}) sio halali.

source: Code '{registration_code}' is not valid for any course in the shopping cart.
sw_ke: Kificho '{registration_code}' sio halali kwa kozi yoyote kwenye kapu la ununuzi wa kozi.

source: Cart item quantity should not be greater than 1 when applying activation code
sw_ke: Idadi ya bidhaa za garini haistahili kuwa zaidi ya 1 kificho cha kuamsha kikitumika

source: Only one coupon redemption is allowed against an order
sw_ke: Ukumboaji wa kuponi moja tu unaruhusiwa dhidi ya uagizaji mmoja

source: success
sw_ke: Mafanikio

source: You do not have permission to view this page.
sw_ke: Huna ruhusa kutizama ukurasa huu.

source: No email address provided.
sw_ke: Hakuna anwani ya barua pepe iliyotolewa.

source: Continue
sw_ke: Endelea

source: View and regenerate certificates.
sw_ke: Tizama na uzalishe upya vyeti.

source: Manual Refund
sw_ke: Malipo ya fedha kwa Mkono

source: Track refunds issued directly through CyberSource.
sw_ke: Fuatilia marejesho ya fedha yaliyotolewa moja kwa moja kupitia CyberAsili.

source: Enrollment
sw_ke: Usajili

source: View and update learner enrollments.
sw_ke: Tizama na usasishe usajili wa mwanafunzi.

source: Email Address
sw_ke: Anwani Barua pepe

source: Course ID
sw_ke: Kitambulisho cha Kozi

source: User not found
sw_ke: Mtumiaji hapatikani

source: Course {course_id} not past the refund window.
sw_ke: Kozi {course_id} haikupita dirisha la marejesho ya malipo.

source: No order found for {user} in course {course_id}
sw_ke: Hakuna uagizaji uliopatikana kwa {user} katika kozi {course_id}

source: Unenrolled {user} from {course_id}
sw_ke: Usajili uliotenguliwa {user} kutoka kwa {course_id}

source: Refunded {cost} for order id {order_id}
sw_ke: Malipo ya ridhaa {cost} kwa kitambulisho cha uagizaji {oredr_id}

source: Optional language the team uses as ISO 639-1 code.
sw_ke: Lugha ya Hiari kikosi hutumia kama kificho cha ISO 639-1.

source: Teams
sw_ke: Timu

source: The supplied course id {course_id} is not valid.
sw_ke: Kitambulisho cha kozi kilichotolewa {course_id} sio halali.

source: course_id must be provided
sw_ke: Namba ya kozi lazima itolewe

source: text_search and order_by cannot be provided together
sw_ke: Utafutaji_ujumbe na kwa_uagizaji haviwezi kutolewa pamoja

source: The supplied topic id {topic_id} is not valid
sw_ke: Namba ya utambulisho wa mada {topic_id} sio sahihi

source: Error connecting to elasticsearch
sw_ke: Hitalfu kuunganisha kwa utafiti wa mnyumbuo

source: The ordering {ordering} is not supported
sw_ke: Uangizaji {ordering} hauungwi mkono

source: The supplied course_id {course_id} is not valid.
sw_ke: Kitambulisho cha kozi kilichotolewa {course_id} sio halali.

source: You are already in a team in this course.
sw_ke: Tayari uko kwenye darasa la hii kozi.

source: username or team_id must be specified.
sw_ke: jina la mtumiaji au timu_lazima lidhihirishwe.

source: Username is required.
sw_ke: Jina la mtumiaji linahitajika.

source: Team id is required.
sw_ke: Namba ya utambulisho wa timu inahitajika.

source: This team is already full.
sw_ke: Timu hili limejaa.

source: The user {username} is already a member of a team in this course.
sw_ke: Mtumiaji {username} tayari ni mwanafunzi wa hii kozi.

source: The user {username} is not enrolled in the course associated with this team.
sw_ke: Mtumiaji {username} hajasajiliwa katika kozi inayohusika na hili darasa.

source: Your {platform_name} verification has expired.
sw_ke: Uthibitishaji wako umekwisha muda 'wake' {platform_name}.

source: The course for which this deadline applies
sw_ke: Tarehe hii ya mwisho inahusu hii kozi

source: The datetime after which users are no longer allowed to submit photos for verification.
sw_ke: Tarehe na muda ambao watumiaji hawaruhusiwi kufikisha picha zao kwa uthibitisho baada yake.

source: Intro
sw_ke: Utangulizi

source: Make payment
sw_ke: Fanya malipo

source: Payment confirmation
sw_ke: Uthibitisho wa malipo

source: Take photo
sw_ke: Piga picha

source: Take a photo of your ID
sw_ke: Piga picha ya Kitambulisho chako

source: Review your info
sw_ke: Pitia taarifa zako

source: Enrollment confirmation
sw_ke: Uhakikishaji wa Usajili

source: Selected price is not valid number.
sw_ke: Bei iliyochaguliwa sio namba sahihi.

source: This course doesn't support paid certificates
sw_ke: Kozi hii haijawezeshwa kutoa vyeti vilivyolipiwa

source: No selected price or selected price is below minimum.
sw_ke: Hakuna bei zilizo chaguliwa au bei iliochaguliwa chini zaidi ya bei ya mwisho chini.

source: Photo ID image is required if the user does not have an initial verification attempt.
sw_ke: Taswira ya KItambulisho cha picha inahitajika kama mtumiaji hana jaribio la kwanza la uthibitishaji.

source: Missing required parameter face_image
sw_ke: Picha ndogo zinazotakiwa zimekosekana

source: Invalid course key
sw_ke: Namba ya kozi sio sahihi

source: No profile found for user
sw_ke: Hakuna wasifu wa mtumiaji

source: Name must be at least {min_length} characters long.
sw_ke: Jina lazima liwe japo na urefu wa herufi {min_length}.

source: Image data is not valid.
sw_ke: Taarifa za taswira sio sahihi.

source: Verification photos received
sw_ke: Picha za kuthibitisha zimepokelewa

source: Audit
sw_ke: Ukaguzi

source: Like {platform_name} on Facebook
sw_ke: Penda {platform_name} kwenye Facebook

source: Follow {platform_name} on Twitter
sw_ke: Fuata kwenye {platform_name} Twitter

source: Follow {platform_name} on LinkedIn
sw_ke: Fuata {platform_name} kwenye Linkedln

source: Follow {platform_name} on Google+
sw_ke: Fuata {platform_name} kwenye Google+

source: Meetup
sw_ke: Kutanisha

source: Subscribe to the {platform_name} subreddit
sw_ke: Andikisha kwa {platform_name} subreddit

source: Subscribe to the {platform_name} YouTube channel
sw_ke: Andikisha kwa {platform_name} channel ya YouTube

source: Welcome to {platform_name}.
sw_ke: Karibu kwenye {platform_name}.

source: Signed Out
sw_ke: Alitoka Mtandaoni

source: You have signed out.
sw_ke: Umetoka mtandaoni.

source: If you are not redirected within 5 seconds, <a href="%(target)s">click here to go to the home page</a>.
sw_ke: Kama hujaelekezwa upya ndani ya sekunde 5, <a href="%(target)s">bofya hapa kurudi kwenye ukurasa wa nyumbani</a>.

source: Skip to main content
sw_ke: Ruka mpaka kwenye 'mada' kuu

source: Authorize
sw_ke: Idhinisha

source: The above application requests the following permissions from your account:
sw_ke: Dhumuni la ombi la hapo juu ni kupata ruhusa zifuatazo kutoka kwenye akaunti yako:

source: Please click the 'Allow' button to grant these permissions to the above application. Otherwise, to withhold these permissions, please click the 'Cancel' button.
sw_ke: Tafadhali bofya kitufe cha 'Allow' kutoa ruhusa hizi kwa ombi la hapo juu. Vinginevyo, kukataa kutoa ruhusa hizi, tafadhali bofya kitufe cha 'Cancel'.

source: Cancel
sw_ke: Batilisha

source: Allow
sw_ke: Ruhusu

source: Error
sw_ke: Hitilafu

source: Please go to the following page and choose a new password:
sw_ke: Tafadhali nenda kwenye ukurasa ufuatao na uchague nywila mpya:

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
sw_ke: Kama huku omba mabadiliko haya, unaweza kupuuza barua pepe hii - bado hatuja weka upya nywila yako.

source: Thanks for using our site!
sw_ke: Asante kwa kutumia mtandao wetu!

source: The %(platform_name)s Team
sw_ke: Kikosi %(platform_name)s

source: Last modified:
sw_ke: Mwisho Kuboreshwa:

source: See all children
sw_ke: Ona watoto wote

source: This article was last modified:
sw_ke: Makala haya yaliboreshwa mara ya mwisho:

source: Add new article
sw_ke: Ongeza 'makala' mpya

source: Create article
sw_ke: Tengeneza makala

source: Go back
sw_ke: Rudi Nyuma

source: Delete article
sw_ke: Futa makala

source: Delete
sw_ke: Futa

source: You cannot delete a root article.
sw_ke: Huwezi 'kufuta' shina la makala.

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
sw_ke: Huwezi kufuta makala haya kwa sababu huna ruhusa kufuta makala na watoto. Jaribu kuondoa watoto kwa mkono mmoja baada ya mwengine.

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
sw_ke: Unafuta makala. Hii inamaanisha watoto wake watafutwa pia. Kama unachagua kusafisha, watoto pia watasafishwa!

source: Articles that will be deleted
sw_ke: Makala ambazo zitafutwa

source: ...and more!
sw_ke: ...na zaidi!

source: You are deleting an article. Please confirm.
sw_ke: Unafuta makala. Tafadhali thibitisha.

source: Edit
sw_ke: 'Hariri'

source: Save changes
sw_ke: 'Hifadhi' mabadiliko

source: Preview
sw_ke: 'Pitia kabla'

source: Close
sw_ke: Funga

source: Wiki Preview
sw_ke: Pitia 'Wiki'

source: window open
sw_ke: dirisha likowazi

source: Back to editor
sw_ke: Rudi kwa Mhariri

source: History
sw_ke: Kumbukumbu

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
sw_ke: Bonyeza kila marudio kuona orodha ya mstari ilio haririwa. Bonyeza kifungo cha mtazamo kabla kuona makala yanaoneka vipi kufikia kiwango hiki. Chini kwenye ukurasa huu, unaweza kubadilisha marudio fulani au kulinganisha na marudio ya kitambo kwa marudio ya sasa.

source: Preview this revision
sw_ke: Pitia haya 'marudio'

source: Auto log:
sw_ke: Log kiwenyewe:

source: Change
sw_ke: Badilisha

source: Merge selected with current...
sw_ke: Ulinganishi uliochaguliwa na wa sasa...

source: Switch to selected version
sw_ke: Hama kuchagua toleo

source: Wiki Revision Preview
sw_ke: Mtazamo Kabla wa Marudio ya Wiki

source: Back to history view
sw_ke: Rudi kwenye 'kuangalia' kumbukumbu

source: Switch to this version
sw_ke: Tumia toleo 'hili'

source: Merge Revision
sw_ke: Unganisha 'Marudio'

source: Merge with current
sw_ke: 'Unganisha' na ya sasa

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
sw_ke: UKiweka sambamba marudio na ya sasa, takwimu zote zitadhibitiwa kutoka kwa toleo zote mbili na ziwekwe sambamba kwa eneo lake kutoka kwa kila marudio.

source: After this, it's important to do a manual review.
sw_ke: Baada ya hii, ni muhimu kupitia muongozo.

source: Create new merged version
sw_ke: Buni toleo jipya

source: You need to log in or sign up to use this function.
sw_ke: Unahitaji kuingia mtandaoni au kuijiunga kutumia kazi hii.

source: Wiki Cheatsheet
sw_ke: Karatasi ya Kudanganya ya Wiki

source: Wiki Syntax Help
sw_ke: Usaidizi wa Syntax Wiki

source: This wiki uses <strong>Markdown</strong> for styling. There are several useful guides online. See any of the links below for in-depth details:
sw_ke: Wiki hii inatumia <strong>Alamachini</strong>kwa mtindo. Kuna miongozo ya kusaidia tafauti tafauti kwenye mtandao. Angalia uunganishi wowote hapo chini kwa utondoti kamili.

source: Markdown: Basics
sw_ke: Mfumo wa uandishi kwenye wavuti: Hatua za awali

source: Quick Markdown Syntax Guide
sw_ke: Muongozo wa mfumo wa uandishi kwenye wavuti

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
sw_ke: Kubuni makala mapya ya wiki, buni uunganishaji wake. Kubonyeza uunganishaji inakupatia ukurasa wa kubuni.

source: %(platform_name)s Additions:
sw_ke: %(platform_name)s Nyongeza:

source: Math Expression
sw_ke: Maswali ya hisabati

source: Useful examples:
sw_ke: Mifano inayofaa:

source: Huge Header
sw_ke: Kichwa cha habari kwa herufi ndogo

source: Smaller Header
sw_ke: Kichwa cha habari kwa herufi ndogo

source: *emphasis* or _emphasis_
sw_ke: *usistizaji* au _usistizaji_

source: **strong** or __strong__
sw_ke: **enye nguvu** au __enye nguvu__

source: Unordered List
sw_ke: 'Orodha' Ya zisizoagizwa

source: Sub Item 1
sw_ke: Kipengele kidogo 1

source: Sub Item 2
sw_ke: 'Kipengele' kidogo 2

source: Ordered
sw_ke: Iliyoagizwa

source: List
sw_ke: Orodha

source: Quotes
sw_ke: Dondoo

source: Attachments
sw_ke: Viambatisho

source: Upload new file
sw_ke: Pkia faili mpya

source: Search and add file
sw_ke: Tafuta na uongeze faili

source: Upload File
sw_ke: Pakia Faili

source: Upload file
sw_ke: Pakia faili

source: Search files and articles
sw_ke: Tafuta faili na makala
