Repository: EducationalEra/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: sw_ke

source: Practice scores are hidden.
sw_ke: Matokeo ya zoezi yamefichwa.

source: No problem scores in this section
sw_ke: Hakuna matokeo ya swali katika kifungu hiki

source: {course.display_number_with_default} Course Info
sw_ke: {course.display_number_with_default} Taarifa ya Kozi

source: needs attention
sw_ke: inahitaji kutambuliwa

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
sw_ke: Hivi karibuni ulikuwa kwenye {section_link}. Kama umemaliza na hilo/hayo, chagua kifungu kingine upande wa kushoto.

source: Hi {name},
sw_ke: Salamu {name},

source: Hi,
sw_ke: Salamu,

source: Congratulations! You are eligible to receive course credit from {providers} for successfully completing your {platform_name} course! {link_start}Get your credit now.{link_end}
sw_ke: Hongera! Unastahili kupata mkopo wa kozi kutoka kwa {providers} kwa kufaulu kukamilisha kozi {platform_name} yako! {link_start}Pata mkopo wako sasa.{link_end}

source: Congratulations! You are eligible to receive course credit for successfully completing your {platform_name} course! {link_start}Get your credit now.{link_end}
sw_ke: Hongerai! Unastahili kupokea mkopo wa kozi kwa kufaulu kukamilisha kozi {platform_name} yako! {link_start}Pata mkopo sasa.{link_end}

source: Course credit can help you get a jump start on your university degree, finish a degree already started, or fulfill requirements at a different academic institution.
sw_ke: Mkopo wa kozi waweza kukusaidia kuanza masomo yako shahada katika chuo kikuu, kumaliza shahada tayari uliyoanza, au kukidhi mahitaji katika taasisi tafauti ya akademia.

source: To get course credit, simply go to your {link_start}{platform_name} dashboard{link_end} and click the <b>Get Credit</b> button. After you receive your credit, you will also have an official academic transcript at the institution that granted the credit.
sw_ke: Kupata mkopo wa kozi, kwa urahisi nenda kwenye {link_start}{platform_name} dashibodi yako{link_end} na bonyeza <b>kifungo</b>Pata Mkopo. Baada ya kupokea mkopo wako, utapata pia cheti cha matokeo ya taaluma kutoka kwa taasisi iliyokupa mkopo.

source: We hope you enjoyed the course, and we hope to see you in future {platform_name} courses!
sw_ke: Tunatumaini umefurahia kozi, na tunatarajia kukuona katika kozi za {platform_name} zijazo mbeleni!

source: The {platform_name} Team
sw_ke: Timu {platform_name}

source: {link_start}Click here for more information on credit at {platform_name}{link_end}.
sw_ke: {link_start}Bofya hapa kwa habari zaidi kuhusu mkopo kwenye {platform_name}{link_end}.

source: Final course details are being wrapped up at this time. Your final standing will be available shortly.
sw_ke: Taarifa za mwisho za kozi zinakusanywa hivi sasa. Matokeo yako yatapatikana hivi punde.

source: Your final grade:
sw_ke: Daraja lako la mwisho:

source: Grade required for a {cert_name_short}:
sw_ke: Daraja linalohitajikayo kwaajili ya {cert_name_short}:

source: Grade required to pass this course:
sw_ke: Daraja linalohitajika kufuzu kozi hii:

source: Your verified {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}. If you would like a refund on your {cert_name_long}, please contact our billing address {billing_email}
sw_ke: Uthibitishaji wa {cert_name_long} umesitishwa kusubiriwa uhakikisho kuwa utoaji wa {cert_name_short} unaambatana na vikwazo vikali vya MAREKANI dhidi ya Iran, Cuba, Syria and Sudan. Ukiona kama mpango wetu umekutambua wewe kwa makosa kuwa wewe una uhusiano na moja ya hizo nchi, tafadhali tujulishe kwa kuwasiliana na {email}. Kama ungependelea malipo ya ridhaa kwa {cert_name_long}, tafadhali wasiliana na anwani yetu ya kutoa gharama {billing_email}

source: Your {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
sw_ke: Cheti {cert_name_long} kimezuiwa kusubiri uhakikishaji kuwa utoaji wa {cert_name_long} una kubaliana na vikwazo vikali vya MAREKANI dhidi ya Iran, Cuba, Syria na Sudan. Kama unaona mpagilio wetu umekutambua wewe kwa makosa kuwa na uhusiano na moja ya hizo nchi, tafadhali tujulishe kwa kuwasiliana na {email}.

source: Your certificate was not issued because you do not have a current verified identity with {platform_name}.
sw_ke: Cheti chako hakikutolewa kwasababu hujathibitisha utambulisho wako wa sasa kwenye {platform_name}.

source: Verify your identity now.
sw_ke: Thibitisha utambulisho wako sasa.

source: Your {cert_name_short} is Generating
sw_ke: {cert_name_short} chako Kinatayarishwa

source: This link will open the certificate web view
sw_ke: Kiungo-wavuti hiki kitafungua tovuti ya kukuonesha cheti

source: View {cert_name_short}
sw_ke: Angalia {sert_name_short}

source: This link will open/download a PDF document
sw_ke: Kiungo-wavuti hiki kitafungua/pakua waraka wa PDF

source: Download {cert_name_short} (PDF)
sw_ke: Pakua {cert_name_short} (PDF)

source: Download Your {cert_name_short} (PDF)
sw_ke: Pakua {cert_name-short} (PDF) yako

source: This link will open/download a PDF document of your verified {cert_name_long}.
sw_ke: Kiungo-wavuti hiki kitafungua/pakua waraka wa PDF wa {cert_name_long} iliyothibitishwa.

source: Download Your ID Verified {cert_name_short} (PDF)
sw_ke: Pakua Kitambulisho chako Kilichohakikiwa {cert_name_short} (PDF)

source: Complete our course feedback survey
sw_ke: Kamilisha majibu ya utafiti wetu wa kozi

source: Add Certificate to LinkedIn Profile
sw_ke: Weka Cheti kwenye Wasifu wa Linkedln

source: Share on LinkedIn
sw_ke: Chapisha kwenye Linkedln

source: Since we did not have a valid set of verification photos from you when your {cert_name_long} was generated, we could not grant you a verified {cert_name_short}. An honor code {cert_name_short} has been granted instead.
sw_ke: Kwakuwa hatukapata seti halali ya uthibitisho wa picha kutoka kwako wakati {cert_name_long} lako lilipokuwa likitolewa, hatukuweza kukuidhinishia uthibitisho {cert_name_short}. Nembo ya {cert_name_short} imeidhinishwa badala yake.

source: Course details
sw_ke: Taarifa za kozi

source: {course_number} {course_name} Home Page
sw_ke: Ukurasa wa Mwanzo {course_number} {course_name}

source: {course_number} {course_name} Cover Image
sw_ke: Picha ya Wasifu {course_number} {course_name}

source: Enrolled as:
sw_ke: Sajiliwa Kama:

source: Coming Soon
sw_ke: Inakuja Karibuni

source: Ended - {date}
sw_ke: Imeisha - {date}

source: Started - {date}
sw_ke: Imeanza - {date}

source: Starts - {date}
sw_ke: Inaanza - {date}

source: View Archived Course
sw_ke: Tizama Kozi Zilizohifadhiwa

source: I'm taking {course_name} online with edX.org. Check it out!
sw_ke: Ninasoma {course_name} mtandaoni kupitia edX.org. Iangalie!

source: Share on Facebook
sw_ke: Chapisha kwenye Facebook

source: I'm taking {course_name} online with @edxonline. Check it out!
sw_ke: Ninasoma {course_name} mtandaoni kupitia @edxonline. Iangalie!

source: Course options for
sw_ke: Hiari za kozi kwa ajili ya

source: Available Actions
sw_ke: Mambo Yaliyopo

source: Email Settings
sw_ke: Mitegesho ya Barua pepe

source: Related Programs
sw_ke: Programu zinazohusiana

source: Verification not yet complete.
sw_ke: Uthibitisho bado haujakamilika.

source: You only have {days} day left to verify for this course.
sw_ke: Una siku {days} imebaki uthibitishe kozi hii.

source: Almost there!
sw_ke: Umefika!

source: You still need to verify for this course.
sw_ke: Bado unahitaji kuthibitisha kwa ajili ya kozi hii.

source: Verify Now
sw_ke: Thibitisha Sasa

source: You have submitted your verification information.
sw_ke: Umewasilisha taarifa za uhakiki wako.

source: You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
sw_ke: Utaona ujumbe kwenye dashbodi yako baada ya utaratibu wa kuhakiki kukamilika (mara nyingi ndani ya siku 1-2 ).

source: Your current verification will expire soon!
sw_ke: Muda wa uhakiki wako wa sasa utaisha hivi karibuni!

source: You have submitted your reverification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
sw_ke: Umewasilisha taarifa za uhakiki wako. Utaona ujumbe kwenye dashbodi yako baada ya utaratibu wa kuhakiki kukamilika (mara nyingi ndani ya siku 1-2 ).

source: You have successfully verified your ID with edX
sw_ke: Umefanikiwa kuhakiki utambulisho wako kwenye edX

source: Your current verification is effective until {date}.
sw_ke: Uhakiki wako wa sasa utatumika mpaka tarehe {date}.

source: Your current verification will expire soon.
sw_ke: Muda wa uhakiki wako wa sasa utaisha hivi karibuni.

source: Your current verification will expire in {days} days. {start_link}Re-verify your identity now{end_link} using a webcam and a government-issued photo ID.
sw_ke: Muda uliosalia kutumia uhakiki wako wa sasa ni siku {days} . {start_link}Hakiki upya utambulishao wako sasa {end_link} kutumia kamera ya wavuti na kitambulisho cha picha cha serikali.

source: Pursue a {cert_name_long} to highlight the knowledge and skills you gain in this course.
sw_ke: Pata {cert_name_long} kuangazia ujuzi na elimu uliyo pata katika kozi hii.

source: It's official. It's easily shareable. It's a proven motivator to complete the course. {line_break}{link_start}Learn more about the verified {cert_name_long}{link_end}.
sw_ke: Ni rasmi. Ni rahisi kushirikiana. Ni kichochezi kilichothibitishwa kumaliza kozi. {link_break}{link_start}JIfunze mengi kuhusu {cert_name_long}iliothibitishwa{link_end}.

source: Upgrade to Verified
sw_ke: Boresha Uthibitishe

source: You can no longer access this course because payment has not yet been received. You can {contact_link_start}contact the account holder{contact_link_end} to request payment, or you can {unenroll_link_start}unenroll{unenroll_link_end} from this course
sw_ke: Huwezi tena kufikia kozi hii kwa sababu malipo hayajapokelewa. Unaweza {contact_link_start}wasiliana na mwenye akaunti{contact_link_end} kuomba malipo, au unaweza {unenroll_link_start}tengua usajili{unenroll_link_end} kwa kozi hii

source: You have completed this course and are eligible to purchase course credit. Select <strong>Get Credit</strong> to get started.
sw_ke: Umekamilisha kozi hii na unastahili kununua mkopo wa kozi. Chagua <strong>Pata Mkopo</strong> uanze.

source: You are now eligible for credit from {provider}. Congratulations!
sw_ke: Sasa unastahili kupata mkopo kutoka kwa {provider}. Hongera!

source: Get Credit
sw_ke: Pata Mkopo

source: Thank you for your payment. To receive course credit, you must now request credit at the {link_to_provider_site} website. Select <b>Request Credit</b> to get started.
sw_ke: Asante kwa malipo yako. Kupata mkopo wa kozi, lazima sasa uombe mkopo kwa {link_to_provider_site} tovuti. Chagua <b>Omba Mkopo</b> uanze.

source: Request Credit
sw_ke: Omba Mkopo

source: {provider_name} has received your course credit request. We will update you when credit processing is complete.
sw_ke: {provider_name} imepokea ombi la mkopo wako wa kozi. Tutakujulisha kikamilifu pindi matayarisho ya mkopo yamekamilika.

source: View Details
sw_ke: Angalia Maelezo

source: <b>Congratulations!</b> {provider_name} has approved your request for course credit. To see your course credit, visit the {link_to_provider_site} website.
sw_ke: <b>Hongera!</b> {provider_name} imeidhinisha ombi lako la mkopo wa kozi. Kuona mkopo wako wa kozi, tembelea {link_to_provider_site} tovuti.

source: View Credit
sw_ke: Tizama Mkopo

source: {provider_name} did not approve your request for course credit. For more information, contact {link_to_provider_site} directly.
sw_ke: {provider_name} haikuidhinisha ombi lako la mkopo wa kozi. Kwa habari zaidi, wasiliana na {link_to_provider-site} moja kwa moja.

source: An error occurred with this transaction. For help, contact {support_email}.
sw_ke: Hitilafu imetokea kwenye muamala. Kwa msaada, wasiliana na {support_email}.

source: Current Verification Status: Approved
sw_ke: Hali ya Uhakiki wa Sasa: Imeidhinishwa

source: Your edX verification has been approved. Your verification is effective for one year after submission.
sw_ke: Uhakiki wako wa edX umeidhinishwa. Uhakiki wako utatumika kwa mwaka mmoja baada ya kuwasilishwa.

source: Current Verification Status: Pending
sw_ke: Hali ya Uhakiki wa Sasa: Inangoja maamuzi

source: Your edX ID verification is pending. Your verification information has been submitted and will be reviewed shortly.
sw_ke: Uhakiki wa Utambulisho wako wa edX unangoja maamuzi. Taarifa za uhakiki wako zimewasilishwa na zitapitiwa muda mfupi ujao.

source: Resubmit Verification
sw_ke: Tuma tena Uthibitisho

source: Current Verification Status: Expired
sw_ke: Hali ya Uhakiki wa Sasa: Imepitwa na muda

source: Your verification has expired. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
sw_ke: Muda wa uhakiki wako umeisha. Kupata cheti kilichothibitishwa, lazima uwasilishe picha yako mpya na kitambulisho chako cha picha cha serikali kabla ya muda wa mwisho wa uhakiki wa kozi yako.

source: Could Not Link Accounts
sw_ke: Haikuweza Kuunganisha Akaunti

source: The {provider_name} account you selected is already linked to another {platform_name} account.
sw_ke: {provider_name} akaunti uliochagua tayari imeunganishwa kwa akaunti nyingine ya {platform_name} .

source: Results:
sw_ke: Majibu/ Matokeo:

source: Topic:
sw_ke: Mada:

source: Show Discussion
sw_ke: Onesha majadiliano

source: To view live discussions, click Preview or View Live in Unit Settings.
sw_ke: Kutizama mazungumzo yanayoendelea, bonyeza Mtazamo kabla au Tizama yakiendelea katika Mikakati ya Kitengo.

source: Discussion ID: {discussion_id}
sw_ke: Kitambulisho cha Majadiliano: {discussion_id}

source: Discussion topics list
sw_ke: Orodha ya mada za majadiliano

source: Filter Topics
sw_ke: Chuja Mada

source: filter topics
sw_ke: chuja mada

source: All Discussions
sw_ke: Majadiliano Yote

source: Posts I'm Following
sw_ke: Mabandiko Ninayofuatilia

source: Filter:
sw_ke: Chuja:

source: Show all posts
sw_ke: Onesha machapisho yote

source: Unread posts
sw_ke: Machapisho ambayo hayajasomwa

source: Unanswered posts
sw_ke: Machapisho ambayo hayajajibiwa

source: Flagged
sw_ke: Imewekewa alama

source: Group:
sw_ke: Kundi:

source: in all groups
sw_ke: katika makundi yote

source: Sort:
sw_ke: Chagua:

source: by recent activity
sw_ke: kwa shughulu za 'karibuni'

source: by most activity
sw_ke: kwa harakati nyingi

source: by most votes
sw_ke: kwa kura nyingi

source: Student Notes
sw_ke: Nukuu / Nyaraka za Wanafunzi

source: Highlights and notes you've made in course content
sw_ke: Maangazio na nukuu ulizochukua katika maudhui ya kozi

source: Search notes for:
sw_ke: Tafuta nukuu za:

source: Search notes for...
sw_ke: Tafuta nukuu za...

source: View notes by:
sw_ke: Angalia nukuu:

source: You have not made any notes in this course yet. Other students in this course are using notes to:
sw_ke: Bado hujanukuu chochote katika kozi hii. Wanafunzi wengine kwenye kozi hii wanatumia nakala kwa:

source: Mark a passage or concept so that it's easy to find later.
sw_ke: Weka alama kwenye aya au maelezo ili iwe rahisi kuipata baadae.

source: Record thoughts about a specific passage or concept.
sw_ke: Nakili mawazo kuhusu aya au taarifa maalum.

source: Highlight important information to review later in the course or in future courses.
sw_ke: Angazia habari muhimu urudie baadae katika kozi au kwenye kozi za mbeleni.

source: Get started by making a note in something you just read, like {section_link}.
sw_ke: Anza kwa kuweka muhtasari kwa kitu ulicho soma sasa hivi, kama {section_link}.

source: Hide notes
sw_ke: Ficha nukuu

source: Show notes
sw_ke: Onyesha nukuu

source: Welcome to {course_name}
sw_ke: Karibu kwenye {course_name}

source: To get started, please visit https://{site_name}. The login information for your account follows.
sw_ke: Kwa kuanza, tafadhali tembelea https://{site_name}. Habari ya kuingia mtandaoni kwa ufuatiliaji wa akaunti yako.

source: email: {email}
sw_ke: Barua pepe: {email}

source: password: {password}
sw_ke: nywila: {password}

source: It is recommended that you change your password.
sw_ke: Imependekezwa kuwa ubadilishe nywila yako.

source: Sincerely yours,The {course_name} Team
sw_ke: Wako muaminifu, Wanafunzi wanaosoma {course_name}

source: You're almost there! Use the link to activate your account to access engaging, high-quality {platform_name} courses. Note that you will not be able to log back into your account until you have activated it.
sw_ke: Tayari umefika! Tumia kiungo wavuti kuamsha akaunti yako ili uweze kuzipata kozi shirikishi na zenye ubora kwenye {platform_name}. Kumbuka kwamba hautaweza kuingia mtandaoni tena kwenye akaunti yako mpaka uiamshe tena.

source: Enjoy learning with {platform_name}.
sw_ke: Furahia kujifunza kwenye {platform_name}.

source: If you need help, please use our web form at {support_url} or email {support_email}.
sw_ke: Kama unahitaji msaada, tafadhali wasiliana nasi kupitia tovuti yetu {support_url} au tuma barua pepe {support_email}.

source: This email message was automatically sent by {lms_url} because someone attempted to create an account on {platform_name} using this email address.
sw_ke: Ujumbe wa barua pepe hii ulitumwa moja kwa moja na {site_name} kwasababu kuna mtu alijaribu kutengeneza akaunti kwenye{platform_name} kwa kutumia anwani hii ya barua pepe.

source: Action Required: Activate your {platform_name} account
sw_ke: Hatua muhimu inahitajika: Amsha akaunti yako ya {platform_name}

source: Dear {full_name}
sw_ke: Mpendwa {full_name}

source: You have been invited to be a beta tester for {course_name} at {site_name} by a member of the course staff.
sw_ke: Umekaribishwa uwe mtumiaji wa kwanza wa {course_name} kwa {site_name} na mmoja wa walimu wa kozi.

source: To start accessing course materials, please visit {course_url}
sw_ke: Kuanza kupata nyenzo za kozi, tafadhali tembelea {course_url}

source: Visit {course_about_url} to join the course and begin the beta test.
sw_ke: Tembelea {course_about_url} kujiunga na kozi na anza kutumia kama mtumiaji wa mwanzo.

source: Visit {site_name} to enroll in the course and begin the beta test.
sw_ke: Tembelea {site_name} kujisajili katika kozi na uanze kutumia kama mtumiaji wa mwanzo.

source: This email was automatically sent from {site_name} to {email_address}
sw_ke: Barua pepe hii ilijituma yenyewe kutoka {site_name} kwenda {email_address}

source: You have been invited to a beta test for {course_name}
sw_ke: Umekaribisha kuwa mtumiaji wa mwanzo kwenye {course_name}

source: Thank you for your purchase of
sw_ke: Asante kwa ununuzi wako wa

source: Your payment was successful.
sw_ke: Malipo yako yamefaulu.

source: If you have billing questions, please read the FAQ ({faq_url}) or contact {billing_email}.
sw_ke: Kama una maswali ya ulipaji, tafadhali soma FAQ ({faq_url}) au wasiliana na {billing_email}.

source: If you have billing questions, please contact {billing_email}.
sw_ke: Kama una maswali ya ulipaji, tafadhali wasiliana na {billing_email}.

source: {order_placed_by} placed an order and mentioned your name as the Organization contact.
sw_ke: {order_placed_by} umefanya uagizaji na kutaja jina lako kuwa mwasiliano ya Shirika.

source: {order_placed_by} placed an order and mentioned your name as the additional receipt recipient.
sw_ke: {order_placed_by} umefanya uagizaji na kutaja jina lako kama mpokeaji wa ziada.

source: The items in your order are:
sw_ke: Bidhaa kwenye uagizaji wako ni:

source: Quantity - Description - Price
sw_ke: Idadi - Maelezo - Bei

source: Total billed to credit/debit card: {currency_symbol}{total_cost}
sw_ke: Gharama kwa kadi ya malipo/mkopo: {currency_symbol}{total_cost}

source: Company Name:
sw_ke: Jina la Kampuni:

source: Purchase Order Number:
sw_ke: Namba ya Uagizaji Manunuzi:

source: Company Contact Name:
sw_ke: Jina la Mawasiliano la Kampuni:

source: Company Contact Email:
sw_ke: Anwani ya Barua pepe ya Kuwasiliana na Kampuni:

source: Recipient Name:
sw_ke: Jina la Mpokeaji:

source: Recipient Email:
sw_ke: Anwani ya Barua pepe ya Mpokeaji:

source: Order Number: {order_number}
sw_ke: Namba ya Uagizaji: {order_number}

source: A CSV file of your registration URLs is attached. Please distribute registration URLs to each student planning to enroll using the email template below.
sw_ke: Faili ya CSV ya uorodheshaji wako kwa URLs imeshikanishwa. Tafadhali gawa uandikishaji wa URLs kwa kila mwanafunzi anae panga kujisajili kwa kutumia kigezo cha barua pepe hapo chini.

source: Warm regards,
sw_ke: Mwingi wa heshima

source: Warm regards,<br>The {platform_name} Team
sw_ke: Heshima zetu,<br>Kwa {platform_name}

source: Dear [[Name]]
sw_ke: Mpendwa [[Jina]]

source: To enroll in {course_names} we have provided a registration URL for you. Please follow the instructions below to claim your access.
sw_ke: Kujisajili kwenye {course_names} tumetoa URL kwako ya kujiandikisha. Tafadhali fuata maagizo hapo chini kuweza kujisajili.

source: Your redeem url is: [[Enter Redeem URL here from the attached CSV]]
sw_ke: Url yako ya ukombozi ni: [[Ingiza Ukombozi wa URL hapa kutoka kwa shikanishi ya CSV]]

source: (1) Register for an account at {site_name}
sw_ke: (1) Jiandikishe kwa ajili ya akaunti ya {site_name}

source: (2) Once registered, copy the redeem URL and paste it in your web browser.
sw_ke: (2) Pindi umalizapo kujisajili, nakili wavuti ya URL na ibandike kwenye mtandao wako wa uvinjari.

source: (3) On the enrollment confirmation page, Click the 'Activate Enrollment Code' button. This will show the enrollment confirmation.
sw_ke: (3) Kwenye ukurasa wa kuthibitisha usajili, Bofya kibonye cha 'Amsha Kificho cha Usajili'. Hii itaonesha uthibitisho wa usajili.

source: (4) You should be able to click on 'view course' button or see your course on your student dashboard at {url}
sw_ke: (4) Yakupasa ubofye kwenye kibonye cha 'tizama kozi' au ona kozi yako kwenye dashibodi yako ya mwanafunzi kwa {url}

source: (5) Course materials will not be available until the course start date.
sw_ke: (5) Zana za kozi hazipatikani mpaka tarehe ya kuanza kozi.

source: <p>Sincerely,</p><p>[[Your Signature]]</p>
sw_ke: <p>Wako muaminifu,</p><p>[[Sahihi Yako]]</p>

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us immediately. Contact information is listed at:
sw_ke: Hii ni kuthibitisha kuwa umebadilisha anwani yako ya barua pepe ihusianayo na {platform_name} kutoka {old_email} mpaka {new_email}. Kama hukufanya ombi hili, tafadhali wasiliana nasi haraka. Taarifa ya mawasiliano imeorodheshwa kwa:

source: We keep a log of old e-mails, so if this request was unintentional, we can investigate.
sw_ke: Tunaweka hifadhi ya barua pepe za kitambo, kwa hivyo kama ombi hili sio la kukusudia, tunaweza kufanya utafiti.
